{
  "https://www.youtube.com/watch?v=UNsQHosbIoE_tiny": {
    "key": "https://www.youtube.com/watch?v=UNsQHosbIoE_tiny",
    "basename": "ClaudeDev- NEW Coding Agent Can Generate Applications within VS Code! - Claude 3.5 Sonnet",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local/ClaudeDev- NEW Coding Agent Can Generate Applications within VS Code! - Claude 3.5 Sonnet.mp3",
    "metadata": {
      "audio_input": {
        "youtube_url": "https://www.youtube.com/watch?v=UNsQHosbIoE",
        "audio_filepath": null,
        "audio_quality": "tiny",
        "compute_type": "int8"
      },
      "title": "ClaudeDev: NEW Coding Agent Can Generate Applications within VS Code! - Claude 3.5 Sonnet",
      "tags": "claude_3.5_sonnet, text_to_application, text_to_frontend, claude_dev, claude-dev, claude_dev_vscode_extension, vscode_copilot, ai_coding_agent, github_copilot, deepseek_coder, aider, deepseek-coder-v2, deepseek_copilot, crew_ai, deepseek_agents, github_copilot_alternative, generate_application_with_ai, generate_apps_with_claude_3.5_sonnet, vscode, claude, vscode_artifacts, claude_in_vscode, claude_with_vscode, claude_artifacts_vscode, vscode_agentic_ai, claude_ai_assistant",
      "description": "In this video, we dive deep into ClaudeDev, the groundbreaking AI Coding Agent that seamlessly integrates into your VS Code environment. Powered by Claude 3.5 Sonnet, this powerful tool can generate entire applications, from NextJS and Python to games and websites, all within seconds! \n\n[🔗 My Links]:\n🔥 Become a Patron (Private Discord): https://patreon.com/WorldofAi\n☕ To help and Support me, Buy a Coffee or Donate to Support the Channel: https://ko-fi.com/worldofai - It would mean a lot if you did! Thank you so much, guys! Love yall\n🧠 Follow me on Twitter: https://twitter.com/intheworldofai \n📅 Book a 1-On-1 Consulting Call With Me: https://calendly.com/worldzofai/ai-consulting-call-1\n📖 Want to Hire Me For AI Projects? Fill Out This Form: https://td730kenue7.typeform.com/to/WndMD5l7\n🚨 Subscribe To My Second Channel:  @WorldzofCrypto  \nSponsor a Video or Do a Demo of Your Product, Contact me: intheworldzofai@gmail.com\n\n[Must Watch]:\nAgent-Zero: Autonomous AI Agent Framework Can DO ANYTHING! (Generate Full-Stack Apps, Code, etc.): https://youtu.be/70ZKqLXOOf8?si=rN3oNJsdnKKJ8QN3\nAider + Claude 3.5: Develop a Full-stack App Without Writing ANY Code!: https://youtu.be/dzOWn8TI738?si=p9Wko2iXrBn1xfxU\nAider + DeepSeek-Coder-V2: Develop a Full-stack App Without Writing ANY Code /w Best Coding LLM!: https://youtu.be/xcN3Lw0zbp4\n\n[Link's Used]:\nGithub Repo: https://github.com/saoudrizwan/claude-dev\nDownload ClaudeDev Extension: https://marketplace.visualstudio.com/items?itemName=saoudrizwan.claude-dev\nClaude API Key: https://console.anthropic.com/settings/keys\nVS Code Download: https://code.visualstudio.com/download\nCreator of CluadeDev's Channel: https://www.youtube.com/watch?v=1X3hghix8ZM @saoudrizwan - Huge props to him to create this! Sub to him and follow him on twitter!\n\nGet ready to explore how ClaudeDev takes coding to the next level with agentic capabilities, user-controlled commands, and real-time code generation.\n\n💻 **Video Content**:\nIn this video, you'll discover how ClaudeDev revolutionizes software development:\n1. **Generate Complex Applications Instantly**: Watch as we generate a fully functional NextJS app in seconds using Claude 3.5 Sonnet's agentic coding prowess.\n2. **Text-To-Application & More**: Learn how ClaudeDev can create entire games, web apps, and more from simple text prompts.\n3. **Advanced Integration with VS Code**: See how ClaudeDev integrates effortlessly with your existing VS Code setup, offering real-time code refactoring, CLI command execution, and more.\n4. **Human-In-The-Loop Control**: Understand how ClaudeDev’s GUI allows you to supervise every file change, command execution, and keep track of token usage, ensuring safe and controlled development.\n5. **Versatile Coding Agent**: Whether you’re working with NextJS, Python, or building games, ClaudeDev is your go-to tool for efficient and reliable coding within VS Code.\n\n🔧 **Why ClaudeDev?**:\n- **Real-Time Code Refactoring**: Update and enhance your codebases on the fly with easy-to-approve changes.\n- **Interactive Command Execution**: No need to open a terminal—execute commands directly in chat with full user control.\n- **Safe & Secure Development**: Every action is under your supervision, making ClaudeDev not just powerful, but also safe for complex projects.\n\nIf you found this video helpful, don't forget to **like**, **subscribe**, and **share** with your fellow developers! Stay tuned for more tutorials and deep dives into the latest in AI-driven development tools.\n\n[Time Stamps]:\n0:00 - Introduction\n0:37 - What is ClaudeDev?\n2:41 - Features\n3:28 - Installation\n5:45 - Demo\n7:00 - Creating a Finance App\n8:53 - Results\n9:25 - Conclusion\n\n🔖 **Relevant Tags & Keywords**:\nClaudeDev, Claude 3.5 Sonnet, AI Coding Agent, VS Code Plugin, Text-To-Application, NextJS, Python, Game Development, Web Development, Code Refactoring, Real-Time Coding, Agentic AI, Software Development, OpenAI, GPT-4, Grok-1.5, Gemini Code Assist, VS Code Automation\n\n📌 **Hashtags**:\n#ClaudeDev #AICoding #vscode  #CodingAgent #softwaredevelopment  #nextjs  #python  #TextToApplication #AgenticAI #gamedevelopment  #Claude3_5Sonnet",
      "duration": "00:10:06",
      "channel": "WorldofAI",
      "upload_date": "20240808",
      "uploader_id": "@intheworldofai",
      "download_time": "00:00:07",
      "transcription_time": "00:00:31"
    },
    "chapters": [
      {
        "title": "Introduction",
        "start_time": 0.0,
        "end_time": 37.28,
        "text": " On this channel, we've seen multiple coding based frameworks and tools.  You've definitely seen my inner videos or Agent Zero videos where they showcase how you can deploy  these AI agents to create various sorts of applications and UI components.  But today, I got something quite different than your general coding agentic framework.  Today I'll be showcasing Cloud Dev, which is a tool that can handle complex software development  as step-by-step, and guess what?  It's completely accessible through VS Code as an extension.",
        "number": 1
      },
      {
        "title": "What is ClaudeDev?",
        "start_time": 37.28,
        "end_time": 164.48,
        "text": " In simple terms, Cloud Dev is practically aader, but within your ID, such as VS Code.  It's an autonomous software engineer capable of creating, editing,  as well as executing commands, and more with your permission each step of the way.  This is something that we're going to be showcasing throughout today's video,  as I'll showcase how you can build full stack applications,  use utilizing Cloud Dev to edit code bases, as well as basically just generating code  to help you on each step of the way.  And as we see from the name of Cloud Dev, it's powered by the Sonic 3.5 model from  Anthropics Cloud series, and it's going to be providing agented coding capabilities.  This Cloud model is absolutely amazing, and people do not know how great this model is.  Beyond mere code completion, it's going to be offering in-depth project analysis  and command execution, which you're permission.  This is what is going to make Cloud Dev super powerful and complex software development.  Let's not take a look at some features.  With Cloud Dev, it's going to be providing in this intuitive interface within VS Code,  and it's going to allow you to oversee every change it makes with every command it executes.  And this is where it's going to be ensuring that you have  the human and the little feature integrated within this agentic AI framework.  You can make file changes, we can expect every change cloud mix,  as well as have it so that the AI agents can execute task, brought your whole code base.  You have a command execution that runs, I commands great from the chat,  without needing to open the terminal, you can have permission controls,  token and API usage is there so that you can track the token usage and the API costs.  You have task completion where once the task is completed,  a lot will suggest actions like opening a file in your browser,  but you can do it with a single click.  For quick access, you can just simply use a command shift, be sure to open  this framework quite easily and this is where you can start a new task  right with it within the editor itself.",
        "number": 2
      },
      {
        "title": "Features",
        "start_time": 164.48,
        "end_time": 208.32,
        "text": " we can execute commands with the client commands, you can list files on different paths,  you're going to be able to list paths for all files on this specified directory,  and you can see that there's various things such as reading files, writing files,  generating files, and saving files onto your computer.  You can also have it so that it can work with the existing projects,  meaning that you can deploy Cloud Dev so that it can leverage different file structures  as well as different file types that you possibly worked on previously.  In this way, you can have it so that it can make changes to those files.  And then again, it's only going to be working with your permission.  It will ask for permissions first before any tools are executed,",
        "number": 3
      },
      {
        "title": "Installation",
        "start_time": 208.32,
        "end_time": 346.24,
        "text": " Now, like I mentioned, there's two ways to install this.  We're first going to showcase how you can install this with the VS Code extension.  First things first, you need to make sure that you have VS Code installed.  This is an ID and this is something that you're going to be installing Cloud Dev  into as an extension.  So, install it for your operating system.  And once you have it installed, you want to simply open it up.  Now, once you open this up, simply click on the window,  and what you're going to be doing is heading over to the extension tab.  Now, what you can do is just simply install it  within the Microsoft Marketplace where you can just simply click on this,  and it would open up VS Code.  Let's say if it's not going to open it up,  you can then simply just search up Cloud Dev within the extension marketplace  by simply typing in Cloud Dev and then clicking enter.  You're going to be able to see it right over here,  and you're going to be able to then simply just click on install.  Once it finishes installing, you're going to be able to access it  within the left side of the panel.  Now, before we get started, I definitely recommend that you take a look at the Patreon page  so that you can access the new subscriptions that will be releasing this week.  I'd like to introduce world-of-a-I solutions.  This is a really big update that has been launched from my channel,  and this is where I have compiled a team of software engineers.  We have machine learning experts, AI consultants,  and this is basically the team where we're going to be providing AI solutions for businesses  as well as personal use cases where AI solutions can be implemented  to automate certain things or to help business operations.  Now, if you're interested, take a look at the type from link in the description below.  What you'll need to do next is get an API key from a drop-back,  and this is something that you can get started completely for free,  but they actually give $5 and free credits.  So I'll leave a link to this in the description below.  Once you have signed up with an account, just simply click on get API keys and generate your own key.  Once you have generated your key, just simply copy it,  and then get back into the escode, look on the cloud dev extension.  And this is where it's going to basically request you to paste in your key.  Now, you can utilize different API providers such as open router or AWS bedrock.  In my opinion, we're going to be utilizing endropic and utilizing the Sonic 3.5 model,",
        "number": 4
      },
      {
        "title": "Demo",
        "start_time": 346.24,
        "end_time": 422.16,
        "text": " So once you paste in your API key, just simply click on let's go.  And this is where you can now start basically working within VSCode to generate different components  and different sorts of full-set applications right within your ID.  Now, safer, interested in building cloud dev locally.  What you would need to do is simply first install git, which is an application that helps  you clone the repository onto your desktop, and you'll need to install NPM.  It's a package that you can search online, and once you have the installed, you can proceed forward.  Obviously, you're going to need to have Python installed, but once you have all these free  requisites fulfilled, clone this repository into your command prompt.  Once that is done, you can open the project up in VSCode  by simply just copying this and then running it within VSCode.  Then you can install the necessary dependencies for the extension,  as well as the WebU GUI, and you can just launch it by pressing F5 to open a new VSCode window.  So now, let's actually test cloud dev out.  The great thing I want to mention is that they're going to continuously upload more features to this,  so definitely keep this on the radar, because they're definitely going to be improving this further.  Now, I know you guys have been commenting on my videos.",
        "number": 5
      },
      {
        "title": "Creating a Finance App",
        "start_time": 422.16,
        "end_time": 536.48,
        "text": " application that allows users to track income and expenses.  This app should feature a dashboard displaying a summary of total income, as well as expenses,  as well as remaining balances.  So users should be able to add an added or even delete income and expenses.  I also told that additionally, implement a feature that can generate monthly reports in a PDF format,  summarizing the financial activity.  Ensure the UI is user friendly with clear inputs and navigation.  So we can see that if first started on generating the code for me,  and the great thing about this VSCode extension is that it has somewhat of a relevant artifact  feature that you would see within a lot actual chat model.  So you're going to be able to visualize whatever generations are made.  So in this case, what it did is that to accomplish the task, I'll break it down into  clear or clear what goes.  So we can see that's using HTML, CSS, as well as JavaScript.  To begin, we're going to need to create a new project directory and then the necessary files.  So it'll basically ask you that it wants to create a file within this pathway over here,  so you can simply approve it or reject it.  And you can see that it's working each step of the way to help you.  So we're going to approve to create this new file, create this new file that is necessary,  and it's going to start making the API request.  So I don't know if it's a problem on my end, but since there might be a couple of errors being popped up,  you might need to just keep on retrying command.  And you're going to be able to see that you can just simply click on run command and it will start  prompting to open this new task.  So in this case, we want to execute this and what it's going to be doing is that it'll showcase",
        "number": 6
      },
      {
        "title": "Results",
        "start_time": 536.48,
        "end_time": 566.48,
        "text": " And you can see that it had now finished creating this application, which is going to track my  expenses.  This is a really simple application that I was able to develop a couple of cents.  And this would be something that would probably cost employee probably a couple of hours to develop.  And you would have to pay that employee a couple of money to, I don't even know,  30 an hour to generate something like this.  But this was something that I generated within a couple of seconds with the help of God dev.",
        "number": 7
      },
      {
        "title": "Conclusion",
        "start_time": 566.48,
        "end_time": 606.0,
        "text": " I definitely recommend that you take a look at the creators YouTube channel, because you  goes in depth and showcases a lot more examples than I did.  So with that thought guys, I hope you enjoyed this video.  I'll leave a link to all the links that are using today's video in the description below.  Make sure you take a look at the Patreon page if you want to take a look at getting  different subscriptions to different AI tools fully for free on a monthly basis.  Make sure you follow me on Twitter.  Great way for you to stay out today with the latest AI news.  And lastly, make sure you guys subscribe.  Ground notification bell, like this video, and check out our previous videos so you can  stay out today with the latest AI news.  But with that thought guys, have an amazing day.  Prepare positivity, and I'll see you guys fairly shortly.  Peace out fellas.",
        "number": 8
      }
    ]
  }
}