{
  "KIS_BOOKCLUB_TEAMING_MICROBES_COMPOST_07_30_tiny": {
    "key": "KIS_BOOKCLUB_TEAMING_MICROBES_COMPOST_07_30_tiny",
    "basename": "KIS_BOOKCLUB_TEAMING_MICROBES_COMPOST_07_30",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local\\KIS_BOOKCLUB_TEAMING_MICROBES_COMPOST_07_30.mp3",
    "hf_compute_type": "float16",
    "metadata": {
      "audio_input": {
        "youtube_url": null,
        "audio_filepath": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local\\KIS_BOOKCLUB_TEAMING_MICROBES_COMPOST_07_30.mp3",
        "audio_quality": "tiny"
      },
      "title": "KIS BOOKCLUB TEAMING MICROBES COMPOST 07 30.mp3",
      "tags": null,
      "description": null,
      "duration": "00:55:55",
      "channel": null,
      "upload_date": "2024-08-03",
      "uploader_id": null,
      "download_time": "00:00:00",
      "transcription_time": "00:05:16"
    },
    "chapters": [
      {
        "title": "",
        "start_time": 0.0,
        "end_time": 603.28,
        "text": " any questions, jump in. I'm not going to follow the chapter terribly closely. I'm going to kind of, since you guys have probably read it, I'm going to kind of just share, I have a lot of thoughts around compost. So this is a great chapter to talk about or have a dialogue around. So, all right, here we go. Recording in progress. Okay. Well, club chapter 16, team with microbes. Thank you to Margaret and Colleen for joining us in Brandon. We're going to be talking all about compost in mulch today. And some of the stuff Jeff talks about. I agree with some of it. I have a little different opinion on, but to be fun to have a discussion around that. One of the reasons that compost is such a useful tool and what has been such a useful tool for generations is because it has a lot of fertility and it has a lot of beneficial microorganisms. I mean, he lists here up to a billion bacteria in a teaspoon, 4 to 900 feet of fungal hyphae, up to 50,000 protozoa, up to 300 nematodes. So, the amount of biology that we have in soils is just magnified immensely in compost. So, that's why we use compost to make aerated compost teas. That's why compost is such a great tool. He makes a very good point about how not all compost are the same. In fact, commercial compost tends to not be very good in general. We struggle with this more than anyone because we have to use commercial compost and making our soils. And it's really hard to find a company that we want to work with because most commercial compost are rushed. They charge you to collect your yard waste and your material. Then they compost it. It's quickly as they can and they turn around and sell it back to you. It's a pretty interesting business model. That being said, a lot of times they don't compost it long enough, or they're composting things that you don't really want to compost. So, stuff ends up in there. Whether that leaves them in spray with pesticides and yard waste, whether that's plastics, like plastic bags, and other things that people use to collect the yard waste and don't separate out, there's always stuff in there. And so, even with the compost sources that we use, one of them secost does not use any post-consumer waste. That's what we call yard waste and things like that. The only mountain fish compost, which is a two-year age compost, is one of the better commercial compost out there. I still find pieces of plastic and things like that. And now that we know about microplastics and some of these PFAS or PFAS, these forever chemicals, it's becoming more of a concern to be finding plastics in the compost. We may be compounding the microplastic issue in our garden by utilizing these compost. So, it's something to give a thought to with where you choose to source your compost, or a reason to make it yourself and keep in mind and try to keep these inputs out of your garden. In terms of making compost, you know, there's a lot of great books out there. I'm making compost. Basically, the one thing that Jeff talks about here is that it's really about your carbon and nitrogen ratio, which you can also think of as your greens to browns or bacteria to fungi. So, your browns are anything that's brown in color. Ode leaves that no longer green. Twigs, branches, anything that's high in lignin, all those things are going to be high in carbon, whereas you're getting a nitrogen source, the greens from green leans, or green yard waste, or lawn clippings, is probably the biggest source. So, balancing that, having the right ratio of greens to browns will allow the microorganisms to properly compost the material. That means that they're going to start reproducing quite rapidly. It's an exothermic reaction in generates heat. That pile, as long as it's a minimum size of, you know, three feet by three feet, by three feet, approximately, will heat up. If you think about it, you put all these bacteria in a room together in a space. They all start reproducing as fast as they can. That's going to generate temperature. And that temperature that it generates will get up. If you don't turn the pile, we'll get up above 141 degrees. And when it does that, and holds that for a period of a day or two, that allows you to kill off the weed seeds, and any weeds that you have in there, as well as break down the material faster, any pathogens as well. And so that's essentially what thermophilic compost. There's three different ways you can compost. And this one we're talking about first is called thermal composting, or thermophilic composting. And so by doing this, what we're doing is we're getting a lot of biological growth and activity. We're hitting a temperature that's going to kill off weed seeds and kill off pathogens, and then allow us to end up with a final product. At a certain point, you know, the heat's going to go up to, and when you want to get when it gets up to like 160, we want to turn it by adding oxygen, and that will lower the temperature than it may rise again, and then when it gets up to 15560, we're going to turn it again, and then we'll keep doing that until eventually it's not going to heat up any. And at that point, we could say okay, the compost is finished. And that's the thermal process. So the advantage of that really, the big advantage is the pathogen and weed seed control. So it's a great way to compost. It's the probably the most intensive way of compost in terms of labor and time. There's great websites out there for calculating greens and browns, and so you could literally put in the type compost calculator in the Google, and if you can't find it, I can send you a link. And you can put it, and I have wood chips. I have grass clippings. I have all of these different things, and how much of these things you have, and then it will calculate out your carbon and nitrogen ratio for you. So you don't have to try and figure that out. And then Brandon, do you want to talk a little about seed end ratios and what you look for in a compost? Yeah, and I was going to ask a question because something that, you know, I just honestly, I just need to look it up on Google. But what is the difference between exothermic and thermophilic? Are those, can we use those words interchangeably because I do, and I might be doing that incorrectly? So exothermic refers to the reaction of the bacteria reproducing, which means it just generates heat. Like wood. Like potassium's, like it is an exothermic reaction. Exactly. Okay, okay, okay. The way I think about it, like if you, if you put two people in a room, and they're going at it, they're generating temperature, right, just from their exercise that they're getting. And so it's the same thing with bacteria when they're reproducing. You can just give you a mental image there. And so if you have all this bacteria reproducing rapidly, you know, every 20, 30 minutes, you know, they can potentially double, then you end up with a pile that's going to heat up really quickly. That's why it only takes, you know, 24 to 72 hours for this process to really start. If you get all of it in there, because if you think about it, it's, you've just created the optimal environment in terms of you've given all this bacteria, food source, and they're just going to start eating it as fast as they can and reproducing as quickly as possible. So, okay, we're going to start with a thermophilic refers to the type of microorganisms that handles a certain temperature range. So that's the big difference. I think it has to do with like microbial adaptation. So some of these microbes are designed to survive to certain temperatures. And a lot of these pathogens can't handle those higher temperatures, whereas some of the beneficial microbes will either go dormant or they will die off too. But when you come back into that pile, you'll have, you won't have necessarily these pathogens, but you'll have beneficial microbes that will re-opulate and grow out of what's left. So you're not killing off all of the microbes in there when you reach a certain temperature, but you are killing off the majority of the bad guys. And the other thing to think about with this, too, I think about like, if you have a pile, that whole pile is not going to be 155 degrees. So the outside of the pile, you still could have pathogens, and that's why you have to turn the pile. But realistically, you're probably not getting all the pathogens. You're probably just reducing the amount of pathogens overall in that pile. But potentially, it's always going to be some in there. Same with like, you know, when every time you use organic matter or compost, I just assume you're going to bring in fungus nuts. It's not always the case, probably about 25% of the time. It happens depending seasonally, but there's certain things they're just kind of unavoidable or hard to deal with whenever you introduce organic matter compost into your garden or into your house or things like that. And just luckily for us, it seems that the virus, this is the vieroids, the things that we don't want in there, the fungal pathogens, they just don't hold up as well as some of this, this bacteria and things that",
        "number": 1
      },
      {
        "title": "",
        "start_time": 603.28,
        "end_time": 1210.56,
        "text": " They might have some protein layer around them that the vieroids doesn't have. There's just a bunch of different life strategies. And it's really interesting to look back at historically on the, you know, just the time frame of some of these, you know, the evolution of some of these organisms and some of these, some of these organisms have been around for so long that they've got these amazing life strategies and some of the newer ones don't. But the things that I look for in a compost, I want to pH anywhere from five, you know, five, eight, seven, seven, five, even, pH isn't like the maker break for me with compost usually, it's usually the carbon and nitrogen ratio. And we talked about that before, but just just to hit that note real quickly, there's a certain bacterial to fungle ratio, or sorry, carbon to nitrogen ratio in the soil and the bacteria that's in that soil kind of demands that it stay at that same ratio. So if we add in a bunch of wood or wood chips or carbon of some form, the bacteria gets upset and wants to break that down to get back to that old carbon to nitrogen ratio. And so it locks up your nitrates and uses that as an energy source in order to break that carbon down, to break those carbon bonds. And so it leaves you, the reason you don't want to use that compost is because with that bad, you know, let's say 22 to one, 25 to one, it's going to tie up your nitrogen won't be available to your plant. And so that's why we want to avoid that. After that, I want to see the bad actors, the ones you'll see on a standard soil test or compost test, would be sodium and chlorides. You know, that's one of the challenges we have with this style of growing is we end up accumulating sodium and chlorides because we don't have run off the typically. And so anything we can do, you know, waters, you know, when you look at frequency and application rate, waters, the really bad one. But compost, warm casting, stuff like that, they'll all come in with some elevated sodium and chlorides. So I want to see those numbers. And they're rarely going to be perfect. But we want it in the same way that like soft rock phosphate, we like cowfoss instead of furtoss furtoss has a little bit more content. It's a 070, cowfoss is a 030. I think that's right. But cowfoss has significantly less arsenic. So that's the pick for me. So you want to see those bad actors, sodium and chlorides. And then, ultimately, especially if you were doing this on scale for a facility where you're going to be, you know, getting tested and being held to certain, you know, metrics for heavy metals, you definitely want to see there heavy metal tests. We see lots of arsenic, what else led, cadmium. We see heavy metal issues with arsenic and mercury is also in there. And so with compost, those are the things I really want to check on. Those are the things I really want to make sure good. I can deal with PHB in a little bit off. I can even deal carbon and nitrogen ratio being our little off because we'll just add more nitrate. That's not optimal, but, you know, we do what we have to do. But when it comes to really bad sodium, really bad chlorides or heavy metals, I'll walk away from it for sure. So I put up on the Screena, the CCOs compost. And you can see the PH is high. That's partly due to the ammonium content that has. And typically what we look for here is I tells me that there's still some nitrogen cycling. It going happening in the compost itself. But do they have very low sodium, chlorides is higher than I would like to see at 445. But we're only using it for a small portion of our mix. And it's kind of one of those things that is what it is. But when I go down here to the C to N ratio at 15 and look at the rest of CO2 evolution here, this tells me this is a very stable compost. And this has been composted for a longer period of time. And one of the challenges, you know, like this test here was $320, the testing is quite expensive for compost. Unfortunately, to get these metrics, the methodology that they use just costs a lot of money. And so you should be able to get this from any commercial compost company that you go with. This is something I would expect them to be able to provide. Now, in addition, let me see where my am. On that same note, it is good when you tad mentioned the ammonium and the pH relationship there, because most substrates that you're going to formulate a peak base are going to have a very low pH. We don't mind higher pH with compost outdoors. It might be a different conversation, but if you're formulating a soil, it really the higher pH is not a bad thing, because it will help balance that peak. Now, here's a test that they did on only testing for all these different things, including heavy metals. And it came back without all of these potential pesticides, but it does have heavy metals in here, and you can see, you know, 9 ppm of arsenic, 0.5 ppm, milligrams per kilogram. This is the same as ppm. 53 copper, 37 lead. This test is higher than I would like to see for a compost. So knowing this, I would use a less evaded in my mix to adjust for the levels of heavy metals. That being said, all compost have heavy metals for the most part, so it's a matter of managing them. But in this test case from 2016, this is a very old test. I just happened to pop it up in mind. The main thing is something I've saved, but this is something you could also ask for from a compost company as well. And then lastly, along those lines, as far as, you know, Ted just said that if it had higher heavy metals, we would use less of it just for the tilt of the soil. You know, a lot of folks who and they start off in organics and they start making their first, because it's fun to make soils, you know, and so they want to make a small batch. I don't like the the koot method of the one third, one third, one third, one third. I think that with one third compost, you end up with a really mucky heavy mix. And so where I always get bogged down on fertility, Ted always reminding me there's the physical and the biological aspects we have to balance as well. So when you're formulating, you know, a mixture for yourself or something like that, keep that in mind that, you know, don't overdo the compost. And then this is what the compost looks like under a microscope with 24 hours after adding some molasses, this is the only compost. And you can see if you look really closely. Oh, I zoomed in here. Hold on, it'll get clear. All those little things moving around. That's all the bacteria. Okay, I zoomed in really far here. There you go. You can see a little guy cruising around. You have to remember, this drop of water to them is like a swimming pool. It's there in the ocean. So it's really hard to get everything in focus. But you can see the biological activity, all that bacteria moving around. And then that's fungal hyphae. That's what those, sorry, this was recorded a long time ago. So I can't control the screen. What you're seeing here, these little white lines, that's fungal hyphae. And that's what we see. So there, there should be a balance of bacteria and fungal hyphae in your compost. And then you will see larger microorganisms on occasion like nematodes and protozoa, phlegilots, meba, and things like that. So that's, that's what a typical compost might look like under a microscope. So, okay. So we've used only for years. We've added two new compost this year and it takes a long time because you have to, you have to find them, you have to vet it, you know, through their tests and then you do independent testing and there's just, it takes forever. So usually it takes us a year or two to get comfortable using compost. And then it's like will they even sell it to a set of price that we can even begin using it because it's so expensive. Like that secos compost, you know, it costs us a few hundred bucks a yard, plus shipping to get it to us from the Oregon coast. So it's just, it's challenging. But yes, so we now have a lane compost mix that we're still dialing in. We are latest tests showed way more nitrogen than we want it. So we're Bren and I are going to, and you're going to hit the, go back to the drawing board on that one and",
        "number": 2
      },
      {
        "title": "",
        "start_time": 1210.56,
        "end_time": 1819.12,
        "text": " And then the, the traditional mixes were all made with only and those we have, those we currently have available. So yeah, we're adding more as we speak, but it takes a long time to do it correctly. We could release a mix a week, but realistically, like if we want to do it right, we, it takes us a year to get a really, you feel like very confident that all growers can have a good success in the, in the mix. At what micro scope do you use? And is there like a, a good bottom introductory microscope you would recommend for folks? Yeah, so I have a Mayshi MX series microscope that is, I'm looking at right now. It's right next to the area. If you can see it over there, there it is. It's, it's, it's really nice. It's a phase contrast microscope. And what's great about phase contrast is, it's, it's, see, there's a lot of these microbes have the same refractivity as water. And so having phase contrast allows it to better differentiate these microorganisms versus a traditional bright peel microscope, which is what you used in high school and college. So I would say, in general, the microscope is by the last thing I would buy. It's a hobby that, you know, from most people. It's like if you find this really interesting, great. You can get a microscope and look at it, but like in terms of an actionable tool to use in your garden, it's probably the bottom of the list in my opinion. Some people build it up like it's super important, but it really doesn't give you a ton of actionable information. Now, it allows me to test out different compost mixes and kind of see what kind of biological activity is there. Or like, if I want to try out a new food source, like for example, one of our vendors came out with this spray dry fish powder. And I was like, oh, man, I hate using fish. I'd rather say it's stinky. It's a liquid. Can I buy this powder and get the same results? Well, when I put them both under the microscope as a food source with a compost and distilled water, the spray dried fish just, it looked, it looked worse than when I just used this big compost and wall, a straight compost and water. Whereas the fish, I'd rather all say it, I got this like explosion of growth that I used to see from fish products. So that's where that's where a microscope is useful. Or being able to throw a compost in the microscope and see what kind of biological activity you have. You're not identifying the species or strain of bacteria, anything like that, but what you can do is you can say, okay, well, I have good diversity. So I have the morphology and these microorganisms is different. And we have good numbers. So our biomass looks good and then I can feel confident using that compost in that regard. So in general, I don't recommend people buy a microscope. I think it's overrated. I know there's people that are involved with you. The only time I use mine is to check my nematodes. That's just full disclosure. That's the only time I use them anymore. Are you seeing that when you're dying out with a dynamite though? I bet I could. I bet I could. I've got this weird little, I've got all kinds of scopes and stuff. But I've got this little digital cheap. Okay, but you put slides on and stuff. And I can I can run it to my TV or to a computer and take pictures. And I burned up my actual, yeah, yeah, my dialogue works great. But I burned up my microscope. I when we moved, I got the plug separated from it and I plugged the wrong hour into it. And when I turned it on, yeah, there's seconds later it was roasted. So these microscopes are much more useful. So the big difference is with this, the light is coming from this side towards the image. Whatever it is, I'm trying to get a picture of, whereas with a traditional microscope with the lights coming up through the slide and through the image. So for looking at insects, looking at tricomes, looking at all those different things, this style of microscope is much better. And I did a review on YouTube of this $30 Amazon microscope versus this, I think this is like $400, $450, now this dynamite, they keep racing the price on it. Now this thing is better, but I have to have it plugged into my laptop. This one I can actually use with my phone. It has like an app. Now, it's not perfect, but for the price, it's something, it's something many people can consider that don't want to spend that much money on a microscope. So these are these are my favorite for in the field. These are made by a company called Carson and they make these little, they have little LEDs and you can buy them with a little clip that goes on the top and you can mount your phone camera to it. So I can actually take this into the field and take pictures of insects and stuff and get pretty good quality and you can buy like four of these for $40. So, and I did a whole talk with Suzanne, but pre-COVID talking about microscopes in general, it's like the right one for the right job. So we're getting off topic. No, no, it's all good. So the other thing he talks about, which this is where I probably have a little bit of a different opinion with him, is this idea of bacteria making a bacterial compost versus a fungal compost. I wouldn't get caught up with that. We just want to hit the right greens to browns, the right c to n ratio. Yes, some plants prefer they're naturally in the form of nitrates. Yes, some prefer them in the form of ammonium, but plants control that and the nitrogen cycle is going to occur naturally anyway. So it doesn't really matter. You're going to have good bacterial numbers no matter what. So like we have a compost that we call fungal compost. It's just because it has decent fungal activity in it. The bacterial still there in high numbers. You're never going to make a low bacteria high fungal compost. It doesn't really exist. So just making sure I think if I think of something where I want a more fungal to increase the fungal activity in my soil, I would probably do an application of fish hydrolysis, or molasses, because those are both good fungal foods. And I would make sure I'm mulchy with wood chips or something that's more of a browns higher carbon source, adding biochar, things like that. So we'll talk about mulchy next. But in terms of compost itself, if we're talking about thermal compost, just make sure you hit the right ratio to get it to actually compost properly. That's key. Not so much about bacterial fungal compost. What's interesting and funny is he talks about compost for the lazy, a modern mix for instant compost where he mixes brown tree leaves and a 50 pound bag of alfalfa meal. This was my dad's go to recipe for making compost for years when we had when we were just a compost tea company. He would get a bunch of deciduous leaves and then add a bunch of organic alfalfa meal to it and mix it together. It would heat up cool down and then he would just let sit for like a year. And then that would have a very good level of biological activity. And not only that, but it would have more established microorganisms because these organisms have time to evolve over the course of a year or two. In general, the older the compost, the better the compost, just as a general rule. And then the other thing he talks about the last thing with compost, there's really three types. So we've been talking about thermal compost. That's where it's going to heat up and cool down. The two other types of compost are vermicompost where you use worms to compost the material and then static composting where the material just sits for a really long period of time. It's where you make a pile throughout the corner and it just breaks down over the course of six months or longer. Now, my preference if we want to make the highest quality compost for gardening, it would be to use no post-consumer waste. So if it would be to start with materials from your own property, ideally it would be things like grass clippings and leaves. Or in the fall if you did leaves and added, you know, bought some organic alfalfa meal and mixed that together. And if you went through that thermal process first, then after that and just if you left what's left there, it would probably look like you'd see some shredded leaves left but for the most part it'd be pretty broken down and started to turn into this brown, friable, coffee-ground-looking material. Leave it on the soil and worms will start coming up into that and start working that material for you naturally. And so over time, you kind of get the best of all three worlds. You get a static compost that's sat for a long time. So these microbes are at time to evolve and really get more established and get more balanced. You'll have the vermicontos because the",
        "number": 3
      },
      {
        "title": "",
        "start_time": 1819.12,
        "end_time": 2425.44,
        "text": " worm castings, which is what we want. And you did that thermal process first so that should have killed off more of the weed seeds and pathogens so there's that's not as much of an issue. That to me is like the best way of making compost. Now, if you're in a hurry, Johnson Sioux compost is a method that's really good. There's a ton of different composting methods. Lube key, you can research this. We can talk compost for days but just to simplify it, I'd say the keys are if you decide what type of compost you want to do, thermal vermicompost static or combination of those. And then if you do decide to do thermal composting, make sure you have a pile that's a minimum size of three by three by three by three feet and that you have the ability to turn it and then make sure you have a compost thermometer and you go online and look up a compost calculator that allows you to get the right carbon to nitrogen ratio or greens to browns initially. That's right. My favorite way to compost if if you have the space to do it is I will make a basically a circle with I've used chicken wire but all kinds of just like rabbit wire fencing things like that and I'll fill that up and then I can basically just turn like the answer long. I can make hooks out of those and so it's a self-contained unit. I can let that compost for a week like that. I can pop that thing back open and then it's super easy. I don't have the world's best back so it makes it really easy because I'm not having to scoop it up and out of anything. I can essentially knock the top over and then just shovel what was on bottom up on top and so it makes it a really easy way to move it around your property and to I don't know it saves me some some wear and tear on my back. All right any questions on compost for we move on to mulch? you you yeah you yeah, now because nothing wrong with food scraps and completing that circle is great by cutting it up you're increasing the surface area which means the microorganisms can break it down faster that's sort of the science behind that and there's a lot of different there's now that I think about there's other methods of composting so we could compost and aerobically where it's using low oxygen microbes things like bocashi that's really what that's about or we could compost using other insects like black soldier flies for example are really a meal order boosters you can compost things so yeah that wasn't a comprehensive list in terms of food scraps though the challenges with food scraps are a few things so one they tend to attract insects and and meet or things like that they also attract rodents and that's a big challenge you why don't you name up all day the SF nematodes you I think it's just too expensive I think it's just a cost thing like I would love to add some of those things to our soil mixes but then I would be pressing this out of yeah yeah that's a big challenge but the best thing for rodents I see Colleen's got at least two that I've seen and I've got a farm here that we'll try to take a deer if he gets a chance at it and I mean field mice rats, moles, bowls they don't stay in a chance out here yeah that is one of the challenges with food scraps they also are high in water content which can make things challenging because one of the things we didn't talk about is sort of moisture management in compost piles and so too many food scraps I can especially like a verna compost system so my my perfect way for compost or for composting food scraps would be in a verna compost system but that involves a little bit more scale than like one of those little tiny things that you see you would need a larger amount to deal with the amount of food scraps of the average thing produces the average family produces so like for us for food scraps I use chickens which is really really nice in that regard but that's not for everybody so yeah I think those are the big challenges with food scraps but you can absolutely use them they just tend to bring in more water and less fertility and make it a little harder to calculate that see that in ratio there's just not a lot of nutrients in in these food scraps in general relative for the amount of water that they bring in in my experience but yeah my my wife just sent me a snapshot of the nutrients and butternut squash and she was like or spaghetti squash just like remind me why we eat this again because next there's next enough than in it and so you know my my challenge with food scraps is I've never been able to get enough and I've even gone to like third party I tried to hit up all the health food stores that juiced and stuff and say hey I'll come pick this up every morning you know and they let me do it for a couple of times every single time eventually I run into a manager that's like yeah we're not doing that and they they think I'm eating it they think you know I'm a weird looking guy I get it but they think I'm doing something weird you know with it and they're worried about their liabilities so they cut me off and you know I don't have birds out here in Washington but until I moved I've always had chickens and between chicken poop feathers the bedding it's just such a great nitrogen source you know I sleep at the feather and the poop is just phenomenal and I was in a really hot really wet climate so I could turn it over fast you know and break down really fast and so I could throw you know half of that on top of just whatever my regular yard waste was just and it would just it would just literally eat it you could just watch it out the window just break down as amazing there's a there's a turn for it so what we what I do and people come over and they're like how is your chicken poop look so clean and part of it is having enough space for the number of chickens you have like not having too much of a chicken density but the other thing is and I throw food scraps in there every day that I don't have like our you know I'll see it rotten strawberry or you know zucchini that is I don't want to eat I'll chuck it in there and they'll take care of it but it all breaks down really rapidly because my bedding is all wood chips in their arborus chips and so that is a very high brown source the chicken poop and you know whatever is left of the veggie scraps that they don't eat are all nitrogen sources more or less so that creates that environment where these things break down rapidly and so I don't really ever clean my chicken poop it it takes care of itself in that regard and then when the levels come down at some point in time I'll have to add more wood chips or eventually I'll have enough organic matter that will build up in there that I may need to remove something but you know for the last two years since adding the wood chips I haven't had to do anything now when I first got this chicken coop the previous owners had put it was a",
        "number": 4
      },
      {
        "title": "",
        "start_time": 2425.44,
        "end_time": 3033.36,
        "text": " up and then they because that got muddy which is it to be expected they they put down plywood and so they had a layer of plywood and then they put a bunch of like iron shavings on top of that now that created an environment where you had a lot of anaerobic activity happening and things weren't able to break down naturally water was sitting on that plywood and so I had to go in and remove this year old plywood was disgusting because they used like really thick plywood too so like it was heavy and I got I had to take all that out and take it to the dump and get it out of there and once I did that and brought in wood chips you know like large arborus chips probably about golf ball size the thing is pretty much passively compost and taken care of itself and so it's just so much easier and it's never muddy in there and it's never thinking in there because these the microbes take care of it for you so that's kind of an example of what these these composting microbes are nature can do for you I never I never did it just to do the chicken coop but if I did have leftover compost tea I would spray down the wood chips in and because our last place we were in you know we had neighbors on both sides of us and if it had stunk somebody could have complained and we would have had to get rid of the birds and so we just you know one always give your neighbors some eggs and they'll leave you alone about the chickens but we we kept it really clean and it didn't stink it just never smell bad and I think like tad say and wood chips and then on the you know off days where I had a little extra tea I would just spray it on there I know people that swear by like Bokashi and I just don't think you need to do all that for your chickens. Yeah my dad actually was researching using arid and compost teas with poultry production and they got good results with it actually which makes sense you know if you think about it it's just breaking adding more beneficial microbes to break everything down so yeah that fits. Well you know what we are 50 minutes in and we haven't even talked about mulch but our next in last session is really short it's only it's chapter 22 on growing annuals and vegetables and then Jeff talking about the fact that we don't have to fertilize old growth forests and that section and then lastly a little like a little thing on a garden calendar soil food web garden calendar so I'm thinking we save mulch for next garden or next book club and then add those two chapters to it and I think that'll work down really nicely. Okay awesome one other note I have used Bokashi in the litter box and it's a miracle product and I would not say that lightly it will shut down all that ammonia smell that comes out of a litter box it was pretty impressive somebody sent me some they swore it would happen and I was like yeah so they sent it to me just to prove it and it worked it was pretty cool that is a good point that Jeff said he said you can test compost I would never spend the money to test compost it's hundreds of dollars in general to do that so I think a better test for homemade compost is really what he lists here it's just smelling it so if it smells like ammonia that means it's stopped finished if it smells like actinobacteria what he calls actinob my my studies and here is that earthy rich compost smell that's how you know you've made good compost and I think it's really that simple if you used a lot of nitrogen in there keep in mind you may be adding a fair amount of nitrogen to your plants if you top dress with it and you want to account for that which means maybe cutting back on some of your other nitrogen but but barring that I think I think compost is is a great tool I tend to buy mine just because of time constraints it's a lot of labor to make your own but if you have time and you have a lot of organic matter that needs breaking down that's a great it's a really great option Ted's dad loves to make compost he loves compost everything compost he loves it and so this year he built with some cattle panel he built like a really long probably it's probably 10 12 feet across and it's probably 50 feet long and anything that we chop you know like the powdery mildew really came in on the comfrey last week so I chelped all that down it all goes in there just literally everything on this property goes into that and then he can turn it with the tractor you know and so we can put a lot of tractors make everything different I'm not tractor savvy and it's been really interesting to see all the things you can do with with the tractor it's pretty cool but you can use the harness oh sorry she's not concerned with like hitting temperatures and like getting it all dialed in he's just really more static composting he's not managing his greens to browns or anything like that he's just throwing it all in the pile and knowing that eventually nature is going to take care of it for him he loves collecting leaves from neighbors and just I mean we in when we lived in Redmond, Washington there was a sign out in front of our house and keep everyone rather than taking to their leaves to the dump because they'd have to pay for that they would bring them all to our house and my dad would take them all and then it was my job to open them all up and scatter them all in the garden and it's a big slimy monkey mess and then they would break down all during the winter and then in the spring he would just push him aside and plant right into them and the tilt in the garden I will say like you could reach your hand down into that soil over time now could he have been bringing in herbicides and pesticides and other things I mean potentially yes but you know he wasn't really that concerned about it and it seemed to work well so you don't have to apply a ton of science to compost it don't let that be a barrier and getting started didn't literally just make a pile stuff and it'll slowly break down yeah I feel like for me here I want to work at it harder because we have cool temperatures and you know it just doesn't move as fast as I'm used to because I feel like I could static compost in South Carolina pretty easily just because it's going to get rained on and it was going to get hot every day and so it's just going to burn right down no matter what I do out here things definitely move really slowly when we've got some I don't know we put down about four inches of dairy wash in the entire blackberry area and plants did amazing they're they're taken off we had a huge garlic harvest but I'm surprised at this how much residue is left after a full season so things do move slowly out here so I like to turn it more and that kind of stuff I will any questions or do you think before we I was just going to share with you that I I tried to do compost here but because I live in the mountains and it's a really cool up here I I kind of gave it up so I mean I guess it's something I could maybe try again my sister takes care of the hands and she uses she uses the barley straw in her house I mean she keeps the house really clean for the hands and whatnot and she hadn't really been saving like the hand poop for me and I'm going to put it a work and bring to that for me but I kind of gave up on the compost because of my location because I mean we're almost we're about 38 39 hundred feet elevation and you know we have like maybe 60 days of really warm weather but you know we don't really have super super duper warm weather but I know what you're talking about is mixing the right ratio of the greens and the browns and so but I'm so busy with other things I I haven't really taken the time for it but maybe I'll give it a whirl or try it but in cold temperatures places that are colder I've been really really impressed. Tads Dad has two of the really big round tumble style composters and if you get one of those and it's black and even in the cooler days you'll be surprised at how I mean I broke down a bunch of whole sunflower plants like the big Russian mammoth sunflowers you know potentially we're going to accidentally grow a bunch of sunflowers when we put that out but you know we did break it down in a season and I was really impressed I didn't expect it to. So the chicken method is called the deep litter method I don't know I couldn't think of it earlier so you could look it up and then in terms of the composting I'd say the big pointers would be make a big enough pile you need like that thermal mass so like our compost pile and in redmond where we where we had where we get composting I could reach into the middle that with snow on top and it would still have warmth. So I think that's the key is having a big enough pile and then getting that right ratio and you should be able to compost in the dead of winter. In fact there's a famous guy I think his name was Will Powers.",
        "number": 5
      },
      {
        "title": "",
        "start_time": 3036.32,
        "end_time": 3351.68,
        "text": " what he was famous for was in the deep like cold of winter he was growing lettuce in a green house and the way he was heating the greenhouse was by pipes going into his compost pile and a compost pile is generally a ton of heat and then he was piping it into the greenhouse just to maintain a minimum temperature and so that allowed him to work all through the winter without any other exterior heat source. Really amazing guy. In certain some books so that might be something to look into too it's just not necessarily using as a heat source but just understanding the potential of compost to generate he even in extreme conditions like you get. Thank you for sharing that. Tarp. I do have a tractor so I can make a big pile. Yeah I wouldn't do what I do without my tractor so yeah it's a very handy little handy baby to have around. It is I'm always borrowing my dad's I was just using up your dad's it's well worth it so yeah. All right well thank you guys for joining us. For people to join if we so I was telling Colleen earlier today on the phone after this after this book we'll probably take a break until the fall because I think everyone's just really busy in the summer you know gardening and things like that and so I think we'll get more more engagement if we take this up again in the fall and pick a good book. Granted it sounds like it was leaning towards a cycle of stairs secret to the soil. I think I'm leaning towards lean farm by Ben Bartman but we can we can fight it out and come up with an option there and go down there. Let's see how many want to nerd out on the math and then yeah yeah we'll see if people want to do that. Okay but thank you very much I called out with this kind of wording stopped. Oh go ahead. Oh we're just going to mention to you Chad that I called that place in white first today and I'm going to call them tomorrow about getting some of that volcanic or the lava rock product. So yeah I called the Haskell Creek today and spoke to a really nice gal so because I want to go down on my truck and get it in bulk. Okay I mean if they order another lotus soil throwing on an extra pallet or adding onto a pallet is pretty easy to do at that point otherwise yeah I mean white fish you're kind of out there I don't know if anyone has lava rock or anything like that locally that's another option. The thing with lava rock though is potentially heavy metals and volcanic in general can contain heavy metals. Now how available those heavy metals are it's probably not a huge risk. I mean they're breaking down pretty slowly compared to everything else but it's just something to be aware of. Okay well thank you for that. Now why did you say that the herlight isn't as good as the pumice or the lava rock what what is the deal with the per light that is not as good? The big reason is because it's so light it floats to the surface so and even with the pumice like in my outdoor garden I have I have our soils out there in our race beds when it rains you'll see all the pumice kind of come up to the surface not as badly those per light though with per light so the soil loses its tilt over time and then that per light also is more fragile it tends to break down into smaller and smaller pieces so over time you lose that it changes the physical property the bulk density of the soil increases over time so if per light is your only option go with a larger size per light and just be aware that that's going to happen and you may need to just mix it back into the soil a little bit more and then you would something else but you might be able to find per light locally and then in that case that might be the best option for you just based on availability and what you can source. Yeah okay thanks. Yeah All right well I hope everyone has a good rest of their evening and go join the family for dinner myself and yeah look forward to talking again soon. Okay thanks a lot that's good to meet you. Coming you guys. Okay I want to apologize. Okay bye. Have a great night.",
        "number": 6
      }
    ]
  }
}