{
  "https://www.youtube.com/watch?v=z1wo5VmCXBc_Systran/faster-whisper-tiny.en": {
    "key": "https://www.youtube.com/watch?v=z1wo5VmCXBc_Systran/faster-whisper-tiny.en",
    "basename": "Soil Temperature Logger- Performance and Data Summary for 2024",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local/Soil Temperature Logger- Performance and Data Summary for 2024.mp3",
    "hf_compute_type": "float16",
    "metadata": {
      "audio_input": {
        "youtube_url": "https://www.youtube.com/watch?v=z1wo5VmCXBc",
        "audio_filepath": null,
        "audio_quality": "Systran/faster-whisper-tiny.en"
      },
      "title": "Soil Temperature Logger: Performance and Data Summary for 2024",
      "tags": "",
      "description": "This video summarizes the performance of an air and soil-temperature logger for data collected between January and July of 2024. I'll summarize successes, challenges, and conclude by resetting my water harvesting basin for my next experiment. \n\nThis is part of a year-long series that explores the use of inexpensive environmental sensors (Dallas One-Wire Temperature Sensor, Bosch BME280 and BMP280) and microcontrollers for logging enivronmental data locally and also posting to the Internet of Things (Adafruit IO) over WiFi. This is a continuation of my \"lab notebook\" for temperature monitoring experiments within a water harvesting basin in Tucson, Arizona. \n\nPlease note that the Adafruit IO dashboard referenced in prior videos is offline for the time being given connectivity challenges. Experiments will continue using a local datalogger until remedies recommended by Adafruit are tested.\n\nIntro Summary: 0:00\nBackground: 4:00\nStatus: 7:55\nExplore ChatGPT for missing data : 11:51\nFinal Summary: 19:45\nNew Experiment: 21:31\n\nNoted ChatGPT Prompts:\n\n1. Approximating Time Series Values:\nhttps://chatgpt.com/share/0280359f-4d62-43c3-be1a-1c7947635911\n\n2. Imputing Missing Temperature Data:\nhttps://chatgpt.com/share/cbb23f02-d8c6-48ac-904d-11bc8db223a0\n\nMisc spreadsheets and python code referenced in video:\nhttps://drive.google.com/file/d/1k75VPb8dcYgovnZ_ECZZ7-XL5VycjBx7/\n\nAdafruit forum post regarding lost connectivity with Adafruit IO:\nhttps://forums.adafruit.com/viewtopic.php?t=212184\n\nSoil Monitoring Playlist:\nhttps://youtube.com/playlist?list=PLqJ5k4cakypy1E4J_tvEiD0kpFK1tGY3D&si=5veE2bB654i1AMTr",
      "duration": "00:25:18",
      "channel": "Modest Maker",
      "upload_date": "20240802",
      "uploader_id": "@ModestMaker",
      "download_time": "00:00:20",
      "transcription_time": "00:00:53"
    },
    "chapters": [
      {
        "title": "Intro Summary",
        "start_time": 0.0,
        "end_time": 243.88,
        "text": " So, for those of you who are familiar with my prior videos and know about my setup, and  just want me to cut to the chase and summarize data collection and data, I'll take a couple  minutes here at the beginning of the video to do the same, so you don't have to watch  the whole thing.  As you folks know, I'm using a feather Wi-Fi that's talking to Adafruit I-O, which is an  IOT website, to basically record temperature data above at the soil surface and below  a water harvesting basin that's installed in my backyard.  For the purposes of this brief summary, I'm just going to talk about the Dallas One Wire  Temperature Sensors installed 3.3 inches above ground, at ground, and at a depth of  6 and 12 inches below ground.  So, here's basically a graph of the data collected by the Dallas One Wire Temperature  Sensor located about 3.3 inches above ground in that little water harvesting basin.  You can see that I've got a linear regression curve there showing that the slope of that  temperature increase shows a change of about 1700ths of a degrees Celsius per day between  January and July, which is about 30 hundreds of a degree of Fahrenheit per day, and that's  just kind of interesting for me to know that that's basically how much temperature increase  I'm getting between the fall and the summer through the spring.  You'll also notice that I have rainfall events plotted on this graph using those red dots.  The depth of rainfall is correlated to the secondary axis, and also notice how those  rainfall events do influence the diurnal temperature swings over time, not caught in the linear  regression, but rainfall does have an impact on temperature, as you can see in this graph.  In the beginning, we had a bunch of rainfall events in January, February, and you can see  how that kind of moderated those temperatures early on in the year, and how temperatures  also kind of leveled off during the summer months when the monsoons came, so that's kind  of interesting.  Also notice the wide swing in the in the diurnal fluctuations per temperature.  That's a pretty wide variation and fairly typical of what we encounter in desert environments.  And here's the data for the Dallas One Wire Sensor right at soil level, and you can immediately  see that the diurnal swings are actually being tempered by the thermal mass of the soil.  They're not quite as wide, but overall the slope and the increase in temperatures about  the same is what's happening about three inches above soil, so that's kind of interesting.  Now we're looking at data about six inches beneath the soil, and you can see that the slope  of the temperature increases flattened out a little bit.  Also those diurnal swings have really mitigated as a result of all that soil, basically  acting as a buffer for what's going on on the surface.  So this is also kind of interesting in knowing that about six inches beneath ground, I'm  getting about 1,400 of a degrees Celsius increase per day, or 2,600th's degree Fahrenheit  increase per day for this period of interest.  And finally, this is what the data looks like for the Dallas One Wire Temperature Sensor  that's buried 12 inches beneath soil surface.  You can see that those diurnal swings are almost completely gone in the data set now.  However, the slope hasn't really changed between what was going on at six inches beneath  surface in 12 inches, and what this tells me is that I don't really need a second sensor  at 12 inches.  It's pretty much mirroring what's going on at six inches, so I can probably eliminate this  from future data analysis.  But still it's kind of interesting to see how those diurnal swings have really mitigated  with that extra six inches of soil between this one and the last sensor.",
        "number": 1
      },
      {
        "title": "Background",
        "start_time": 243.88,
        "end_time": 475.4,
        "text": " instrument I developed to support backyard experiments in a little water harvesting basin  constructed in my backyard.  It's gone through several iterations and improvements over time as summarized in this playlist,  but I'll do a quick recap here.  The instrument was developed to help me understand soil moisture dynamics using temperature  and capacitive soil moisture sensors at various depths in a shallow basin.  And this is what the instrument looks like, basically a solar powered data logger.  The instrument includes a Bosch BME 280 air temperature sensor located about 28 inches above  ground, and both temperature and capacitive soil moisture sensors at various depths.  As explained in prior videos, the capacitive soil moisture sensors have been abandoned due  to difficulties in capturing the drying profile of my soil, as well as not being particularly  robust for field conditions.  Also, I learned that this home brew PVC radiation shield from my BME 280 isn't really appropriate  for monitoring air temperature.  Although there's an air gap between my sensor and this PVC cap, the data I've been collecting  suggests the sensor is likely picking up heat from the housing during peak sunlight hours.  To remedy the bias, my temperature sensor should be embedded in a properly designed radiation  shield like this one, shown as part of a Davis instrument weather station.  In response, my own improved radiation shield on my current setup comes from a disassembled  Davis station, one that I've been taking apart to better understand how these instruments  are put together and designed.  And here's the mounted replacement for the layer cake shield assembly.  Now with my own sensor that I can program and log data within the field.  Prior to attaching and programming the sensor to my existing setup, I ran some tests on the  sensor to make sure it was working okay as a standalone piece of equipment.  Summarizing those experiments, I realized the greatest difference between both sensors  is when the sun is directly overhead, approaching close to 5 degrees Celsius or 8.5 degrees  Fahrenheit.  Again, this confirms the comments shared by many of you in my prior videos that properly  designed radiation shields should help mitigate bias in temperature due to heating of the  housing transferring to the sensor.  This is especially true when the sun is high on the horizon, but less important in the  morning or late afternoon or for sensors placed in the shade.  Now initially data collection was addressed using a feather MO etilogger, which works  great for writing data to a camera SD card.  Overall the setup were great with uninterrupted data logging to a camera SD card, all of which  has yielded some interesting results summarized in prior videos.  But I also wanted to take advantage of Adafruit IO, which is a free and powerful internet  of things or IoT platform hosted by my favorite electronic supplier.  In prior videos, I explained how this migration and setup was accomplished successfully  using an Adafruit Feather MO Wi-Fi board.  I managed to make the transition successfully with live data from all my sensors now reporting  out to Adafruit IO, until recently I didn't have any issues aside from some power failures  associated with a poorly oriented solar panel.  Regardless, I've managed to collect tens of thousands of records from this setup.  So that pretty much brings us up to date.  I just wanted to follow up because to go through all the trouble of designing and  stalling and collecting tens of thousands of records, merits actually looking at the data  to see what it tells us about seasonal variations in air temperature above and within  my little water harvesting basin.  The following slides do a deeper dive into the data that's been collected with some preliminary  results summarized at the conclusion of this video.",
        "number": 2
      },
      {
        "title": "Status",
        "start_time": 475.4,
        "end_time": 711.72,
        "text": " Alright folks, so here you can see how the setup is doing a year after the fact.  So I've got this little basin with some rocks to keep the soil from caving in.  You can see that as I trim my bushes, my landscape, I go ahead and I just throw whatever  trimmings I have in there just for grains just to see if I can build up a soil layer.  Haven't really been paying too much attention to this until the last week given a bunch  of other projects and I'll take a few minutes now to summarize what's been going on.  The only other addition is now I have this nice rain gauge out here which gives me much  more precise readings of rainfall depth, much better than what I had back there.  And this might be helpful in the future but let's talk about where this project stands.  So I'll start by taking a look at the data collected by the BME280 and I'll focus specifically  on data collected as of January 20, 2024 through the present.  And I realized the sensor has some bias associated with it and I'll get into the reason  why I'm starting with this sensor first shortly.  Dating back to January through mid-July, close to 36,000 temperature records were collected  and recorded successfully to out of fruit I.O.  Of those, only 68 records were bad reporting temperatures of 180 degrees Fahrenheit for some  unknown reason.  It gets hot in Tucson but it doesn't get that hot especially in January so these records  were deleted.  Now you'll notice two data gaps in March and I recall these were due to a failure of  my battery during some consecutive cloudy days which resulted in me eventually installing  a larger battery in the box.  Starting on June 30, I started getting another set of data gaps due to data just not posting  successfully to out of fruit I.O.  Nothing had changed on my setup or network to merit this dynamic.  I reached out to out of fruits forums for guidance and the bottom line is it may have  something to do with my SSL certificate on my feather Wi-Fi board needing to be refreshed.  I haven't attempted this yet but I'll include a link in the description of this video  where you can follow the associated thread.  Of greater interest here the temperature records for the BMP280 which is the sensor installed  under the Davis radiation shield and thus a little bit more representative of actual air  temperature.  This one also recorded close to 36,000 records to out of fruit I.O. with 48 bad temperature  records registered in January and subsequently eliminated.  Here I see those same data gaps mentioned before but I have another one in May and I believe  this resulted from operator air that means me in that I was playing around with out of  fruit I.O. data management and while creating the CSV files for download I forgot to download  one that was subsequently deleted.  So that's on me and it's just something to be aware of to be very diligent and meticulous  in the way you download data from out of fruit I.O.  And this is just a quick screenshot of what I'm talking about I'm logged into out of fruit  I.O. right now and I'm looking at my data and of course I'm going to want to download  that data so I click on this blue button.  You can see that I have three links from prior data downloads.  I'm going to go ahead and download as CSV for my latest data that hasn't yet been downloaded  you can see that it's pending there and I'm going to wait maybe a minute or a few seconds  and eventually I'll click on refresh on doing so.  I just lost the last data set that had been saved it got replaced by the one that I just  created so if that last data set hadn't been downloaded I would have lost it I think",
        "number": 3
      },
      {
        "title": "Explore ChatGPT for missing data",
        "start_time": 711.72,
        "end_time": 1194.72,
        "text": " using the poorly shielded BME 280.  I was curious if I could use AI or chat GPT to help me approximate those results from data  that was captured by my other sensors especially given the significant correlation between  these two data sets as demonstrated by this one week of data collected in July.  Now in using chat GPT I realized that the key is developing a proper prompt to get what  you're after and this is the one that I settled on and I won't go over all the iterations  that I used to get to this but man was I blown away by chat GPT and what you can do with  this.  It essentially develops code a Python code that you can modify for your own purposes it tells  you what libraries to import gives you different methods you know you don't really have  to know too much about programming to do this outside of being able to understand a compiler  and how to import and modify code.  Now I should mention that there were various methods that were proposed by chat GPT to approximate  missing data.  I went ahead and I stuck with the can and method which basically looks at the nearest  neighbor of the complete data set to approximate the gaps in your incomplete data set.  I thought that that might work as a first good try and just to kind of experiment a little  bit with Python programming and chat GPT so let's see what happened.  So I'll go ahead and include links to the code that was used to do the imputation but  you can see here that this line of code confirms that I'm using the can and method for  the same.  Here's a graphical representation of the complete or BME 280 data set relative to the incomplete  or BMP 280 data set.  So you can see that I'm missing some orange data points associated with the BMP 280 year.  And this shows the 3700 plus records that were imputed from the existing data set thus filling  in the blanks.  You can see it looks pretty reasonable to me.  This isn't too far off from what I would expect to see within that missing data gap.  And here's what that filled in data set looks like when graphed and Excel for the entire  period that I'm currently looking at within this video.  So again, this looks pretty reasonable to me.  It's pretty much what I would expect.  So that was pretty interesting using chat GPT to help me generate some Python code to approximate  the missing gaps in the BMP 280 data.  But I had similar issues with the temperature data for my sensors above at the surface  and below ground in my little water harvesting basin.  So I was wondering if I might be able to use the complete BME 280 data set to similarly  fill in the gaps for those respective data sets.  So first, let's verify there's a correlation between air temperature and soil temperature  dynamics.  And here you can see the BMP 280 data shown in green for a week in July.  And the T0 sensors about three inches above soil surface.  So it's not surprising to see the respective orange series in this graph registering high  temperatures due to radiation being emitted from heated soil.  Similarly, the T33 sensor is right at soil surface.  So it also demonstrates a higher temperature via the yellow series relative to the BMP 280.  However, once we drop about six inches beneath soil surface, as shown by the blue line,  the diurnal signal is muted as you might reasonably expect.  And at a one foot depth, the diurnal signal almost completely disappears.  And here I've removed the deep sensor data to make it easier to see the correlation with  those higher temperatures, slightly above or near the surface of my water harvesting basin.  And here's that BMP 280 data plotted relative to just those two buried temperature sensors,  just to drive home the point that those diurnal fluctuations are muted with depth.  Now I know that I could probably approximate the near surface temperature readily using  the Can N method, but what about those buried sensors?  Their signal is a little bit more muted, so I'm kind of curious as to how that Can N method  will play out.  So here's the gap for the incomplete T95 series, which is the temperature sensor about  six inches of depth.  And here are the imputed results.  And you can see that the Can N method does capture that diurnal fluctuation, but loses  the gradual increase in subsurface temperatures taking place over the course of spring  and summer.  So there's a slight upward gradient in that deep sensor data that's essentially lost.  And here's the gap for the T155 temperature sensor, which is buried at 12 inches beneath  ground.  And here's the imputed data.  Once again, doing kind of a reasonable job of capturing the diurnal trend, but losing  the longer-term increase in soil temperatures, you can see in that jump towards the end  of the data set.  So yeah, this demonstrates that probably that air temperature is not the greatest for capturing  that long-term trend or increase in soil temperature over time.  And here's all the data for the temperature sensor located about three inches above ground  surface in the basin.  And you can see, obviously, there's going to be a lot of variability as things cool  off overnight and then warm up during the day.  I've plotted rainfall depth based on some rainlogged.org data that's been collected in  our community.  And you can see how rainfall in late January, early February definitely had an impact  on the air temperature directly above the soil at the beginning of the year.  And then you can also see how in July, when the monsoons came, the overall increase  in the air temperature kind of flattened out as well.  So that's kind of interesting to see in the data.  And if we take a closer look at the linear regression for this data, again, highly variable,  so low R squared.  But you can see that overall, we get about 17 hundreds of a degrees Celsius increase  in temperature per day for this time period, which translates to about 30 hundreds of  of degrees Fahrenheit per day.  So that's just kind of interesting to know how the soil is increasing in temperature as  we move through the seasons or between January and July.  And it's also interesting to note that if we look at the temperature sensor that's right  at soil surface, that the linear regression basically gives us the same temperature increase  profile over time, the only difference is that the variability around that line has decreased  a bit because we're getting some buffering from the thermal mass in that soil.  And of course, if we go about six inches beneath soil surface, now all of a sudden both  the slope of that temperature increase, as well as the absolute temperature increase per  day is going to flatten out.  And our variability goes way down and that makes sense, again, because of that thermal  mass in the soil that's buffering those diurnal fluctuations.  But there's not much difference if we go another six inches deeper in the soil profile  in terms of the heating and the absolute increase in temperature per day.  This was kind of interesting to me.  I thought I'd see a little bit more variability between six inches and 12 inches in terms  of the slopes and the absolute heating, but that extra six inches didn't really make much  of a difference outside of eliminating the variability in absolute temperatures.",
        "number": 4
      },
      {
        "title": "Final Summary",
        "start_time": 1194.72,
        "end_time": 1303.32,
        "text": " yield just about 36,000 data points.  I did have some intermittent loss of data which began on June 30th out of the blue.  The remedy to fix this was basically just to reset the microcontroller and that basically  brought the connectivity with Adafruit I-O right back online, everything was fine again.  I have posted to Adafruit's forums and they've indicated to me that data loss may be associated  with the need to update my SSL certificate, which I haven't yet done.  So that's something that's yet to be determined regarding loss connectivity.  My own error, operator error resulted in about 3,700 records that were lost between  March and April for each one of my feeds.  And this was just due to me not being very familiar with how to download data from Adafruit  I-O and I'm only mentioning this because it's just kind of a warning to be careful when  creating new CSVs for download.  When you do that, if you've already got three CSVs in your queue, the older CSVs will  be deleted.  So if those haven't been downloaded, you will lose that data as I did.  And finally, I just wanted to mention that all my feeds did occasionally yield bad data  posts, for instance, I'd get a temperature of 180 degrees Celsius, which is just not  possible for my environment.  The bottom line is just be aware of the same when, you know, using the hardware and, you  know, things you can do are just basically post-process your data or write some error handling  into your code prior to saving your data.",
        "number": 5
      },
      {
        "title": "New Experiment",
        "start_time": 1303.32,
        "end_time": 1518.0,
        "text": " You can see I have a little feather MO data logger here with an SD card.  And I'm going to try and just replace this because I just, I'm just concerned about losing  data.  So here goes.  All right, here's my old setup.  I've tried everything to keep the connection with Adafruit I-O up, replacing all the hardware.  Just can't seem to get this to work.  I did see a post last night on the forum that suggested I should update the SSL certificate.  So I'm going to give that a shot.  But for now, I think what I'm going to do is just replace it with this.  And this is the really nice thing about the feather terminal is I can just program some  other hardware, remove it, and pop it in, and it's just really quick and easy.  Okay, first thing I'm going to do is remove this little JST plug that's coming off the  solar light bug charger.  This has already turned off.  I should just be able to pull this out now.  Okay, so there's the old module.  It's just basically the Wi-Fi board plus feather Oled and here's the new one.  So this is the feather Oled with a feather MO data logger and an RTC clock.  That's the DS3231.  Let's see if I can do this one handed.  Okay, let's get this plugged in.  Turn this back on.  And that last I've got a little data on the Oled which suggests that it was able to  read the sensors, write something to the SD card, so I'm going to leave this alone  and set up my experiment.  All right folks, so I'm trying to create a no mulch base condition.  So all the mulch that I've been accumulating in this little basin over the past years  been removed, this kind of shows you what it looks like, what's been removed from this  basin, but take note of all these little bugs that are like hanging out.  So all the mulch that's been hanging out here for the last year, it's created a nice  little environment for bugs to help aerate the soil.  I can see there's all kinds of activity here from just leaving this alone and the other  thing I notice is this is what?  From rainfall events that we've had over the last week.  I bet if I come back later this afternoon now that I removed all this mulch, all these  little bugs will be gone and this will be bone dry.  So you know, chalk went up for mulch, I think it really helps in situations like this.  All righty, so the system has been reset and in addition I have this really nice rain  gauge now that's going to give me some precise measurements on rainfall impacting the  little basin, so I can compare one rainfall event to another and the impact that that has  on soil temperature.  So that about does it for this chapter, I've been collecting data for the last couple  weeks.  I'm real curious to see how that basin performs in regards to temperature width and without  mulch.  So if you're interested, please consider subscribing for updates and we'll see you next time.",
        "number": 6
      }
    ]
  },
  "book_club_teaming_microbes_18_21_2024_07_16_tiny": {
    "key": "book_club_teaming_microbes_18_21_2024_07_16_tiny",
    "basename": "book_club_teaming_microbes_18_21_2024_07_16",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local\\book_club_teaming_microbes_18_21_2024_07_16.mp3",
    "hf_compute_type": "float16",
    "metadata": {
      "audio_input": {
        "youtube_url": null,
        "audio_filepath": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local\\book_club_teaming_microbes_18_21_2024_07_16.mp3",
        "audio_quality": "tiny"
      },
      "title": "book club teaming microbes 18 21 2024 07 16.mp3",
      "tags": null,
      "description": null,
      "duration": "00:54:26",
      "channel": null,
      "upload_date": "2024-08-03",
      "uploader_id": null,
      "download_time": "00:00:00",
      "transcription_time": "00:01:51"
    },
    "chapters": [
      {
        "title": "",
        "start_time": 0.0,
        "end_time": 602.88,
        "text": " post and mulch. How about this? Why don't we get this? I didn't have a chance to revisit those because I wasn't planning on it. The compost T1 I did read just today so it's fresh plus I know that one like the back of my hand because I spent way too many years on it. So why don't we do compost? Why don't we do 18, 19 and what is that? 20 and then 21 I think even. Yeah, we can do all those today probably, probably pretty quickly and come back to mulch and compost because I think they deserve a little more time. I think that is the need of it. So we can do a amount of order. I think I don't think it'll make a difference. So all right, well then I will start recording and we'll get started. Recording in progress. Okay, welcome to Book Club team with microbes. We made an executive decision as a group. The three of us to go back to chapter 18 and talk about compost T's. So we're going to start there. Compost T is something that Jeff is a big fan of. It's something that we as a company kiss organics did for years. And so it's something I'm pretty familiar with. There's a few things that I think we've learned and Jeff changed since this book was written as well as just some minor differences that I might have with Jeff's opinion. But I'm going to share both and then we can kind of have a conversation around India too as well if you want. So compost T is a tool. He talks about that just like a rake or shovel or anything else. It's something you can use in your garden. Do you need these compost T? No, you don't. But if you want a garden with a soil food web, it's one of the best tools that you can have in that regard according to Jeff. What compost T is not is something that he talks about and I think this is important. So when we're making air rated compost T, you'll see it spell ACT, A, A, C, T. That is stands for actively air rated compost T, they're the same thing. But essentially what we're doing is we're taking a small amount of compost and we are adding a food source to it and then we're sticking it into the optimal environment for it to replicating grow the biology that was in the compost. And so that means we're using high quality compost. Sorry, one second. That's the stomach. Very cute. Raising high quality compost and adding the right amount of foods into the brewer to create this optimal environment. And the brewer needs to stay aerobic, which means we're selecting for conditions for aerobic microorganisms. These are ones that want high oxygen conditions. Sorry, let me just set my daughter up until my wife gets home. Okay, there you go. All right. So what compost T is not though is compost leechate. That's the stuff that comes out of the bottle of compost tea pile. That's going to have a little bit of biology, but it's not going to have the same levels of biology as what an air rated compost T would have. Same with he mentions compost extract. That's where we're taking compost and we're stripping the microorganisms off the compost and then watering with it immediately. There's no brew period associated with it. So compost extract is a good option if you are spraying, or sorry, if you're doing a sewage crunch and you just want to do something rapidly. So like you had a lot of compost, but not a lot of time to brew. Whereas aerated compost T allows you to brew up the microorganisms, get a higher concentration of them, and then apply them either as a foliar or as a soil drench, whereas with extract, you can really only do a soil drench. He then goes on to talk about some examples of what levels of compost tea we want in the book. Realistically speaking, I don't know how useful that information is. We don't need, you guys don't need to worry about counting them. You don't need to worry about about sending things off to a lab. If you want to make compost tea, the key is to have a good brewer. They keep things aerobic. One of the best ways to do this is Tim Wilson's air lift design. He calls it the microbiulator. We sell them. You can make them also. There's YouTube instructions on how to do that. It's pretty easy. But essentially, it just keeps things circulating. So there's no dead zones and keeps things auctionated. But the picture in here in the book itself is actually of our Kiss Guru, which is kind of fun. Because we worked with Jeff when he was writing the book. He says it's okay to use aerostones. I would disagree. I don't think that they last very long, because you can't clean them of biofilm. Biofilm is that sticky glue that the bacteria produces over time while the tea is brewing. And it's the same slimy substance that you can find on your teeth in the morning when you wake up and you brush it off. That's biofilm. It's the thing that the bacteria produces to protect itself. So we want to make sure to remove that. And that's also why I don't like to send compost tea through irrigation systems unless you're flesh and right after or you have no other options. So cleaning the brewer just makes sure you clean it right away. Rinse it off. You can use a little soapy water, but there's not a lot to the cleaning. Make sure to use high quality compost and chlorine free water in this instance is very important. So we does talk about that. They're sensitive to chlorine. I do agree with that. And you do want to use high quality compost or earthworm cast things are a great option as well. This is something he talks about that. I don't know that I agree with. He talks about giving fungi a head start by free germinating or pre-enoculating the compost with something like oat flour. Yes, you'll see a lot of myceliograph, but we don't know that any of that is truly beneficial. It could just be a species that eats oat flour that may not have a lot of plant or nutrient cycling benefits. We don't really know. So it probably wouldn't hurt to do it, but I'm not there's no evidence that I'm aware of. This shows this is actually beneficial. One other thing he talks about is foaming. One thing we do know is the foam is not a good indicator of microbial activity or growth. You could have a tea with very little microbes of foams or one with a ton of microbes that doesn't foam at all. So that's just something you can keep in mind. Don't use foams any indicator. If you get a little bit of foam, you can put a little bit like a drop or two of any type of foil. That could be all of what foil could know the oil, anything on the top of the burner. That'll take care of the foam and it'll break that layer and it goes away. Did you have a question, Brandon, except you want to add? I was going to add or just ask you, your dad always talks to me about raising the water column. A certain amount of inches relating to you know, dissolved oxygen content. Is that just anecdotal or, you know, we don't have to necessarily raise the water column. We're using that cascade design because it's breaking the surface tension, right? Yeah, you're totally right. He's really proud of that because we used the very brute force designed with these air pumps that were like super expensive thousands of dollars. Air pumps and it would just blast the water up because the big thing is you can't really have too much air. You can't really have too much oxygen. So, yeah, you don't have to raise the water column. He was just really proud of the fact he figured out a way to do it because that was, it was a less efficient way of doing what Tim was doing. It looked cooler, but yeah. Okay. Basically, you don't need to do it that way. I was just curious. There was some golden metric there or something. No, it's really, it's really dissolved oxygen level in the water. So, really, you're looking for a above six milligrams per liter or six parts per million of dissolved oxygen in the water throughout the entire brew cycle. That means even as the microbes are reproducing and consuming oxygen at high levels. And let's say that, you know, bacteria and they'll say that 18 hour mark, 12 to 18 hour mark, you're still going to get, you're still going to stay above that threshold. That's sort of your minimum. And now you have that's why to do it. You have an oxygen sensor that you've used. Do you? Do you still have an x-tech one? Yeah. And then we had another one that I bought that I sent down to Shehelis and I don't know what happened to it. And you're able to find it since Daniel left. Okay. But yeah. And then so you would take, you would look at the deal levels and measure those throughout the brew and then you could take a microscope and then look at the microorganisms and assume that there are aerobic if you stayed above that threshold. So, that's really the secret there. Jeff mentioned 24 to 36 hours. That's a good brewing amount of time. I don't like to brew beyond 40 and I don't like to brew under 20. So, that's sort of the window. And the reason is under 20, you're not going to get any of the fungal high I fade to really grow. You won't see the amoeba starts early. Start to show up and things like that. They just,",
        "number": 1
      },
      {
        "title": "",
        "start_time": 602.88,
        "end_time": 1214.24,
        "text": " I haven't found the perfect analogy for this, but essentially, you just took all these microorganisms. You gave them all food. It's like opening all the gates at the zoo. And at first, everyone's happy. There's a ton of food. They're all eating each other and then nutrients are cycling. But then, after two weeks, all you have left is your apex predator and your scavengers. So, let's say, you know, all you have left is lions and rats. And then everything else has been eaten and is gone. And that's the sort of the same thing with the composty, because at the end of like 40, 60 hours and on, all you really have is one morphology of bacteria and one morphology of protozoa. And they just kind of go back and forth in terms of as a roller coaster cycle of how many there are based on how fast they're reproducing. So, still might have benefit, but not the same biodiversity that you can get if you just brew within those windows. Don't refrigerate your teas. That's just a bad idea. It has a short shelf life, you need to use it right away. I need to keep it aerated until you use it. You can't over apply it. I agree with that, other than the overwater. You will get some nutrients from the compost portion. I mean, figure two cups for five gallons of water is sort of a general race. So, there's a little bit of nitrogen in there primarily. So, you do want to be aware of that. But other than that, it's really hard to overuse it. One thing that he says is that ultraviolet race killed microbes, so you don't want to brew in the sun. I would disagree with that. And primarily, because one of the things that Tim Wilson speculated was that you may actually get some phototrophic bacteria growth in the top surface just from the UV exposure. And that might be something that could be beneficial. We really have no idea. But this idea that you're killing a bunch of microbes by exposing the UV in the liquid is just, it's not accurate. So, I don't know why Jeff has that. He does talk about later in the chapter about how when you apply it, you don't want to apply it in the heat of the day or when you've eaten it's highest. And that I totally agree with because you're applying a thin layer to a leaf surface. That's a very different situation than a giant tank where you're brewing it. So, in that case, I would agree with them. You can apply it in terms of applying the tea. The best advice is to remember that these organisms are alive and you think about their journey all the way through from the tank to the plant or the soil and how it's going to get there. That's really the key. So, like those little handheld ones that you squeeze with a little trigger, you can get them at the store for like three or four bucks. Those day I'm in some microbes. And I know that because I can put a little, I can put some tea in through the microscope and see what comes out the other end versus what what it looked like before went through the sprayer. Adomisers destroy everything. Concrete sprayers they talks about work well, hand out sprayers work well. You just want to make sure your nozzle tip is putting out a larger droplet and you have more volume at a lower pressure. So, you know, don't pump up your hand sprayer super tight and then hold it right next to the leaf surface and blast it on that you want sort of a rainbowing effect. I've got point sprayers in general. We're very pretty well. You want to see some? Well, I've got, I've got like some small pump up, shaping, but that's not, you know, that brand's not that important. It's just, you know, sufficient for. No, that's fine. Yeah, Harbor Freight Home Depot. You don't need to spend a ton of money on a sprayer. You do want probably a dedicated sprayer, at least dedicated separate from pesticides and those sorts of things, but you could use the same one for humic acid or any fertilizers sprays. And then you just, if you're bubbles are not a killing sprayer, killing microbes, too. If you'd get nipatodes with a pump up sprayer, you'd kill your nipatodes, but you can do a T with it. And just think low pressure, maybe take the nozzle tip off or use the nozzle tip that causes the least amount of diffusion and you're probably going to be fine. Honestly, simpler is just to take a water and can. That's what I usually do and I just, if it's not a large area, I'll just water with a water and can and I typically do soil, more than fullier. There is some, you know, and again, one of the things about this is none of these studies can really be replicated because every batch of compost is different. You can't make the same batch twice. It's literally impossible. So it makes it really hard to do trials because one person's success could be totally different than another because they're going to have different consortium of microbes. But in terms of the application, if it's a larger area, the simplest thing is just to take a giant garbage can, put your five gallons of tea and then fill the rest of it with deep chlorine and water, or let the water sit prior to adding the tea. And then just drop a pump in there, attach to a hose and just go around with your thumb over the pump, then the hose end and apply it that way. That's the simplest way to do it and you're probably not going to damage the microbes that much with one pass. You can't brew within the peller pump, which is what a some pump is, but you can absolutely do one on application one. Yeah. I've got three questions for you. No. I've had people tell me that if a tea goes too long, it goes in aerobic, is that true? As long as you're surprised, dissolved oxygen, I wouldn't think so, but I've had some people swear. It's not going to inherently go anaerobic unless you add more food, and if you don't maintain the oxygen levels, but there's nothing happening in the time. Just take a look inside there over time that would cause it to change. To consume more oxygen, essentially. How long, you said, use it as soon as possible, I always use mine immediately as soon as I mix it up. Is there a window? Do you have a one hour window? Do you have a, I mean, once you can turn off that. Oh, yeah. Yeah. So your deal, your dissolved oxygen is going to drop within minutes. So if you, let's say your, you want to use half the tea now and half the tea in four hours or the next day or something. Okay. What I would say to do the best practice would be take out the tea that you want and then just pour in some more declorinated water to keep the brewer running until you're going to use it again, but keep it running. Otherwise, like with my, when I dad would go out with the spray rig, he had a Honda motor on there that was just bubbling in water to just to keep it aerated throughout the day while he was going around to these properties to spray and that works just fine too. Okay. So you don't have to necessarily apply it all at once, but once you turn off the oxygen, it's best to use it right away and then it really is, I'd ideally minutes before the oxygen levels just crash and you can see that with a deal a year. Okay. And my last question, delusion rates. I usually take, I usually make 50 gallons with a five gallon brewer. So 1 to 10. Yeah. Is that good? That's a good question. So in terms of delusion, the best way to think of it is not by delusion, but it's a way to get even application over a given area. So let's say, so the application rates from Seoul Food Web and frankly, I haven't seen anyone else come up with a better application rate, so I've just used it for years. You can always go higher. I wouldn't go lower. But there are rates where I always 20 gallons per acre for a soil drainage, which if you think about it, that's not very much. No, could you get 20 gallons evenly across a acre with just 20 gallons of liquid? It'd be really, really hard to do. But I can add 50 gallons to that. I can add 1,000 gallons to that. If I'm covering that same acre, I'm still putting out the same amount of microbes. It's not really deluding in per se. It's just giving me the carrier, waiting to get an even application. So really, it's better to go back and look at your, how big the areas you're trying to cover and make sure you're at least applying enough microbes for that. But I pretty much can guarantee that you're having enough that you're doing enough already. You're already over the application rate. And then they say another, for every five feet of canopy, you want another five, five gallons of tea per acre. So even conservatively at 25 gallons per acre, what you're doing at 50, you know, 10 to 1",
        "number": 2
      },
      {
        "title": "",
        "start_time": 1214.24,
        "end_time": 1820.48,
        "text": " that large of an area. So yeah, five gallons will cover a quarter acre. That's the easiest way to look at it. All right. Awesome. Kind of go from there. It's definitely covering my four by eight. Oh, yeah. Yeah. And for me, like I would just take that five gallon bucket in reach in there with a dixie cap or solo cup and just water it in around the soil, I'll even and call it good. I don't really worry about fuller applications as much. You absolutely can't do that. This whole section, though, and I know my thing is blurring the book out. But he talks. He gives all these different functional diseases and pathogens that have been shown by studies to be out competed by compost tea. I would take all that with a huge grain of salt because, like I said, every tea is different and a lot of the parameters around these studies were not the methodology wasn't great. I understand why people that don't like compost tea from a scientific perspective could absolutely make the argument that it's a snake oil. Because you really can't get a good controlled study on it because every brew is going to be a different set, you know, consortium of microbes. That being said, by increasing the nutrients cycling, by increasing the health of the plant, overall you should see how the are happier plant. Just as a side anecdote, when I first met Suzanne Wayne Wright Evans at a conference, we started talking and I don't know how she must have heard of me or something came up. But she's like, oh, you do compost tea and she kind of like pupooed me and because she comes from that academic background and she understands the science of it. And I'm like, so we started talking and was like, hold on and we had a very like good conversation that I said, well, here's what I say about it and here's what I don't say about it and it was she thought it was thoughtful and then we had a deeper conversation and now we're good friends and have a ton of respect for each other. But the fact that like there are people out there that say, oh, yeah, just spray compost tea if you have a try to serve, you have, if I talk to any of these things, maybe overselling the ability of compost tea. Yes, it may help with these things, but really what we're doing with compost tea and really the only thing that I say compost tea is it's a shotgun approach. We're putting out as many microbes as we can in theory if we use good compost, these should be beneficial nutrient cycling microbes. And if we increase the amount of nutrient cycling in the soil, we're going to have a healthier plant that's maybe better able to resist disease and be just overall healthier plant. Beyond that, I don't try to make any claims around it and I don't really think responsibly you should. So that's just something to think about in terms of why we may compost tea. Yeah, so that's a good point and I'm glad you brought that up. So if we're talking about specific microbes, like try to direct T22 strain, you know, root shield. For example, because we're dealing with pathogens in our soil, then yes, that there is research that shows that these have a very specific soil and plant functions and antagonistic relationships with certain other diseases. And something like that, we can absolutely make good claims scientifically about the effects that they'll have on a pathogen. And there's even research around consortiums of microbes. So like two or three or even five sets of bacteria that work together to create this effect that's greater than any of those microbes by themselves. And those are products that are, you know, something like microbial mass, for example, would be an example of that. But when we're talking about compost and I would not add any of these products to a compost tea because they could just become very expensive food sources for whenever microbes were in your compost. We just don't know. So with compost tea though, we're not, we have no idea what's in the compost. I mean, we know that there's going to be RK in bacteria and, you know, some nematodes and some amoeba and protozoa and all these things. But we're not identifying them at the species level. We don't know exactly what's being added. So and like I said, every brew was different. And even bruised from the same compost, if I brew for 18 hours versus 24 hours, I'm going to have a very different brew. It's just so complex. Food source too. It's, it's, yeah, the food source changes your temperature, your altitude. All of those things play a role. And so it's so complex that I just don't think we can, I don't think it's responsible to make any claims about disease. Now, you might get disease suppression with it. I have people who who swear to me that they have when giant pumpkin grower claims she got rid of the, you know, she was a rural record holder and is a quash. She claims she got rid of a few serrient by using repeated composty applications. And that's awesome. She might very well have. But that's because the particular compost that she was using in the food source and the way she was brewing in her environment, allowed her to outcompete that pathogen or suppress it. Who knows if we could recreate that same compost, T.E. or if it's going to be different if you try and brew even with the same compost with your water at your house. So it's worth a shot, but it's not a silver bullet. I really like targeted biology, you know, tricoderma or bacillus of tillus or things that we know are specifically in the same way that we want to properly ID and properly prescribed for an insect or pest, you know, I like targeted stuff. And so with with a T, we know that it's not targeted. We're just like he said, shotgun approach trying to get as much total population and as much diversity. And the great news about it is you really can't overdo it. As long as you keep it over a road, it's probably going to be beneficial anyway. So if you're looking for something to like hit the next level of terpenes or, you know, get that loud next bit of expression out here to land. This might be a great option for you. It's relatively affordable. It requires a little bit of labor, but it's not, it's not going to mess things up from a fertility perspective. Unless you do it so frequently, you're just adding too much nitrogen. But other than that, it's to really safe way to do it. So it's something to consider. All right, that was compost tea. I already spent 30 minutes on the chapter. We weren't covering so we will speed this up. Micro-edital fungi. Micro-edital fungi is another topic. I spent way too much time on because I think it's really interesting. Let's see. So there's a couple different types of micro-edital fungi. As far as you guys are concerned, the only ones you need to know about are endo micro-edital fungi, which is also called our buscular micro-edital fungi. Ecto micro-edital fungi. Ecto micro-edital fungi has a relationship with like conifers and trees. Endo micro-edital fungi. And again, this is a whole class of micro-edital fungi. This isn't one species. This is a whole bunch of different ones. They have a relationship with like fruit trees. Tomatoes, cannabis, beans, lettuce, many of our different crops. So really, that's the one that we want to focus on. Ecto micro-edital fungi doesn't form a relationship with cannabis or tomatoes or fruit trees. So applying it doesn't do us a lot of good. So you really have to look at your package and make sure what you're ordering is the right thing for the right species. If you're growing a pine tree adding an endo micro-edital fungi doesn't get any good. What it does is it infects the root to carbon because fungi can't produce their own carbon and in return for the carbon they break down organic matter on lock and absorb nutrients from the soil and they transport and deliver those nutrients inside the roots. The endo micro-edital fungi does that by actually infecting into the root itself whereas the Ecto micro-edital fungi she's the root. So when you see the cool picture of like all that white looks like root hairs essentially covering the roots and extending down that's Ecto micro-edital fungi. Endo micro-edital fungi you can't see it even with a microscope unless you stay in the root itself to actually see the infection. So it's very challenging in that regard to see it. So you're not visually identifying endo micro-edital fungi. If you see mushrooms popping up popping in your art, not endo micro-edital fungi. There are other ones. There's an orchid one. There's an ericoid one which is like rotodendrients, blueberries, things like that",
        "number": 3
      },
      {
        "title": "",
        "start_time": 1820.48,
        "end_time": 2426.72,
        "text": " if they get they can still be forced into one and that can actually stunt them which is interesting and that's things like broccoli falls into that category I know and there's a few other veggies so you can go on and micro-ized applications. I know they have it for sure but there's other places too and they have charts so you can see what plants go with what types of micro-edital fungi so you can get the right ones. Micro-edital fungi is best applied as an initial application directly to the roots when you have a young plant. You don't need to do it multiple times at transplants. It will grow in theory with the plants. You can, it's not going to hurt anything other than your wallet. They produce skilates that break down the tight chemical bonds in organic chemicals and help make these things more available to plants. They absorb organic nutrients, nitrogen, phosphorus, and copper but also potassium. They need to be zinc and iron and deliver dough those of the plants and one of the things I highlighted that was interesting is 17% of photosynthetically derived carbon and this particular species in Alaska was used to feed a fungal network that in turn provided 60 to 1 to 86% of the plants and nitrogen needs so it's a very symbiotic relationship with micro-edital fungi. They produce and release phosphatases that break off phosphate scripts from molecules which is really important because phosphorus is so hard to unlock in soils so that's one of their main benefits and the studies show that when phosphate levels get too high over 50 to 80 ppm that plants don't form this relationship with the micro-edital fungi. They're like, we're getting all the phosphorus we need we don't need to form this relationship and so they don't and so they miss out on some of these other benefits that micro-edital fungi has. I did a whole podcast with Dr. Yoran Kapolnik from the Vulcani Institute on it that's really great if you want to do a deep dive on micro-edital fungi. Something to know about it is that it does also increase the uptake of heavy metals so if you are growing commercially in a regulated market which just worked with a grower recently it was order aligned failing and we told them to stop adding micro-edital fungi because we just we don't know. It's not going to help if he does have that infection happening and realistically if you're really using your soil you may just have micro-edital spores in there from the old roots from the previous plant and so you may not need to keep buying and adding it if you're reusing your media anyway. I do some of the brands have carriers that have heavy metals as well so you want to check specific brand too. Yeah that's a good point too. He mentioned he makes us there's a few don't go ahead. So they actually just go dormant in a lot of cases so when you see a when you say a label for buying micro-edital fungi it'll say either CFUs called colony forming units or propigules and what those propigules are just little pieces of hyphae and so you will actually get I mean if you think about it you have soils and your soil doesn't always have plants living in it there these micro-edital fungi are ubiquitous they're everywhere they're able to survive for a period of time without a plant host and then when the conditions become right they will form that relationship and reinfector plant. Now how long they can persist indoors and you know artificial media with something that I have no idea I don't know if that research has even been done but my assumption just from what I understand of it is that they probably are surviving reasonably well and at some point you'll reach a concentration of propigules you know the little bits they're attached to the roots or hyphae that will reach a level to where and direct an occupation won't get you any you know any faster infection but when those levels are low you may get faster infection by adding a concentrate amount directly to the roots itself of the plant. Some plants have a tendo micro-edital fungi I've forgotten about this until I read the chapter which is a echo and endo micro-edital relationship which is kind of interesting doesn't really apply to what we do but just the fact that plants are pretty amazing beyond that I think if you are going to use micro-edital fungi just be careful where you source what you're buying because some of these have spore counts that are so low that you're not really getting you're not getting enough micro-edital infection. A good example of this is a lot of the commercial fertilizers put just enough on there to get it on a label so you might be at like 0.06 CFUs whereas if you were buying a good micro-edital project product you might be at 50 CFUs. So huge difference in terms of the amount that's actually considering we're growing plants that only live a few months we want to make sure we're actually getting a good infection right away. So okay that's micro-edital fungi chapter 20 the lawn we're going to go kind of faster this one because I don't you know if you guys were here for lawn and advice you're in the wrong pastry on here in the wrong group. I do disagree with some of what he's saying here he says applications of synthetic fertilizers kill off most of all of the soil food web microbes rule number 13. These fertilizers are salts and when they come into contact with soil microbes they cause osmotic shock. So here's the thing this is true and he kind of explains it in the next section but I think he over emphasizes this to the extent that people get the wrong idea because he does say you know water in the cells flows from a you know higher concentration a lower concentration inside the soil of the wall to the higher concentration of salt outside you know essentially exploding the cellular wall of these microbes. But and let me see if I can find it here. Oh here it is so how quickly as soil food web organisms are affected by chemical fertilizers depends on the organisms in question their concentration and the strength and amount of fertilizer applied. I think that is crucial this is all about the dose. I mean you can water as an LD fit you can drink too much water and die like it's it's just about finding the right down so low levels of chemical fertilizers feed microbes. As an organic guy I don't love that but I have to accept that that's just a fact and so we can't demonize chemical fertilizers I don't feel to this extent. Isn't that what all the giant pumpkin guys are doing? They're yes and interestingly enough I just talked about tobacco who's a giant pumpkin borrower and also host tobacco university he's going to come on the podcast and the podcast is going to be on the giant pumpkin world and cannabis so I just found that out today. All right let's mention giant pumpkins I think that's going to be in a really interesting podcast conversation because there's a lot of similarities but yes this idea that all chemical fertilizers kill plants is I think a little bit overstated and then he has this idea that like once you start using chemical fertilizers it's a downward spiral you kill it off all the microbes now there's nothing there to you know grow your grow your plant break down leaves and so now you're constantly having to apply fertilizers and you're just killing more and more on the soils becoming more and more dead. This could happen absolutely and we know that Americans homeowner's over-apply nitrates and phosphates at scales that we should not this is this is established like here in Washington there no longer allowed to put phosphates into turf fertilized through lawn fertilizer for that very reason because excessive phosphates have been applied over the years and now they're leaking into our water supply and causing algal blooms and other issues so that is a thing. When we talk about leaving he wants you to leave like all the clippings and all the organic matter and just recycle that back into your lawn and that can work in many systems but fatch I think is something that is is a problem and that's a letter of compaction and lack of microbiology to break down that organic matter are fast enough that it can suffocate your grass and I think so I think lawns require a more nuanced conversation that is very specific to the lawn just like you can't make it it's very hard to make very like general",
        "number": 4
      },
      {
        "title": "",
        "start_time": 2426.7200000000003,
        "end_time": 3040.08,
        "text": " given these circumstances what's the best way to grow this you know and and here he talks about we see right and by oh he talks about moss for example and says that moss this is this is one issue I have with soil food web people in general it's you know oh you have moss oh it's because you don't have the right a little bacteria ratio or your microbes are off well you might have moss because you have too much shade and compaction and that area gets too much water like it's not always microbes it may be other things in the environment or other issues going on I don't see dandelions strictly as an issue a calcium deficiency it might just be that that dandelion seed landed there and started growing like so I think we have to I think we have to dig a little deeper I think it's a little more complex than Jeff makes it I think he oversimplifies some of this stuff well I like what Bryant Mason said about these books and that that kind of stuff I think he said it was like the pulp fiction of organic growing it's exciting it's interesting it's it's a lot of really cool theory and it gets people thinking about how these processes work and so that's really exciting but then like you're saying we have to push past that because there's chemistry as to what's actually going on in the soil there's biology that's going on at a level that we obviously can't visually inspect and so we we have to dig a little deeper to get to the answers it's not always what's on the surface I will say I think composty is awesome for lawns because it adds water it adds a little bit of nitrogen and it adds microbes that will help break down any batch or organic matter because you're literally taking composting microbes and putting them out where we want things to compost so I think composty is a great lawn application if you want to put in the time doing the labor on it he mentions things like soybean meal, althalfa blood, cotton seed feather and he says all of them at a rate of four pounds per hundred square feet at first and then adjusted to taste I think taste is a wild choice there but those all have very different end values so just to clump them together I think agronomically is a little confusing and then fish pound meal at three pounds per hundred square feet well fish on meal is very high in phosphorus we don't need to apply phosphorus to our lawns unless it's a brand new installation so I wouldn't even do that at all so there's just I think it's more new I guess I do agree with him though that you can absolutely water with chlorinated water shoot I water or my lawn chlorinated water it's not a big deal clover I think shows up in lawns it doesn't mean you're not cycling enough nitrogen it just means that maybe you have clover and I think that's okay clover can fix nitrogen but I don't I wouldn't assume that applying a lot more nitrogen is going to make the clover go away unless you physically remove it what else follow any chemical spray or soil drenching with the application composted sure I think you could do that if you're willing to put in the labor these microbes are quite resilient though he talks about ways to apply compost teas we already covered that anything else it's not lawns before we move on to the final chapter for today I would say with lawns always be open to you know just like kind of what you were saying about we got a dig deeper be willing to dig around if you've got a dead patch you know coming from South Carolina it could be camel crickets it could be it could be all sorts of things it could be all sorts of fungal and bacterial issues it could be pests so it's not always fertility which is something we try to remind people in the cannabis world it's not always fertility it could be environment it could be pest and pathogen you know so always just try to it's you know we focus on certain things like in these conversations but try to when you approach a problem try to look at the whole picture and see what's going on yeah it's a good point okay chapter 21 maintaining tree shrubs and perennials this is a pretty short chapter I think we got this pretty fast basically his thing is the tree shrubs and perennials prefer fungal dominated soil rule number three dictates the tree shrubs and perennials prefer they're united in the form of ammonium not nitrate this means fungal soils lawns on the other hand you best with nitrates or slight bacterial dominance in their lines problem because you love your lawn right next to your tree I from my understanding of it is that these plants can create an environment in the rhizosphere which is just the few millimeters around the root tip in the root hairs that is more conducive for what they want so even if you're soil at the surface or six inches the way is reading differently they're able to adjust that and adapt it to a certain extent and buffer it to what they want in the rhizosphere so I don't get overly concerned about a soil being fungalidominate or bacterial the dominant I mean applying wood chips around the base you know without going right up to the crown of the tree but around the base of the tree I think is a great practice letting leaves break down is a great practice if that's what if you're okay with the way that looks but we can also get our plants the nutrients that they need through specific targeted fertilizers too if we're going for an aesthetic that doesn't allow us to just leave you know tons and tons of leaves all the way around the base of our perennials or trees they say he says that trees shrubs and perennials dislike compacted soils I think that applies to pretty much the majority of plants don't like compacted soils and so when we talk about not telling or not doing soil disturbance again I think that is a more nuanced conversation there's absolutely times to do soil disturbance and we want to be very targeted with our soil disturbance because that can actually encourage the soil food way to regrow and a man that's going to be healthier for the plant and allow for better physical properties of the soil for our plant because it all leads back to that whole idea of you know that triangle the three pillars of the physical properties of the soil the chemical properties of the soil and then the biological properties of the soil and this book is only really looking at the biology but we really have to look at it holistically at the three of them and make a decision based on all three of those factors. So yeah brownmail to this you know he says fungal compost I would argue in the finished compost would be fine work compost tea is great when we're for trees shrubs and perennials the nitrogen carbon as they fall from the leaves is naturally recycling the trees will actually pull a lot of the nitrogen back into their bodies of their the stem and it's and the bascular system itself prior to those leaves dropping so that's one of the reasons they don't have a lot of nitrogen they're primarily just carbon and that's why the leaves yellow at the bottom and fall off the way they do so primarily carbon I would say in terms of sort of recycling dimensions here. He talks about microisle fungi and plant these trees is something that you could add to increase the health of the plants it's it's absolutely something you could experience it with I don't really worry about it for my established plants I see them they found a relationship or they will or they're they're healthy enough without it but there are people that will go and you can do a root injection or things like that if it's something that you're really interested in or worrying about but yeah I think I think when he says unstressed plants start healthier that's that's a that's a valid point stress plants are more likely to have pathogens disease so we can if we can water properly if we can fertilize properly and we can have a healthy plant it's going to be a better able to out compete any past or pathogen pressure and I'm seeing that in my garden right now this year I've got irrigation and I'm doing a much better job of watering and my pest pressure is fraction of what it was last year and I think I attribute that just more to my proper watering and better fertility than anything else because all those things lead to more microbes because when I when I improve the hydration and I add more nutrients in the form of organic amendments what I'm really doing is I'm feeding these microbes that are then cycling the nutrients they're happier in health years so there there's more microbial activity going on in the soil when I keep those metrics right and then that leads to a healthier plant that's going to be able to better resist disease so they're all tied together just just another way of thinking about what he's saying and then the last point that he has is the bottom line he says when turning through trees and trees try to plant them and soils that are already fungi dominated if not apply fungly dominated compost multis and teas around them let leaves remain under the plants from what they drop and obviously use all your soil food web tools especially compost tea at the first sign of diseases I would just say I kind of disagree with that whole paragraph I would just",
        "number": 5
      },
      {
        "title": "",
        "start_time": 3040.08,
        "end_time": 3266.48,
        "text": " mulches and teas if you wish to you can absolutely use a compost tea if you are seeing signs of disease it's going to do identify the disease and then I would prefer to use a targeted approach maybe those specific microbes Margaret that we talked about once I've identified what the diseases and then work on getting the plant back up to health and while that is just scouting and catching a disease or an issue really early on before the plant is really stressed and dying because at that point it's really hard to fix anything and that's the end of that chapter any questions for me that was awesome yeah you love that so let me preface this by saying I am not in my colleges in another lifetime I would love to be I think it's fascinating I know that a lot of what relates to what you see in terms of above ground mushrooms is relates to the environmental conditions in which they live so when the conditions are right you'll see mushrooms start to appear and they're all appear for appearing they're they're fruiting and completing their life cycle and some of these are tied through that microized relationship to specific plants and some are not some don't ever form fruiting bodies like endo microized fungi and so I don't really worry about it when I see mushrooms I think it's great like I just assumed to me be assumption there is that I have a healthy soil food but you know it's just a natural process that occurs and I don't worry about it does it tell me a lot about what's going on in the air area and no because I'm not in my colleges and I don't learn enough to identify the different types of microbes and what their roles are but in general I think of mushrooms as decomposers I think of because they're tied to fungi which you know are underground and decomposing they're just the fruiting bodies of these fungi so yeah I just think they're just a beautiful natural part of our environment like anything else and I'm sure there are some that are indicator species for certain things I just I haven't learned enough to know yeah well I sure appreciate you guys joining us today tonight's where we are and I'll post this up on Patreon and we'll finish we'll probably finish team in microbes and next next meeting and cover the we'll go back and cover compost and mulch and then the last one we'll just be real quick so should be fast awesome enjoyed that one all right thank you guys for the great topics have a great night all right bye everybody",
        "number": 6
      }
    ]
  },
  "https://www.youtube.com/watch?v=yYxoLIsbl84_Systran/faster-whisper-tiny.en": {
    "key": "https://www.youtube.com/watch?v=yYxoLIsbl84_Systran/faster-whisper-tiny.en",
    "basename": "Extracting Knowledge Graphs and Structured Data from very long PDF files",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local/Extracting Knowledge Graphs and Structured Data from very long PDF files.mp3",
    "hf_compute_type": "float16",
    "metadata": {
      "audio_input": {
        "youtube_url": "https://www.youtube.com/watch?v=yYxoLIsbl84",
        "audio_filepath": null,
        "audio_quality": "Systran/faster-whisper-tiny.en"
      },
      "title": "Extracting Knowledge Graphs and Structured Data from very long PDF files",
      "tags": "",
      "description": "Extracting Knowledge Graphs and Structured Data from very long PDF files using gpt-4o-mini and gpt-4o.\nDownload the full Project files for this project at my Patreon along with 250+ other projects:https://www.patreon.com/posts/extracting-and-109421779\nTalk with me this Sunday the 4th, AMA for Architect+ level Patrons: https://www.patreon.com/posts/ama-meetings-for-109136215\nLearn to code fast with AI assistance with my 1000x MasterClass: https://www.patreon.com/posts/1000x-dev-103326330\\\nDiscounts for my Patrons: https://www.patreon.com/posts/announcing-perks-108997398\n\nSearch 200+ echohive videos and code download lnks:https://www.echohive.live/\nAuto Streamer: https://www.autostreamer.live/\nFastapi course: https://www.patreon.com/posts/learn-fastapi-26-95041684\nChat with us on Discord: https://discord.gg/PPxTP3Cs3G\nFollow on twitter(X) : https://twitter.com/hive_echo\n\n#knowledgegraph #structureddata #entityextraction #pdfs #gpt4o #openaiapi #largelanguagemodels #artificialintelligence #pythonai #pythonprojects",
      "duration": "00:13:02",
      "channel": "echohive",
      "upload_date": "20240804",
      "uploader_id": "@echohive",
      "download_time": "00:00:10",
      "transcription_time": "00:00:26"
    },
    "chapters": [
      {
        "title": "",
        "start_time": 0.0,
        "end_time": 606.0,
        "text": " Hey everyone, in this video, we are going to take a look at how we can structure data from a long PDF file, as you can see, and also build a knowledge graph from it, a very complex one page by page, as you can see from this 120 page and Q report from Nvidia, we were able to extract thousands, maybe about a thousand entities, plus we were able to also extract this entity relationships. Which we can explore, it's quite complex, the PDF, we use this 10Q form for Nvidia, latest quarter, and it's 126 pages long, we are able to do this because we process it page by page, so there is no limit to how many pages you can process, and quality and exact type of entities and knowledge graph you create is actually related to the system message, we will be exploring. So we can zoom in here and find smaller entities that are around, for example, here we see three months and at April 28, 777 million sales in general administrative expenses, for example. On August 25, 2023, there was a majority ruling of a three judge circuit panel, and here inside, there's quite a lot of interesting information, but you can actually modify the physics of it, I actually turned off the physics for this. We increased the avoid overlap, and they won't be so mixed in like this, let's also take a look at this other one, which was only from the 10 pages of the Nvidia report. So while this is loading, I will say that the code files for this will be available at my page, yeah, they will be in the description, please check it out. And you do become a patron, you will have access to 250 other projects like this one will give it a second for this to load, so when the knowledge graph is quite complex, you can take anywhere from the 10 seconds up to a minute to load, but once it's loaded, you can attract with it actually. While this is loading, we'll take a look at the requirements, it's on an open AI pipe PDF that works at bloodlet that works to form the graph and pilots to display it in term color for colorful printing. You could have also use pipe PDF too, which would have been better, but we are just using the regular pipe PDFs as we're processing page by page should be, shouldn't be big deal. Okay, here is the simpler graph which was done with the first, I actually loaded the same one again, my apologies, let me load this other simpler one. But at least you were able to see the animation when the physics is not turned off, I hear it's at the bottom, this allows much quicker, as you can see. And we can zoom in and see the details of relationships, I hear can also rearrange them actually the elastic simulation. All of this is created automatically the entities are saved into a JSON file and graph is saved into an HTML, you can open it up in your browser as well, so now let's take a look at how we can build something like this. Stop, we are doing all our importance and here we are whispering the number of pages, if you see it to none, then we will process all pages of the PDF, let's actually set it, let's say five. So we can see when we run this how it works, actually maybe let's begin by running it. We're going to go ahead and delete these JSON files and I'm going to copy this graph and delete that too, so we can start from scratch. So we will be processing the first five pages of the same video that PDF, as you can see, which page we are processing. We are using GPT for a minute for entity extraction and GPT for all for building of the knowledge graph, as you can see this actually builds with each page. It tries not to, it tries to avoid repetitive entities and then once the entities are extracted from the first five pages and it asks us if we want to create a knowledge graph we're going to go and say yes. And again, we will go over each entity with their title and descriptions and we the knowledge graph from it from them. There are entities are extracted and the knowledge graph is created. Once the entities are extracted, we selected yes, we created knowledge graph and now we can actually review both entities themselves. The actual liabilities is of April 28 where 27.8 million dollars, and we can also be able to relationships here. For example, share holders, it was a million, 142 million dollars, I guess. Well, let's continue with the code review. But before we begin, I if you are enjoying my video, I recommend you check out my website at go live live where you can find all my videos and there's a committee search bar too. And my patrons will be able to download the code files to any of my projects just simply click on download code. Here to the patreon page where you can download code is a patron you will have access to my courses, so I have a streamlit course first API course and most importantly 1000 X master class in which I built from scratch using cursor IDE trying to teach how to code fast increasingly. So I update this on a regular basis currently as 13 parts, I also have one on one consulting and one on one meetings in that page higher patreon tiers check those out as well now let's get back to the call. At the top, we are doing all of our imports, we set the number of pages to the amount of pages we want to extract I'm just going to send it to 10 by default. Well, you can actually set it to not if you want all the pages, then we are going to read PDF with this file name as we are important pipe PDF PDF reader from pipe PDF. Then we load the existing schema if you have any so you can actually continue extracting from where you left off. And here's the function to save to JSON schema and reload the important information and line 30. And after that we read each page and extract important information by looping over the pipe PDF readers pages here is where we set the indexing of it. And we do print and extract information from which whichever page we're working on here if the number of pages were sent to none and we calculate the total pages of the PDF. Prepare the existing schema for reference we just sort of existing schema variable off the current information which we have because we can use it and they're calling JPT for. We are calling the chat completions and for into the extraction we are using JPT for all many. Here we are saying that you are a helpful system that extracts important information from takes and returns to the JSON list. Because we are using JSON mode as a response format, they do have to mention JSON in the system message, otherwise you'll get an error from the API. In the user message extract only the most important essential information from the sticks and return as a JSON list is the following schema. Compare with the existing schema and only return the new information not already the present. We give it the existing schema, I guess we should put a new line here only extract new information not already present in the schema, but a new line here as well, then this is how we are defining our schema. Ordinary information is going to be a list this is crucial so we can continue this list this is the essence of how we are extracting over longer PDFs. It's going to return a title description a date and a citation a five word exact phrase from the docs if he so this is a very cool to actually get citations for example if you go to important info and here we find something like earnings per share should be able to search this if. model them making a mistakes like control have on actually find this exact phrase so this is a good way to provide citations so we can actually confirm that this information actually exists in the citation what we are saying a five word exact phrase from the docs where this information was taken from. And we pass in the text as we said we are using JSON mode and I'm past JSON response here when the responses return at the pages important formation to the overall list you get the important information and add extended with the new info can also print the schema right here and same updated schema. page and the final extracted information you can comment side if you didn't want to see it, as you can see we happen to hear somewhere really. Yeah, here I hear say the knowledge base to JSON separately, you can this is and like maybe a step that is not necessary because it's important for knowledge based on replicates but important for. not to continue extracting entities evil from where you left off it will be using important info that Jason swam with that. And it will print that knowledge base has been saved to a JSON file and then here's the function it knowledge graph before the network using network X. And parameters for its visuals and we loop over each of the important information such as title description and date we add them with a node and then extract entities and relationships from description.",
        "number": 1
      },
      {
        "title": "",
        "start_time": 607.0,
        "end_time": 782.0,
        "text": " object is going to turn into one into two in relationships that is present across each and every one of these titles so you can modify this if you're one of the different behavior just remember that you can make it your own. And we get that each entity relationships we loop over them we get the off entities and the relationships and we add the nodes and the edges and then we toggle physics true you can set this to false and I'll show the buttons and we return the net now that's this was just a function create knowledge graph. We are going to use it after we asked you want to create knowledge graph yes no if the user answers yes time you're going to create it and save it as a knowledge graph that HTML informative print statement so you can see it's pretty simple but. It works very well like I said, called files for this will be available at my page now, like will be in the description and in common and offer you check out my website we can have access to all my videos over 250 of them and 250 of them were available to download for my patrons any one of them like I said. And check out my interest really love the thousand x master class, if you want to take care of look at it. It's available at connoisseur level patrons. I also have weekly may meet each for my active plus patrons next one is tomorrow Sunday, I was fourth wall p.m. but we do this on a weekly basis. And I also started. Peyton perks these are discounts and free memberships and so on from different interesting providers first one. only one currently we have is boring lounge we can help you to the blue sewer. ACO score for your startup by submitting it to 100 plus platforms. Our offering. Resolve my take little patrons and four dollars off to my connoisseur level patrons. And finally, I do have one on one consultations this is also it's different different tiers at my patreon if you take a look at it where choose are in prodigy. One hour per month and three hours per month, respectively. Thank you for watching if you did enjoy this please give it a like and subscribe to get notified my future video. For I am much more active recently on x platform my handle is at high on the score echo. Rejoin me there I post valuable content over there as well. Thank you for watching and see you in the next video.",
        "number": 2
      }
    ]
  },
  "https://www.youtube.com/watch?v=b0HMimUb4f0_tiny": {
    "key": "https://www.youtube.com/watch?v=b0HMimUb4f0_tiny",
    "basename": "Docker Tutorial for Beginners",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local/Docker Tutorial for Beginners.mp3",
    "hf_compute_type": "float16",
    "metadata": {
      "audio_input": {
        "youtube_url": "https://www.youtube.com/watch?v=b0HMimUb4f0",
        "audio_filepath": null,
        "audio_quality": "tiny"
      },
      "title": "Docker Tutorial for Beginners",
      "tags": "docker, mcoding",
      "description": "Docker Tutorial for Beginners teaching you everything you need to know to get started.\n\nThis video is sponsored by Docker. https://www.docker.com/\n\nWhether you're a student or a professional, let's learn the fundamentals of Docker by example, from start to finish in an easily understandable way, using hands-on demos and code examples along with explanations detailing the important points.\nBy the end of this tutorial, you will understand the basics of Docker, including what Docker is and what problems it solves, what's the difference between containers and virtual machines, how to install Docker, what's the difference between containers and images, how to pull images and run, run containers with environmental variables, arguments, and mapped ports, how to reduce Docker image size using slim and Alpine images, how to persist data in volumes and bind-mounts and understand the difference between volumes vs bind-mounts, how to build your own custom images using Dockerfiles and understand Docker layers, how to create multistage builds, how to use Docker compose to manage multiple containers, how to publish Docker images to Docker Hub, and some advice on deploying Docker containers in the cloud.\n\nThroughout the course we will create a fully functioning containerized app with an NGINX frontend, Python FastAPI backend, and MongoDB database.\n\n\n― mCoding with James Murphy (https://mcoding.io)\n\nDocker: https://www.docker.com/\nDockerfile reference: https://docs.docker.com/reference/dockerfile/\nCompose file reference: https://docs.docker.com/compose/compose-file/\nDocker Hub: https://hub.docker.com/\n\nSource code: https://github.com/mCodingLLC/VideosSampleCode\n\nSUPPORT ME ⭐\n---------------------------------------------------\nSign up on Patreon to get your donor role and early access to videos!\nhttps://patreon.com/mCoding\n\nFeeling generous but don't have a Patreon? Donate via PayPal! (No sign up needed.)\nhttps://www.paypal.com/donate/?hosted_button_id=VJY5SLZ8BJHEE\n\nWant to donate crypto? Check out the rest of my supported donations on my website!\nhttps://mcoding.io/donate\n\nTop patrons and donors: Laura M, Neel R, Dragos C, Jameson, Matt R, Pi, Vahnekie, Johan A, Mark M, Mutual Information\n\nBE ACTIVE IN MY COMMUNITY 😄\n---------------------------------------------------\nDiscord: https://discord.gg/Ye9yJtZQuN\nGithub: https://github.com/mCodingLLC/\nReddit: https://www.reddit.com/r/mCoding/\nFacebook: https://www.facebook.com/james.mcoding\n\nCHAPTERS\n---------------------------------------------------\n0:00 Intro\n1:24 What is Docker and Why?\n3:21 Docker containers vs Virtual Machines\n4:17 Installing Docker, Docker Desktop\n6:21 Docker hello world\n7:17 Docker containers vs images\n8:35 Port mapping Docker containers\n10:00 Run Docker container in background\n11:29 Docker tags and digests\n13:33 Running with env vars and args\n14:28 Slim images and Alpine images\n16:04 Debugging running Docker containers\n17:16 Persistence with Docker volumes and bind-mounts\n22:25 Custom Docker images, Dockerfiles, frontend NGINX\n26:06 Docker layers\n29:01 Custom Docker images, backend Python FastAPI\n33:40 Docker multistage builds\n36:39 Docker compose\n39:53 More compose, adding a MongoDB database\n45:09 More compose, adding mongo express to explore the db\n46:58 How to publish Docker image to Docker Hub\n49:34 Deploying Docker containers in the cloud\n50:23 Thanks",
      "duration": "00:50:38",
      "channel": "mCoding",
      "upload_date": "20240802",
      "uploader_id": "@mCoding",
      "download_time": "00:00:27",
      "transcription_time": "00:02:16"
    },
    "chapters": [
      {
        "title": "Intro",
        "start_time": 0.0,
        "end_time": 84.0,
        "text": " Today, let's learn about Docker.  This tutorial is for anyone wanting to learn how to use Docker in a hobby or professional setting.  We will start from the absolute basics and include everything you need to get started, including  what Docker is and what problems it solves.  How Docker containers differ from virtual machines,  how to install Docker, which you can do on Windows, Mac and Linux,  what's the difference between containers and images,  pulling running and debugging containers,  port mapping, environmental variables and arguments,  persistence using volumes and bind mounts,  building your own Docker images,  optimizing images and multi-stage builds,  using Docker compose to orchestrate multiple containers  where we'll put it all together to make a fully functioning application using  an NGNX front end serving HTML,  a Python backend using fast API with a MongoDB database,  as well as how to publish your Docker images to an image registry like Docker hub  and some final notes about deploying containers in the cloud.  This video is sponsored by Docker.  That's right.  The company that makes the tool is also sponsoring this video,  which is awesome because Docker is a tool that I actually use,  pretty much every single day.  In fact, I've been using Docker for longer than this channel has even existed,",
        "number": 1
      },
      {
        "title": "What is Docker and Why?",
        "start_time": 84.0,
        "end_time": 204.0,
        "text": " What exactly is Docker and why would we want to use it?  I think it's easier to start with the problems that Docker solves.  Have you ever got some code working on your machine  then transferred it to another computer or given it to a coworker  and it doesn't work anymore?  Or worse, the tests pass on your machine,  but fail in production?  Have you ever burned an entire day trying to install a program  and no matter how closely you follow the docs,  it just doesn't seem to work?  Have you ever installed an application?  Only to have a seemingly unrelated system upgrade  break your application?  Have you ever had two applications both individually work fine,  but when you try to install both of them, they don't work anymore?  These kinds of problems can range from being an annoyance  all the way up to crashing your app in production.  The underlying cause of all these issues  is that your application depends on more than just your source code.  You need to make sure that the right versions of all your dependencies are installed  that your operating system has all the necessary packages installed  that any services, config files, users, and permissions are set up correctly  and that none of these hidden dependencies  conflict with the hidden dependencies of any other part of your application  or the rest of the system.  That's where Docker comes in.  Docker is software for deploying and running containerized applications.  Docker solves all these problems using containers  which are isolated groups of processes.  Each container has its own file system that has everything it needs to run  like your app, dependencies, system packages, and so on.  So all the issues with conflicting hidden dependencies  or system upgrades on the host breaking your code just disappear.  Containers are also isolated from each other  and the host using kernel isolation features  so containers have a limited ability to affect each other  beyond competing for system resources  or competing with each other over the network  unless you specifically give them extra permissions.",
        "number": 2
      },
      {
        "title": "Docker containers vs Virtual Machines",
        "start_time": 204.0,
        "end_time": 257.0,
        "text": " and you're right.  Using a virtual machine with a custom image  could provide a lot of the same benefits.  However, if you've ever tried running a virtual machine before  you probably noticed that virtual machines tend to be significantly slower than the host.  This is because virtual machines emulate, well, entire machines,  the kernel, hardware drivers, network stack, everything.  And that's a ton of overhead just to run a single application.  In contrast, Docker images are made up of normal processes running on the host system.  High solution makes them feel like they're own little machines  but they actually use your existing kernel, your existing hardware,  your existing network, so you get much closer to native performance  and have much more efficient use of system resources  than with a virtual machine.  So while virtual machine images are typically gigabytes big  and take minutes to start, Docker images are usually only megabytes",
        "number": 3
      },
      {
        "title": "Installing Docker, Docker Desktop",
        "start_time": 257.0,
        "end_time": 383.0,
        "text": " Next, let's install Docker.  If this is your first time using Docker,  you probably want to use Docker desktop,  which is available for Windows, Mac, and Linux,  and comes with everything you need to use Docker,  including both command line and GUI interfaces.  If you are more experienced and prefer the command line only,  then I'd recommend installing Docker engine,  which comes with the core functionality but no GUI.  Docker desktop does more than just provide a GUI though.  Docker was originally developed for Linux  and most Docker containers are for Linux.  So Docker desktop uses a hypervisor layer  to run a lightweight Linux distro,  which is what allows you to be able to run Linux containers  even when you're on Windows or Mac.  I'll show you what I do to install Docker,  but keep in mind that setup instructions change over time.  So always refer to Docker's official installation instructions  for how to install for your system.  In particular, make sure you're running an operating system version  that is specifically listed as supported.  I'm on Linux using a fresh install of Ubuntu 20204.  As always, make sure your system is up to date  before installing anything.  Next, I'll set up Docker's package repository  following instructions at this link.  All you need to do is copy and paste this code into your terminal.  Then I'll download and finally,  apt install the .dev file.  It looks like we got an error,  but according to the docs, this is expected  and we can just ignore it.  And that's it.  Let's start up Docker desktop in order to start the Docker  demon, which is what manages containers under the hood.  Review and accept the service agreement.  And I'll go ahead and continue without signing in for now.  Skip the survey and we're in.  You can set it to run on startup in the settings if you want.",
        "number": 4
      },
      {
        "title": "Docker hello world",
        "start_time": 383.0,
        "end_time": 437.0,
        "text": " so let's start by running hello world.  We did that with Docker run hello world,  and as you can see, it pulled the latest  image and ran it.  If we run hello world again,  it doesn't download the image again,  since we already have it downloaded.  If you wanted to download the latest image  or pull a specific image without running it,  you can use Docker pull.  In this case, it just confirms that,  indeed, we have the latest image that we downloaded just a few seconds ago.  And a quick security note by default,  Docker runs with root privileges,  because it needs to be able to do things like bind to privileged ports,  mount file systems, and modify network settings.  It's possible to run Docker without root,",
        "number": 5
      },
      {
        "title": "Docker containers vs images",
        "start_time": 437.0,
        "end_time": 516.0,
        "text": " Now that we can run Docker commands,  we should get some of the basic concepts down.  The first one is the difference between  Docker containers versus images.  Take a look at our containers tab,  where we have two separate containers  that both have an image of hello world.  Whereas in our images tab,  we only have one image, hello world.  The relationship is that images are templates for containers.  Images specify the contents of the file system,  what applications are installed,  users, environmental variables,  and the default command that will run when you start a container.  You can think of an image as a recipe for running an application.  Containers, on the other hand,  are the actual groups of processes that are launched  that follow the instructions the image specified.  Every time I use Docker to run an image,  it creates a new container based off that image.  That means I can have many containers  all based off the same image,  even running at the same time.  You can see your images and containers in their respective tabs,  or Docker image LS will show us images.  And Docker PS will show us running containers.  Our hello world's already exited, so we see nothing.  If we want to see them,  then we use a dash a flag to include all containers,",
        "number": 6
      },
      {
        "title": "Port mapping Docker containers",
        "start_time": 516.0,
        "end_time": 600.0,
        "text": " Let's try running something with a little more substance than hello world.  How about an Nginx web server?  Nginx is publicly available on Docker Hub,  which is the default image registry that Docker uses if you don't specify.  So we can use Docker, poll, Nginx,  or in our case Docker run Nginx.  And that downloads and runs the latest version,  in this case 1.27.0.  It looks like it downloaded and started up fine.  This output here is the logs for the container.  We can see it's still running in the GUI,  but when we visit localhost,  we don't see anything.  That's because by default, containers are isolated from the host network.  In order to interact with the Nginx server,  we need to publish the port it's listening on,  or host can see it.  We do that using dash p flag.  Let's stop it and try again.  Now when we go to localhost,  we see the default Nginx page.  In this case,  we wanted to publish the container's port 80 to our own port 80,  but you can remap ports however you like.  If we wanted the Nginx page to be available on port 5000,  we could run the same command with 5000 instead of 80.",
        "number": 7
      },
      {
        "title": "Run Docker container in background",
        "start_time": 600.0,
        "end_time": 689.0,
        "text": " I've also been running this container in the foreground so far,  and I've been stopping it using control C.  If you want to run the container in the background,  you can slap on a dash D for detached.  Now my terminal stays free.  This string that it printed out is the container ID,  you can use to interact with the container while it's running,  or tell me located in the GUI.  We can see part of that ID here with Docker PS.  For most commands that need a reference to a container,  you can refer to it either by the container ID or by its name.  You can specify a name when you launch the container using dash dash name,  otherwise one will be randomly generated.  That's what we see here, a randomly generated name.  If I wanted to see the log that we're being printed out before,  I could use Docker logs and then paste in either the name or the container ID.  Or of course I can go to Docker desktop, find the container in the list,  open it up and look at the logs in the GUI.  You can also stop containers in the GUI as well, or by using Docker stop.  We've also started to accumulate a bunch of containers here.  These will not be deleted unless you delete them, which can be done in the GUI,  or with Docker container prune.  This will remove all stopped containers.  Or you can tell Docker to automatically delete the container when it stops,",
        "number": 8
      },
      {
        "title": "Docker tags and digests",
        "start_time": 689.0,
        "end_time": 815.0,
        "text": " Next, let's talk about tags.  You may have noticed that in our Docker run command, we just said,  if you don't specify, you just get the latest version,  or the latest version you already have downloaded.  We can pick a specific version by adding a colon and a tag.  Nginx 127 will give me the Nginx image that's tagged with the label 1.27.  But be warned, Docker tags are like symbolic links.  Nginx 127 points to some image.  Currently it's an image running Debian Bookworm with Nginx  1.27.0.  But when Nginx1.27.1 gets released,  they'll most likely update the 127 tag to point to a new image  that's running Nginx1.27.1.  To mitigate that risk, you can use a more specific tag,  like Nginx1.27.0 dash Bookworm.  That's very unlikely to be updated to a new image,  or you can pin the image using its digest, which uses the Shaw 256 hash function.  The digest was printed out the initial time we pulled the image,  or we can find it using Docker image,  LS--digests.  Or it's also displayed on Docker hub.  You can go to the tags list and then search for the tag that you're interested in.  Look for it in the list here, in this case we want 127.0 Bookworm,  and here's that same digest.  Then whenever you specify the image, put an ad with the digest at the end.  If you provide a digest, you can leave the tag there for humans,  but it's ignored.  Pinning by digest is the only way to have high confidence that no changes are introduced  in your container's environments unless you specifically asked for them.  For a production application, I highly recommend pinning by digest, not by version.  This is effectively the same advice that I give for get tags  and for Python packet versions.  Tags are great for humans, but they don't provide the kind of stability that hashes do.",
        "number": 9
      },
      {
        "title": "Running with env vars and args",
        "start_time": 815.0,
        "end_time": 869.0,
        "text": " Moving on, let's talk about environmental variables and arguments.  Just like normal programs, containers can be run with environmental variables and arguments passed at runtime.  Just to demonstrate, let's run Python and pass it some environmental variables.  You pass environmental variables with dash E flags.  And you pass the command and arcs to run just after the image.  Here, we're still going to run the default Python command and we pass it,  the dash C that allows us to give an inline script to run that prints out the environment.  The output shows our ABC123 and RDF456.  But I don't know if you noticed because the way time was cut out in the video,  but this Python image is over a gigabyte big.",
        "number": 10
      },
      {
        "title": "Slim images and Alpine images",
        "start_time": 869.0,
        "end_time": 965.0,
        "text": " In production and testing settings, image size matters a lot.  Python, like many other popular images, provides tags that come with various different environments with various different things pre-installed.  The default Python image is currently based on a fully featured Debian install.  In contrast, any of the tags that have slim in them are based off much more barebones version of Debian.  Pulling that image.  We see it's nearly 10 times smaller than the non slim version.  If that's still too big, keep an eye out for tags that have alpine in them.  Alpine refers to alpine Linux, which is a lightweight Linux distro focused on minimalism.  Pulling the alpine image.  We see it comes in at only 55 megabytes, around half the size of the slim version and 20 times smaller than the main version.  I recommend using either the slim or alpine images if they're available.  However, while slim is usually an easy win over the non slim version, choosing between slim and alpine is not as obvious.  Alpine Linux is significantly different than Debian Linux.  Alpine uses muscle lib c instead of g lib c, it doesn't come with bash, and it uses the APK package manager instead of apt.",
        "number": 11
      },
      {
        "title": "Debugging running Docker containers",
        "start_time": 965.0,
        "end_time": 1036.0,
        "text": " Next up, debugging containers.  Let's say we have a container running, and something's not quite working the way we want to.  Yes, we can inspect the logs, but sometimes you just need a shell to poke around.  The two main ways of doing this are number one using the GUI.  Clicking this exact tab gives you a root terminal where you can play around.  Alternatively, you can use Docker exec at the command line, which allows you to execute a process on an already running container.  The dash IT stands for interactive and TTY.  Interactive keeps standard in open allowing you to interact with the process, and TTY allows terminal features like command history and auto complete to work properly.  The specifics aren't that important, just remember if you want an interactive session like a shell or a ripple with Docker run or Docker exec use dash IT.",
        "number": 12
      },
      {
        "title": "Persistence with Docker volumes and bind-mounts",
        "start_time": 1036.0,
        "end_time": 1346.0,
        "text": " Moving on, we need to talk about persistent storage.  From everything we've seen so far, every time we run a Docker container we start fresh with a pristine container generated from the same image that starts with the same file system every time.  Any files written from the previous runs are gone.  We can demonstrate this with a simple Python script.  All it does is open a file, write to it, and then print out the contents of the file.  But every time we run it, we still just see one copy of RAM because it's starting clean every time.  But many applications like databases have data that they want to persist across runs, even to persist across image changes, like upgrading the database version.  We can achieve that using a mount.  You can add a mount to your container using dash v, which stands for volume, or using the more verbose dash dash mount syntax.  This time, this slash data directory is populated by a volume that lives beyond the lifecycle of the container, so each time we run the script, we see the previously saved data.  Currently in Docker, there are three kinds of mounts, volumes, bind mounts, and tempFS mounts.  Volumes and bind mounts are used for persistence, whereas tempFS mounts aren't persisted and are beyond the scope of this video.  Volumes are newer, more fully featured, and are completely managed by the Docker demon, whereas bind mounts mount a local file or directory from the host into the container.  The syntax of using a volume versus bind mount is nearly identical. They both use the dash v flag. It just depends on whether you give it a name like my data or a relative or absolute path, like slash my data or dot slash my data.  If you give it a path, then Docker will mount the source path into the target path has a bind mount. If you give it a name, then Docker will mount a named volume into the target path.  Let's try creating my data directory and passing dot slash my data to the dash v.  It seems like this version also works and persists our data. The only apparent difference right now is that we can directly see and manipulate the contents of the my data directory.  Whereas the my data volume is stored in some location managed by Docker that we don't really know about, so which one should you use?  It really depends on why you want to share the data with the container in the first place.  When you're developing code on your local machine, bind mounts tend to be what you want because their main benefit is that they're simply mapping a file or directory on the host into the container.  You can see all the files right there inspect them in your IDE or with other programs and change them as you please.  This can be really useful to quickly modify an image to your liking by sharing a config file or build artifacts between the container and the host.  It allows you to quickly iterate without going through the process of building your own image and rebuilding it every time you make a change.  Watch out though, mounting a host directory means you're giving the container direct access to that directory, meaning a container can modify or delete files or change permissions of files on the host.  This risk can be mitigated by setting the mount to be read only, which is what this colon R.O. at the end does.  But sometimes containers just need right access.  A common annoyance is when a container, C.H. owns the directory to root within the container because it's a sensitive config file, which then makes your current user unable to view or modify the files until you pseudo C.H. on them back.  Volumes on the other hand tend to be much more appropriate in a production setting because of the additional features they provide that are useful in cloud environments.  Since volumes are managed by the Docker demon and not the host file system, volumes can be easily shared across multiple containers, even containers running on different hosts, or with the underlying data stored on a remote host or cloud provider such as in an Amazon elastic file system, an NFS share, or an SSH file system.  Volumes also abstract away the file system of the host, which removes the risks associated with giving a container access to files on the host.  But the flip side of that is that you can't conveniently view or modify the contents of a volume from the host.  I mean, if you use a local volume, the files are all there, it's just not convenient.  The primary way you're meant to interact with a volume is through containers, not directly from the host.  But for many use cases, you might not care to actually see those files. Unlike a config file that I might want to go back to reference and iterate on.  The underlying storage for a database is typically not in a human readable format anyway, so providing a directory in my project folder for a database to store all its junk is more of a nuisance than anything.  In that case, a volume would be more convenient than a bind mount, even in a development setting.",
        "number": 13
      },
      {
        "title": "Custom Docker images, Dockerfiles, frontend NGINX",
        "start_time": 1346.0,
        "end_time": 1570.0,
        "text": " So far, we've seen how to use existing Docker images, but we only customized them through environmental variables, arguments and mounting files and directories.  If you ever want to customize beyond that, Docker makes it super simple to build your own images.  I went ahead and installed on my dev tools, let's open up a new project folder in VS Code.  I always recommend creating a project folder when you're creating Docker images to stay organized.  Let's start by creating an image with an engineering server that serves custom HTML instead of the default.  That's a front end service, so let's make a front end folder and a single file named Docker file.  Make sure to install the official Docker extension to get autocomplete and syntax highlighting.  Although Docker files completely specify the file system, we don't have to start from scratch.  You can and usually do use another image as a starting point by using the from keyword.  Let's base our image on Nginx 1270.  At this point, we can already build our image using the Docker build command.  Take note that the dash T flag specifies the name and optionally a tag.  And don't leave off that dot at the end.  The dot specifies the build context which tells Docker where it's allowed to look for files, in this case the current directory.  By default, Docker uses the Docker file at the root of the build context, or you can specify the path to a Docker file with dash F.  Anyway, we see the Docker created our image and now it's lifted in our Docker desktop.  We could run it too, but right now it's just a copy of Nginx, which we can see by comparing the hashes.  So let's customize it.  Let's create a static folder for our HTML and put a minimal index dot HTML that maintains a to do list.  Feel free to pause to check out what the JavaScript is doing.  It's pretty simple. We just have a single function to add an item to the list that also creates a button to delete that item.  Starting from an Nginx image, all we want to do is copy this code from the static file into the directory that Nginx expects its HTML.  We do exactly that with the copy command.  The sources of a copy command are relative to the build context, in this case the front end directory, whereas the destination of the copy is a path inside the images file system.  Let's go ahead and build and run our image.  And voila, we see the most beautiful website known to man.  If we exact into the container and navigate to slash user, share, Nginx, HTML, there we see the contents of our static folder.  The Nginx image left this 500 error page there.  So let's delete that using a run command before copying everything over.  Run just runs a command inside the image.  Then let's build and run again.  And there we go. We have a nice and clean directory with just our index file.  I want to point out how fast the build process was. How is it that we're specifying an entire file system, but it takes basically no time to build?",
        "number": 14
      },
      {
        "title": "Docker layers",
        "start_time": 1570.0,
        "end_time": 1741.0,
        "text": " Layers are like image diffs.  At build time, the Docker file is run in order and each command that you run in your Docker file creates a new layer based off the previous one.  Because Layers act like diffs, a small change like deleting a directory or copying a folder results in a small diff.  Layers are also immutable, so even an operation like a delete creates a new layer. It doesn't modify an existing one.  Importantly, Docker doesn't just store the final image. It stores all the individual layers, which makes it possible to reuse existing layers.  As we already downloaded the engine X image, Docker already has all its layers cached for immediate use and just needs to apply two tiny diffs to create our final image.  That's what we're seeing here. Docker desktop lets you inspect the layers in an image and the commands that create them, which is a great way to learn about Docker files.  At build time, Docker attempts to use cached layers wherever possible.  Docker will check the current command against the last time you built and reuse the results unless the cache was invalidated.  Different commands have different caching rules, but the main ones to keep in mind are  Number one, changing a command invalid's the cache for the current and all later commands.  So if I change this 127.0 to 127.1, it will have to download all the new layers from 127.1 that weren't in 127.0,  then it will have to rerun the run and copy regardless of whether anything else changed.  But if I changed the run command, it would only rerun the run and copy.  If I changed the copy, it would only rerun the copy.  And rule number two, most commands are cached by default, even if they aren't pure functions.  This run command is pure. The resulting image relative to the previous one should be the same every time regardless of when you run it.  But in general, a run command can do almost anything.  You could apt get install some package today and tomorrow the same command might download a different binary.  But Docker will cache and reuse the result from today.  If you want, you can force Docker to not use the cache with dash dash no cache in your build command.  But don't worry, the copy command additionally uses file metadata to invalidate the cache.  So if your source contents change, it will at least invalidate copy commands even if your Docker file doesn't change.  We'll see some caching tricks to speed up builds later on.  And one final security warning about layers before we move on.  To reiterate a run command that delete something does not modify the previous layer, it creates a new layer on top of it.  That means it's not safe to put any sensitive information inside a Docker image even if you delete that information in a later command.",
        "number": 15
      },
      {
        "title": "Custom Docker images, backend Python FastAPI",
        "start_time": 1741.0,
        "end_time": 2023.0,
        "text": " Now that we have a front end working, let's create a simple Python backend to store or to do lists so that it can persist across refreshes.  Go ahead and create a backend directory with source and my site directories within it with a main.py file.  Also remember to create and activate a new virtual environment.  Go ahead and pip install fast API and then use pip freeze to create your requirements to xd file.  Again, in a production setting, I recommend pinning notches versions, but hashes as well.  But that's out of the scope of this video, so we'll just pin the versions.  In our main.py, let's start with some imports and creating the fast API object.  Next we create two pedantic models for R to do items.  An item will have an ID and some content, but creating an item will just require the user to give us the content.  We'll store that to do as a global in memory list and just use a global counter to generate IDs.  Then we'll have three endpoints, one to create to do items, one to list all the to do items and one to delete a to do item by its ID.  Feel free to pause here if you'd like to check out the implementation of the endpoints, but they should be pretty straightforward.  Next, let's create a Docker file at the root of our backend directory.  We'll base our image on Python 312 slim.  This worktor command sets the working directory inside the image.  It's common to store your Python project in an app directory like this.  Then let's copy over our requirements txt and run pip install to install our requirements.  After that, we copy over the rest of our source.  We could have copied the requirements and source in a single copy command, but splitting them is actually intentional.  Remember, if nothing changed, then Docker will cache previous commands, including this run.  Requirements files change far less frequently than source files, so I copy and install their requirements first.  Then as long as no requirements change, a change in just a source file will not require rerunning the pip install command, which is the flowest part of the build.  We also give pip the no caster option because the caster would be inside the image, which would be pointless.  Next, we use the Expose command, which I think is quite confusing.  This is not a way to automatically expose a port to the host.  Whether you expose in your Docker file or not, you will still have to use the dash p flag when you run it in order to publish the port to the host.  In older versions of Docker, expose actually did something meaningful, but the modern purpose is that the Expose command is basically just documentation for the reader.  But I still use it because documentation is good.  Finally, we have the command command, which specifies the default command that will be used if known as supplied when you run the container.  This command will be executed using slash bin slash SH, but there's also an entry point command if you want to specify a different executable.  Command and entry point also allow you to specify either a string or a list of strings like we do here.  I always recommend using the list of strings approach.  Great, let's build it and run it, remembering to publish port 8000.  Looks like it's started up just fine, let's open it in the browser.  Open up slash docs and we can see our fast API swagger docs with our three end points.  Next, I've updated the front end to actually call the back end.  I've just hard-coded the URL here and I'm using the built in JavaScript fetch.  We list our to do using the get end point.  We add an item using the post endpoint and we delete an item using the delete endpoint.  Let's rebuild and run them both.  Let's test it out and as per always, we forgot to add the course middleware, so the browser is blocking our requests.  Cours is beyond the scope of this video, but the short answer is that we access the website from localhost on port 80,  but the JavaScript is calling out to localhost on port 8000.  For security purposes, those are treated as two completely different websites,  so the browser treats that as malicious behavior and blocks it unless the response specifically indicates that it's okay.  Back in our main file, we just need to import and add this course middleware.  Let's rebuild and run it again.  And now our back end and front end are both up and running and talking to each other.  Just to show you that it's working, let's add some items to the list.  And see that even after a refresh, we still have our items in the list because that's now persisted by the back end.",
        "number": 16
      },
      {
        "title": "Docker multistage builds",
        "start_time": 2023.0,
        "end_time": 2209.0,
        "text": " At this point, I want to show a neat trick with Dockerfile that helps both with security and can drastically lower the overall image size.  I'm talking about multi-stage builds.  Take a look at this Dockerfile again.  The problem here is that the final image includes things that were only needed during the build process and are not actually needed in production.  Our example is pretty minimal, so there's basically just this requirements.txt that isn't needed at runtime.  But in a general application, you are build dependencies and runtime dependencies can deviate significantly.  They can include things like heavy build systems, a sea compiler and so on, and the build process itself can generate many unwanted files like caches and locks.  This can also be a security risk because having build tools available on a production machine leaves a much greater attack surface.  Introducing multi-stage builds.  What we can do is separate the commands used for building versus running the application into separate stages.  In our build stage, the goals to produce all the wheels we need to install so we can just copy them into our run stage.  Then all the run stage needs to do is install those pre-built wheels and run.  In order to make this work, we'll need to make our project an installable package first, which I recommend doing anyway.  So let's add a pie project.tommel file to make our code installable.  Here's a pretty minimal one using setup tools. We just set our project name, Python version, our project version, and then any hard dependencies.  And then we specify where to find our packages. I also added this empty init.py.  That's all we needed to do in order to make our package installable, so let's get back to the Docker file.  This time we copy over our infrequently changing project files, but instead of pip installing into our environment, we use pip wheel to create pre-built installable wheels, which are like glorified zip files.  Then we copy over our source and build a wheel for that as well.  We define more stages by using more of these from commands, and since we have more than one, we should give them both names.  In the runner, we use this copy command with this special dash dash from to tell Docker the source location is not from our build context, but rather from the previous builder stage.  We copy all the wheels over, install them, then delete the wheels.  I snuck in another optimizing trick here, notice how we're using a single run command with two commands in it.  By grouping commands together, we can decrease the number of layers and potentially squash creates and deletes that cancel out.  Although, that doesn't apply in this case, since our wheels were not generated in this run command.  Now, no matter how complex the build process was, the runner image has no build dependencies, we started fresh and directly installed the production wheels.  Time to rebuild.  In this case, Docker automatically selected the runner as our final target, but you can have many stages in a multi-stage build, like a builder,  or dev test and progress runners.  But if you have a specific one you're looking to build, then you can use dash dash target and specify the stage name.  You could also use multiple Docker files instead, just do what works for you.",
        "number": 17
      },
      {
        "title": "Docker compose",
        "start_time": 2209.0,
        "end_time": 2394.0,
        "text": " They may contain different ports they need to publish, have environmental variables, volumes, and so on.  That's because Docker files are for individual components, like our front end or back end, but our application isn't just a single component.  Our application is a composition of components all orchestrated in a particular way.  We have a front end, back end, maybe a database, a load balancer, a reddish cache, a task queue, and so on.  For these compositions of components, we use a higher level tool called Docker Compose.  Create a Docker Compose.Yamil file at the project root.  We specify each of our components as a separate key under the top level services key.  For the back end, let's give the image and container a name.  And since we're building the image, we need to add build-in foe.  We want Docker to build the back end as if the back end directory was the root in the build process, so we set the context to be the back end folder.  By default, it'll use the Docker file named Docker file, but I always like to specify it by name since you might have more than one.  The back end is a multi-stage build, so I also like to be explicit about the stage we want as the final result, so we set the target to be the runner stage.  Then we can specify the ports that we want to publish, just like we're using the dash p flag in Docker run.  Unlike the exposed command in the Docker file, this ports configuration will actually map ports between container and host.  Add another top level key for the front end, which is similar. We have an image and container name, and we specify a build.  The front end is not multi-stage, so we don't need to specify a target, and we expose port 80.  In order to avoid accidentally pulling some random person's image from Docker hub that might have the same name, you can either set the pull policy to never, or you can change the image to point to a repository you own.  For now, let's just set the pull policy to never.  Next, let's use Docker compose to build all the images.  Now that all the images are built, we can start everything all at once using one command, Docker compose up.  If you've never seen this before, it's pretty cool.  One command and our whole stack is up and running. You can see the logs from both of the containers here.  You can use the dash deflag just like you can with Docker run in order to do everything in the background.  We can also see everything nicely grouped together in the Docker desktop GUI.  You can shut everything down by clicking this button, or with control C at the terminal, or with Docker compose down.  Docker compose down actually deletes the containers.  So if you just wanted to stop them, you could have used Docker compose stop.  And Docker compose start to start them back up again, though I usually just use up and down.  I hope you can see this is way more convenient than starting stopping everything manually.  And using compose also creates an isolated network just for these containers.  As opposed to putting everything in a global default network, or having to manually manage networks yourself, which I didn't even talk about.",
        "number": 18
      },
      {
        "title": "More compose, adding a MongoDB database",
        "start_time": 2394.0,
        "end_time": 2709.0,
        "text": " Now that we have Docker compose at our disposal, let's see how to add a database to our stack so that when we shut down our server and start it back up again, we don't lose all of our data.  And our compose file add a new service for MongoDB.  This is another public image.  Let's grab version 7012, which is the current latest release.  Set a container name.  We have nothing to build.  And for this one, we actually don't need to specify any ports to publish because we don't need to access the database from our host.  We only need to access the database from our back end.  Compose creates a network for the services, so by default all the containers in this compose file can talk to each other.  Additionally, it's set up so that they can refer to each other by their service names.  So when it comes time to tell our back end the connection string for the database, we can just use MongoDB for the host name.  Since we need to persist our database data, let's use a volume, which we can specify in the compose file.  Create a top level key for volumes, and since the default volume options are fine, all we need to do is specify the name of our volume we want to create.  Let's call it MongoDB data.  Then in our MongoDB service, we specify that MongoDB needs to mount that volume at slash data slash TB, which is where MongoDB expects it.  Lastly, our MongoDB needs a username and password, which the image expects from environmental variables.  You can pass environmental variables like this, but do not do this with sensitive data like passwords.  Docker files and compose files are meant to be tracked in your git repository.  Therefore, they should not contain any secret data.  Instead, you can pass environmental variables using an end file like this.  Create a folder for the MongoDB service and in there create a file named.n.  Take the environmental variables and put them in this.n file.  Then in your compose file, use the end file key, specifying the path to your.n file.  Immediately afterwards, you should create a git ignore and add.n to your git ignore, so you don't accidentally commit any end files.  There are still security considerations around storing secrets and environmental variables at all, particularly if you're running untrusted or malicious code on the same machine.  If you expect your server to be compromised, or if you need to segregate who at your company has access to production hosts versus who has access to the secrets.  Those kinds of concerns are beyond the scope of this video, but if you're worried about that, then what you need to look into is called a secret manager, like AWS secret manager or hashycorp vault.  Docker also has a built in secret manager, but in production, this requires the use of Docker swarm mode.  Moving on, this is enough to run a database, but we need our backend to actually connect to it.  For that, we'll use the motor library, which we need to add to our pie project.tummel and requirements files.  I just installed it in my local environment and then used pit freeze to update their requirements.  Then in the code, I made a few simple changes.  Firstly, we'll grab the connection string from an environmental variable, create the motor client, and get the to-do's collection.  Then we update our to-do models.  Our to-do item now uses new IDs for the ID field, and we use this underscore ID alias because underscore ID is what MongoDB uses as a primary key.  Then we had to update three endpoints to actually use MongoDB.  The changes are pretty straightforward.  We just swap out our list operations for MongoDB, insert, find, and delete operations.  We also create a.env for the backend to pass that connection string.  This first MongoDB is the protocol.  Then root an example is our username and password, and this second MongoDB is the host name of our MongoDB container.  Just to reiterate, because we're using Docker compose and the MongoDB service was named MongoDB in the compose file, that's what allows us to use the host name MongoDB here and have it be directed to the other container.  The port 27.07 is MongoDB's default port that it listens on.  Then we go ahead and add that.n to our compose file as well.  Lastly, we have one tiny change we need to make in the front end because we change using underscore ID instead of ID.  Add in that underscore so that delete work properly and we should be set.  We're ready to rebuild.  And just like that with one command, Docker compose up.  We now have a front end backend and persistent storage in a database, all in one command.  Let's check it's all up and running on local host again, refresh.  Let's add some items, ABC, sleep, and code.  Then let's go back to our terminal and Docker compose down to kill everything.  And Docker compose up to start it all again.  And refresh the page.  It's all still there.  We can delete items and add new ones just like nothing happened.  And the best part is, a collaborator can clone this project, run Docker build, Docker compose up.",
        "number": 19
      },
      {
        "title": "More compose, adding mongo express to explore the db",
        "start_time": 2709.0,
        "end_time": 2821.0,
        "text": " And pro tip during development, I recommend using Mongo Express to easily explore your database.  Just add it as another service in your compose file.  It exposes a web interface on port 881 and create a Mongo Express folder with a.nv so we can pass environmental variables to it.  It needs the connection string to the underlying database.  And then a username and password for its own interface.  Docker compose down and Docker compose up.  Then visit local host on 881, put in root an example, which we're from the config.  And now we've got a convenient way to explore our database.  Here's our to-do list database with the to-do's collection.  And we can see our three to-do items, sleep code, and continue.  Being able to actually view your database in a development setting makes debugging a lot easier because you can just go in,  see the actual data and even edit it right here.  Back to the compose file, you may wonder about the order that containers start up in.  In particular, some containers depend on others being available.  For example, when our backends starts up, it immediately tries to connect to the database.  But what if the database container hasn't started yet?  Docker has this depends on key, where you can specify for each service, which other services need to be started first.  Then Docker will make sure that the containers start in an order where nothing is started before its dependencies.  This can be convenient in a pinch, but I don't really recommend this option.  I'm much more in favor of writing your code in a way that works regardless of the startup order.  Often by having services use timeouts, retries, or ping your dependencies to see if they're ready before continuing with normal startup.  In this compose file, none of the services actually require the others to be started first because they all internally have timeouts or retries built in.",
        "number": 20
      },
      {
        "title": "How to publish Docker image to Docker Hub",
        "start_time": 2821.0,
        "end_time": 2976.0,
        "text": " While Docker is incredibly useful, even just for local development, at some point you may want to share the images that you create.  Either to a public repository for everyone to benefit from or to a private repo, probably just to use within your company.  This is done through what's called an image registry, which is a service that hosts Docker images.  The default and most popular image registry is Docker Hub.  The process for publishing is actually pretty simple.  Make sure you have an account with the registry you're using and create a repository for your project.  I just created this public demo script repo under my username.  Then tag your image, log into your registry, and push.  You can either put the image including tag in your Docker compose, or you can tag the image manually using Docker tag.  Even though I don't have to, I like the specified Docker.io out front just to remind myself that pushing this image goes to Docker Hub.  If you use another registry like one hosted by your cloud provider, change that Docker.io to your registry.  Keep in mind that you can tag a single image with as many tags as you like.  This is how a lot of really popular images work like Nginx.  Currently, Nginx, Nginx 127, Nginx 127, 0, and Nginx 127, 0 Bookworm all point to the same image.  There's no hierarchical structure to tags.  The Nginx team literally just tagged the same image with a bunch of different tags for your convenience.  You can do the same thing with your tags, although personally I prefer to tag every image with a single tag that's specified.  It's full version and never change what image a tag points to.  I already built this image and note that Docker compose build will tag the image with whatever you put here.  Then we need to log in.  If you're on Linux, there are a few hoops you need to jump through because Docker uses the pass password manager to store your credentials.  So you need to set that up first.  First, you need a GPG key which you can generate with GPG generate key.  Then copy this and do pass in it and paste that in.  Then you can log in either from the CLI using Docker login or directly in Docker desktop.  Then use Docker push, specifying the image and tag you want to push or use dash dash all tags to push all tags associated with the Nginx.  Looks like the upload succeeded. Let's go back to our repository and refresh.",
        "number": 21
      },
      {
        "title": "Deploying Docker containers in the cloud",
        "start_time": 2976.0,
        "end_time": 3029.0,
        "text": " And lastly, let's talk about deployment which is a whole beast of its own.  You don't actually ever need to deploy your containers if you don't want to.  It's perfectly fine to use Docker as a local development tool only or as an easy way to install and run specific versions of specific tools you need.  But suppose you do actually want to deploy your containers.  You can download Docker onto a server you control and manually pull and run your images, but that's not the typical way of doing it.  When it comes to deployment, the conversation very quickly turns to which paid cloud service provider offers the most convenient and affordable container running product for your use case.  There's no one right answer here and there are hundreds to choose from, so you're just going to have to do some extra research.",
        "number": 22
      },
      {
        "title": "Thanks",
        "start_time": 3029.0,
        "end_time": 3038.0,
        "text": " Thanks to my patrons and donors and as always, slap that like button in odd number of times.",
        "number": 23
      }
    ]
  },
  "https://www.youtube.com/watch?v=pZX8ikmWvEU_tiny": {
    "key": "https://www.youtube.com/watch?v=pZX8ikmWvEU_tiny",
    "basename": "Dr. Stacy Sims- Female-Specific Exercise & Nutrition for Health, Performance & Longevity",
    "local_audio_path": "c:\\Users\\happy\\Documents\\Projects\\obsidian-transcriber-service\\local/Dr. Stacy Sims- Female-Specific Exercise & Nutrition for Health, Performance & Longevity.mp3",
    "hf_compute_type": "float16",
    "metadata": {
      "audio_input": {
        "youtube_url": "https://www.youtube.com/watch?v=pZX8ikmWvEU",
        "audio_filepath": null,
        "audio_quality": "tiny"
      },
      "title": "Dr. Stacy Sims: Female-Specific Exercise & Nutrition for Health, Performance & Longevity",
      "tags": "andrew_huberman, huberman_lab_podcast, huberman_podcast, dr._andrew_huberman, neuroscience, huberman_lab, andrew_huberman_podcast, the_huberman_lab_podcast, science_podcast, stacy_sims, dr_stacy_sims",
      "description": "In this episode, my guest is Dr. Stacy Sims, Ph.D., an exercise physiologist, nutrition scientist, and expert in female-specific nutrition and training for health, performance, and longevity. We discuss which exercise and nutrition protocols are ideal for women based on their age and particular goals.\n\nWe discuss whether women should train fasted, when and what to eat pre- and post-training, and how the menstrual cycle impacts training and nutrition needs. We also explain how to use a combination of resistance, high-intensity, and sprint interval training to effectively improve body composition, hormones, and cardiometabolic health, offset cognitive decline, and promote longevity. \n\nWe also discuss supplements and caffeine, the unique sleep needs of women based on age, whether women should use deliberate cold exposure, and how saunas can improve symptoms of hot flashes and benefit athletic performance. Dr. Sims challenges common misconceptions about women’s health and fitness and explains why certain types of cardio, caloric restriction, and low-protein diets can be harmful to women’s metabolic health.\n\nListeners will learn a wealth of actionable information on how to improve their training and nutrition to enhance their health and how to age with greater ability, mobility, and vitality.\n\nAccess the full show notes for this episode: https://www.hubermanlab.com/episode/dr-stacy-sims-female-specific-exercise-nutrition-for-health-performance-longevity\n\n*Thank you to our sponsors*\nAG1: https://drinkag1.com/huberman \nMaui Nui Venison: https://mauinuivenison.com/huberman \nEight Sleep: https://eightsleep.com/huberman  \nWaking Up: https://wakingup.com/huberman \n\n*Huberman Lab Social & Website*\nInstagram: https://www.instagram.com/hubermanlab \nThreads: https://www.threads.net/@hubermanlab\nTwitter: https://twitter.com/hubermanlab \nFacebook: https://www.facebook.com/hubermanlab \nTikTok: https://www.tiktok.com/@hubermanlab \nLinkedIn: https://www.linkedin.com/in/andrew-huberman\nWebsite: https://www.hubermanlab.com \nNewsletter: https://www.hubermanlab.com/newsletter\n\n*Dr. Stacy Sims*\nWebsite: https://www.drstacysims.com \nBooks: https://www.drstacysims.com/booksandmore \nTEDx Talk:  https://www.youtube.com/watch?v=e5LYGzKUPlE \nBlog: https://www.drstacysims.com/blog \nInstagram: https://www.instagram.com/drstacysims\nX: https://x.com/summerstack \nYouTube: https://www.youtube.com/@DrStacySims\nFacebook: https://www.facebook.com/drstacysims\nLinkedIn: https://www.linkedin.com/in/stacy-t-sims-phd\n\n*Timestamps*\n00:00:00 Dr. Stacy Sims\n00:02:24 Sponsors: Maui Nui, Eight Sleep & Waking Up\n00:07:03 Intermittent Fasting, Exercise & Women\n00:12:50 Cortisol & Circadian Rhythm, Caffeine & Training\n00:17:25 Reps in Reserve, Rate of Perceived Exertion (RPE); Age & Women\n00:21:06 Pre-Training Meal & Brain, Kisspeptin\n00:26:45 Post-Training Meal & Recovery Window\n00:29:59 Sponsor: AG1\n00:31:48 Hormones, Calories & Women\n00:34:24 Women, Strength Improvements & Resistance Training\n00:39:10 Tool: Women & Training Goals by Age Range\n00:44:16 Women, Perimenopause, Training & Longevity\n00:47:14 Women & Training for Longevity, Cardio, Zone 2\n00:51:42 Tools: How to Start Resistance Training, Machines; Polarized Training\n00:58:23 Perform with Dr. Andy Galpin Podcast\n00:59:10 Menstrual Cycle & Training, Tool: Tracking & Individual Variability\n01:04:31 Tool: 10-Minute Rule; High-Intensity Training & Menstrual Cycle\n01:08:36 “Train Hard & Eat Well”; Appetite, Nutrition & Menstrual Cycle\n01:12:22 Oral Contraception, Hormones, Athletic Performance; IUD\n01:20:57 Evaluating Menstrual Blood, PCOS; Hormones & Female Athletes\n01:26:31 Iron, Fatigue; Blood Testing & Menstrual Cycle\n01:29:33 Caffeine & Perimenopause; Nicotine, Schisandra\n01:34:24 Deliberate Cold Exposure & Women, Endometriosis; Tool: Sauna & Hot Flashes\n01:42:19 Tools: “Sims’ Protocol”: Post-Training Sauna & Performance; “Track Stack”\n01:49:37 Women, Hormones & Sleep, Perimenopause & Sleep Hygiene\n01:52:54 Supplements: Creatine, Water Weight, Hair Loss; Vitamin D3\n01:57:21 Protein Powder; Adaptogens & Timing\n02:00:11 Pregnancy & Training; Cold & Hot Exposure\n02:06:19 Tool: Women in 50s & Older, Training & Nutrition for Longevity\n02:09:38 Tool: Women in 20s-40s & Training, Lactate\n02:12:18 Tool: What is High-Intensity Training?, Cardiovascular Sets & Recovery\n02:17:22 Training for Longevity, Cellular & Metabolic Changes\n02:19:30 Nutrition, 80/20 Rule\n02:23:30 Listening to Self\n02:26:00 Zero-Cost Support, YouTube, Spotify & Apple Follow & Reviews, YouTube Feedback, Protocols Book, Social Media, Neural Network Newsletter \n\n#HubermanLab #Fitness #Nutrition\n\nTitle Card Photo Credit: Mike Blabac - https://www.blabacphoto.com\n\nDisclaimer: https://www.hubermanlab.com/disclaimer",
      "duration": "02:28:37",
      "channel": "Andrew Huberman",
      "upload_date": "20240722",
      "uploader_id": "@hubermanlab",
      "download_time": "00:04:43",
      "transcription_time": "01:14:08"
    },
    "chapters": [
      {
        "title": "Dr. Stacy Sims",
        "start_time": 0.0,
        "end_time": 144.0,
        "text": " Welcome to the Huberman Lab podcast where we discuss science, science-based tools for everyday life.  I'm Andrew Huberman and I'm a professor of neurobiology and ophthalmology at Stanford School of Medicine.  My guest today is Dr. Stacey Sims.  Dr. Stacey Sims is an exercise physiologist and a nutrition scientist and a world expert in all things training and nutrition specifically for women.  In addition to working at Stanford and with numerous professional athletic teams, Dr. Sims has authored more than 100 peer reviewed studies on exercise physiology.  She has not only evaluated existing protocols for nutrition and fitness that are specific to women versus men, but she has also developed many new protocols that are now in practice with professional sports teams,  but that can also serve people who are generally interested in fitness and longevity and in doing so, the general public.  The tools that Dr. Sims shares with us today are applicable to fitness, to changing your body composition and to overall health.  Today we discuss how hormones and hormone cycles impact nutrition and fitness needs specifically in women of different ages.  We of course discuss the menstrual cycle, perimenopause and menopause, but also female specific nutrition and training as it relates to things independent of hormones.  For instance, we evaluate the evidence that women may not want to train fasted and the reasons for that.  We talk about how training might vary according to different phases of the menstrual cycle, and we discuss how women can design nutrition and training programs that are optimized for their specific needs, not just because they are women, but because they are women of a particular stage of life and women with particular goals.  As you'll soon see, Dr. Sims is exquisitely skilled at explaining the human universal of nutrition and training, that is the things that do not differ between men and women and their needs in terms of nutrition and training.  But she is also exquisitely skilled at highlighting the data showing that there are specific areas of nutrition and fitness for which women and men differ and women have specific needs.",
        "number": 1
      },
      {
        "title": "Sponsors: Maui Nui, Eight Sleep & Waking Up",
        "start_time": 144.0,
        "end_time": 423.0,
        "text": " Before you begin, I'd like to emphasize that this podcast is separate from my teaching and research roles at Stanford.  It is however part of my desire and effort to bring zero cost to consumer information about science and science related tools to the general public.  In keeping with that theme, I'd like to thank the sponsors of today's podcast.  Our first sponsor is Maui Nui Venison. Maui Nui Venison is the most nutrient-dense and delicious red meat available.  I've spoken many times before on this and other podcasts and with several experts, guests on this podcast about the fact that most of us should be seeking to get about one gram of high quality protein per pound of body weight every day.  Not only does that protein provide critical building blocks for things like muscle repair and synthesis, but also for overall metabolism and health.  Maui Nui Venison has an extremely high quality protein per calorie ratio so that you can get that one gram of protein per pound of body weight easily.  And without ingesting an excess of calories. Also Maui Nui Venison is absolutely delicious. I love their Venison stakes, their ground venison,  I love their bone broth and I love their jerky which is extremely convenient when you're traveling.  Those Maui Nui Venison jerky sticks have 10 grams of high quality protein per stick at just 55 calories.  While Maui Nui offers the highest quality meat available, they're supplies are limited.  Responsible management of the access to your population on the island of Maui means that they will not go beyond harvest capacity.  So signing up for a membership is the best way to ensure access to their high quality meat.  If you'd like to try Maui Nui Venison, you can go to Maui Nui Venison.com-Huberman to get 20% off your membership or first order.  Again, that's Maui Nui Venison.com-Huberman.  Today's episode is also brought to us by 8 sleep.  8 sleep makes smart mattress covers with cooling, heating, and sleep tracking capacity.  Now I've spoken many times before on this podcast about the critical need for us to get adequate amounts of quality sleep each night.  One of the best ways to ensure a great night's sleep is to control the temperature of your sleeping environment.  And that's because in order to fall and stay deeply asleep, your body temperature actually has to drop by about 1 to 3 degrees.  And in order to wake up, feeling refreshed and energized, your body temperature actually has to increase by about 1 to 3 degrees.  8 sleep makes it incredibly easy to control the temperature of your sleeping environment.  By allowing you to program the temperature of your mattress cover at the beginning, middle, and end of the night.  I've been sleeping on an 8 sleep mattress cover for well over 3 years now, and it has completely transformed my sleep for the better.  8 sleep recently launched their newest generation pod cover, the pod 4 Ultra.  The pod 4 Ultra has improved cooling and heating capacity, higher fidelity sleep tracking technology,  and it also has snoring detection that remarkably will automatically lift your head a few degrees to improve your airflow and stop your snoring.  If you'd like to try an 8 sleep mattress cover, you can go to 8 sleep.com-Huberman to save $350 off their pod 4 Ultra.  8 sleep currently ships to the USA, Canada, UK, select countries in the EU, and Australia. Again, that's 8 sleep.com-slash-Huberman.  Today's episode is also brought to us by waking up.  waking up is a meditation app that offers hundreds of guided meditation programs, mindfulness trainings, yoga knee jurisdictions, and more.  I started practicing meditation when I was about 15 years old, and I made a profound impact on my life.  And by now, there are thousands of quality peer-reviewed studies that emphasize how useful mindfulness meditation can be for improving our focus, managing stress and anxiety, improving our mood, and much more.  In recent years, I started using the waking up app for my meditations, because I find it to be a terrific resource for allowing me to really be consistent with my meditation practice.  Many people start a meditation practice and experience some benefits, but many people also have challenges keeping up with that practice.  What I and so many other people love about the waking up app is that it has a lot of different meditations to choose from, and those meditations are of different durations.  So it makes it very easy to keep up with your meditation practice, both from the perspective of novelty.  You never get tired of those meditations. There's always something new to explore and to learn about yourself and about the effectiveness of meditation.  And you can always fit meditation into your schedule even if you only have two or three minutes per day in which to meditate.  It's a really like doing yoga needra, or what is sometimes called non-sleep deep rest for about 10 or 20 minutes, because it is a great way to restore mental and physical figure, without the tiredness that some people experience when they wake up from a conventional nap.  If you'd like to try the waking up app, please go to wakingup.com slash Huberman, where you can access a free 30-day trial.  Again, that's wakingup.com slash Huberman to access a free 30-day trial.",
        "number": 2
      },
      {
        "title": "Intermittent Fasting, Exercise & Women",
        "start_time": 423.0,
        "end_time": 770.0,
        "text": " Dr. Stacey Sims, welcome.  Thanks.  Our podcast, and I put out a lot of content about nutrition, fitness, cold exposure, heat exposure, hydration, topics that are very near and dear to your heart and for which you have a ton of expertise, but for which you have an extra degree of expertise as it relates to females specifically.  Yeah.  So I'm excited to talk to you today because very often I will get questions in the comments section on social media or on YouTube.  Was this study done in both men and women?  How does it differ for men versus women and on and on?  And I rarely, if ever, have answers, but you have answers.  I have answers for you.  Great.  So just to kick things off, because this is a question I get really often, fasting.  Oh, yeah.  Intermittent fasting.  Yep.  We need to distinguish between the two, of course.  Perhaps the most common question I get as it relates to males versus females is is intermittent fasting or time restricted feeding as it's sometimes called an eight hour feeding window, a six hour feeding window, a ten hour feeding window.  Is that something that perhaps differs in terms of its impact and how well it works for men versus women?  Yeah.  That's a short answer.  Great.  Yeah.  So I'll put some parameters around it.  Right.  So if we talk about intermittent fasting, that's where you have like the 20 hour non feeding window or you're holding a fast until noon or after.  And then we have time restricted eating and that's the fancy way of saying normal eating where you're having breakfast and then you stop eating after you don't have anything after dinner.  Right.  So you're eating with your circadian rhythm during the day.  If we look at intermittent fasting where you're holding the fast up till noon or you're having days of really low calorie restriction, we see an active women is very detrimental.  And unless you have PCOS or you have some other subclinical issue.  And the reason for that is we as women have more oxidative fibers.  So we hear about all the things about fasting to be to improve our metabolic flexibility, to improve telemedia length, to improve parasympathetic activation.  But by the nature of women having more oxidative fibers, we are already metabolically more flexible than men.  Interesting.  Yeah.  Didn't know that.  Could you elaborate on more oxidative fibers what that is and how it relates to metabolic flexibility?  Sure.  So oxidative fibers are our muscle fibers that are more aerobic capacity.  So those are the ones that you can go long and slow for very long period of time because it uses a lot of free fatty acids.  You need a little bit of glucose in order to activate those free fatty acids.  So when we look when a woman starts to exercise, she goes through blood glucose first and then gets into free fatty acid use.  She doesn't tap so much into liver muscle glycogen, which is, I think, another misconception that happens.  So when we're talking about fasting or fasted workouts, trying to improve that metabolic flexibility, it increases stress on the woman.  And so when we're talking about overall stress, we're talking about cortisol increase and they can't hit intensities high enough with no fuel.  So to be able to invoke the post exercise responses of growth hormone and testosterone, which then drop cortisol.  So from an overall stress perspective that fasted workout and holding that fast for a long period of time increases cortisol.  But then when we look from like a hypothermic point of view and we're looking at how the brain reads it.  So we know that there's one area of kiss pepton neurons in the brain for men, but there are two for women.  So the two areas are distinct where one controls appetite in lutonizing hormone and the other one is looking at estrogen and thyroid.  So if you start having an exercise stress or a daily stress of getting up and going on with your day without fuel, you perturb those kiss pepton neurons and downregulate them.  And so when you start downregulating them, we see that after four days you have a dysregulation of thyroid.  We have a change in our lutonizing hormone pulse, which is really important to maintain endocrine function.  And we'll hear this, oh, I've been fasting for so many years and it does great for me.  But the other side of the question is, well, how much better would you be if you were to actually pay attention to your circadian rhythm and fuel according to the stress at hand.  Knowing that you're going to garner less stress that way and if we're really tying in nutrition according to that profile instead of following a fast.  We see better brain improvements as well.  We see more cognitive function. We see less thyroid dysfunction.  And overall, women does much better when we're not in that fast at state than when you look at population research that's coming out now.  They're showing in both men and women who hold their fast till noon and then have an eating window from noon to maybe six p.m.  Have more obeseogenic outcomes than people who break their fast at eight and finished their eating window by four or five p.m.  So it's coming back to the chronobiology of we need to eat when our body is under stress and needs it.  We have a specific issue like obesity, inactivity, PCOS or other metabolic conditions.",
        "number": 3
      },
      {
        "title": "Cortisol & Circadian Rhythm, Caffeine & Training",
        "start_time": 770.0,
        "end_time": 1045.0,
        "text": " Super interesting. Two questions.  Is there a protective effect of starting the eating window?  And here I'm asking for both men and women starting the eating window at say 11 a.m. or noon and ending it a little bit later.  So not a six hour eating window or seven hour eating window but extending that to eight or nine p.m.  Under those conditions, do you still see the obeseogenic effect?  Yes, because we're looking at the way cortisol responds, we know cortisol has lots of fluctuations throughout today.  And it peaks about half an hour after you wake up.  So if you're having that cortisol peak half an hour after you wake up, you're not eating.  Then that is that higher baseline sympathetic drive for women.  For men, it's not the same.  So when we're looking at that obeseogenic outcome, the actual timing hasn't been tested yet to see how can we expand or contract that eating window for men.  But for women because of that cortisol peak that right after waking up, women tend to be already sympatheticly driven.  So then they walk around more tired but wired and have a really really difficult time accessing any kind of parasympathetic responses down the way.  Where if you have something really small where you're bringing blood sugar up, then it's signaling to the hypothalamus.  Hey, yeah, there's some nutrition on board. Then we can start our day.  So again, it has to look at that circadian rhythm and those hormone fluxes, which people don't really either understand or talk about because all of our hormones flux to the day.  And so you have to look at where's the peak of cortisol.  How does estrogen flux? How does luteanizing hormone flux?  And all of these things that have this tight interplay.  And the more we're doing the hormone research and the more we're understanding these perturbations and how important it is to fuel for it to stay out of any kind of low energy availability stands.  Regular listeners of this podcast will know this, but just to remind everybody a sympathetic state has nothing to do with emotional sympathy.  It's the sympathetic arm of the autonomic nervous system, which drives more arousal and alertness.  And at higher levels stress, sometimes called the fighter flight response, parasympathetic being the other arm of the autonomic nervous system, sometimes called the rest and digest arm of the autonomic nervous system.  They work sort of like a seesaw or a push pull, pick your analogy. In any case, it sounds like intermittent fasting or time restricted feeding.  Unless it's very well aligned to the circadian rhythm is not going to be advantageous for women.  That's what I'm hearing. I'm also hearing that if a woman trains while fasted. So in the non-feeding window, so wakes up, maybe has some hydration and trains.  That's going to further exacerbate the stress response in a way that's not going to be good.  Exactly.  And I have to imagine that if she also is drinking caffeine in order to do that training, because caffeine is a stimulant of the sympathetic arm of the autonomic nervous system,  that it will further exacerbate all these issues.  So this is an eye opener for me because I've had female training partners for years. I don't eat until 11 am.  I like to hydrate and caffeinate before I train in the morning, and then I like to eat starting around noon.  Several of them have hopped on that schedule with me. Some of them eat breakfast for some of them don't. They do as they choose, of course.  But now I'm thinking that's probably the worst way to go.  And it gets worse as you get older because if we're seeing as women are getting into perimenopause, which is in their 40s,  and we have more fluctuation of those hormones and increase in baseline cortisol anyway,  then when you look at fasted training, it increases that cortisol drive and that sympathetic drive.  And because it's at a point where you really need to polarize your training to get any kind of body composition change,  not having any fuel before high intensity work out, put some in moderate intensity.  They just can't hit the intensies they need to. Same with resistance training, like you go in and a lot of women are now working on  RPE or rating perceived exertion, where you go in and say, okay, we need you to hit an eight on the squat.  So you have two reps and reserve in a session RPE of an eight.  Well, if they're not fueled, then we're seeing trends that they're missing around 2 to 5% of that top load.",
        "number": 4
      },
      {
        "title": "Reps in Reserve, Rate of Perceived Exertion (RPE); Age & Women",
        "start_time": 1045.0,
        "end_time": 1266.0,
        "text": " Let's get started interrupt. Let's get people up to speed on RPE because this is a term that's trying to circulate more outside the physical.  Training community into the broader kind of recreational exercise or community, which I consider myself part of.  Me too now.  I mean, I train regularly in half for years, but I'm not an athlete.  I don't get paid to train and so forth.  So reps and reserve perceived effort.  It would just explain this.  I think probably 95% of our listenership has never heard these terms.  Okay, so if we're talking about reps and reserve, this is when you go in and if you say eight means you have two reps and reserve.  So you finish your eight and you should be able to complete two more with a really good form and then you hit failure.  So eight repetitions in good form and the person doing the exercise could in theory.  If they really dug in there, their teeth could complete two more repetitions in good form before hitting failure.  The inability to move the weight anymore in good form.  Exactly.  Okay, but they're stopping at eight so they have two reps in reserve.  Exactly.  And so we can correspond that with your rating perceived exertion.  So for saying, we need you hit an eight on our scale of one to ten of rating perceived exertion.  We see correlates with that eight with two reps in reserve.  So it's a way of quantifying what you're doing in the moment for squat or deadlift or some other really heavy lift that you're trying to accomplish.  As opposed to looking at say percentage of one repetition maximum saying you're going to move 70% of your one repetition maximum for six repetitions.  Seems like that's a great thing as well.  But it's a little bit more complicated because you need to know your one repetition maximum doing one repetition maximums can be dangerous if you're not skilled in that,  especially with compound movements like squats and deadlifts.  Okay, so is there an across the board recommendation for most people that they should generally train their sets in good form to failure to leave a couple reps in reserve.  What do you suggest for let's say women but this could also pertain to men.  And then that also depends on the age of the woman.  So we're looking at the reproductive years so you know 20 to 40.  Then it doesn't matter so much.  You can periodize pretty much how normal periodization works with your mesocycles and your microcycles.  So you're looking at what you're doing across the few months.  What are you doing in the week are you lifting heavy power based training.  But when we start to get to Perry menopause and we're losing all the flux of estrogen.  And estrogen is the woman's testosterone, the key driver for strength and power.  We have to look at lifting heavy.  So this is where we really turn women on to.  We want you to do something that is two reps in reserve, three reps in reserve.  Because your one rep max also changes depending on what kind of training block you're doing.  So you're finding that when you're talking about reps in reserve then it allows people to lift more on the day.  So we can get women to get into that strength and power based type training.  Rather than going let's lift to fatigue because then it might be 20 reps.  And that 20 reps doesn't invoke a big central nervous system response, which is what we want.  It's more of that hypertrophy and muscle tearing.  You will gain some lean mass, but not as much strength as if you were to invoke that central nervous system response.  And that becomes really critical as women get older because we need to find that external response.",
        "number": 5
      },
      {
        "title": "Pre-Training Meal & Brain, Kisspeptin",
        "start_time": 1266.0,
        "end_time": 1605.0,
        "text": " Interesting.  Lots to talk about in terms of exercise, but before we move on.  If the bad situation is a woman fasting, drinking caffeine and training intensely, but as you told us not as intensely as she would be able to otherwise.  What's the solution I imagine that solution involves ingesting some fuel?  What is a good example of a, you know, a pre-training meal.  If you will, and we could put some variation on that for people with different, you know, tendencies towards omnivore vegan or whatever.  But what is the timing of that meal relative to training that works best or and I'm assuming there's some flexibility there.  Yeah, I mean like I'm the kind of person gets up and is out the door within a half an hour to go do whatever I'm going to do.  So it's not like I'm going to fall me.  I've heard of like you.  Yeah.  I mean, meaning I tend to move slowly in the marketing system.  I wish I could, but the way my life is, it doesn't work that way.  But I'm also one of the people that never really has an appetite to 11 o'clock.  Okay, so we're similar in that way.  Yeah.  So how do you, how do you square that?  So I make a double espresso at night and I put some almond milk and a scoop of protein powder in there.  So the almond milk is sweetened, and usually it's unsweetened, but sweetened for the carb.  And then the protein powder for the protein because if I'm going to go do an ocean swim.  Then I need some carbohydrate and protein on board.  If I'm going to just go to the gym, then I'll probably just have the protein powder in the coffee.  Yes, I'm caffeinating, but I'm also getting the calories for the hypothalamus and getting more circulating amino acids.  Abby Smith Ryan out of UNC did some specific work looking at carbohydrate protein before and, you know, strength or cardio.  And found that if you're going to do a true strength training session, you only need around 15 grams of protein before you go.  To really help you get into the idea that yes, you have some fuel on board and also increases your post exercise oxygen consumption or your epoch.  So you're resting metabolism stays elevated, giving you better chance for recovery post exercise as well.  If you're going to do any kind of cardiovascular type work up to an hour, then you're adding 30 grams of carbs to that.  So it's not a lot of food and it's not a full meal.  Other people are like, I'm starving right before I go training, then yes, you can have your meal giving yourself about half an hour before.  But it doesn't have to be major food that we're talking about.  But that's just enough to bring blood sugar up and stimulate the hypothalamus to say, yeah, there's some nutrition coming in.  And then you have your real food afterwards. You have your breakfast afterwards within 45 minutes.  As a neuroscientist, I find it so interesting that at least some of what you're talking about with this pre workout meal and perhaps most of it relates to how ingesting those calories impacts the brain protects those kiss peptin neurons.  We'll talk more about kiss peptin, very interesting peptide.  As opposed to saying, okay, you need X number of calories because you're going to burn X number of calories.  Which is a very different conversation.  Here what we're talking about is the neural aspects of being able to generate intensity also blunt cortisol and get the most out of training without putting the body into kind of an emergency state.  And the longer someone with holds food after exercise and the greater they stay in that catabolic or breakdown state, the more the brain proceeds it is being in a low energy state.  So the first thing to go is lean mass when you start telling a woman that, you know, if you're going to do fast at training and and or you're going to delay food and take afterwards.  Why you training because the first thing that goes is lean mass and is a really, really hard for women to put on lean mass.  So when you start really nailing that and then saying, look, you just need 15 grams of protein to really help and be able to conserve that lean mass.  It's a small simple fix people try it and they're like, oh my gosh, I feel amazing.  So small little things when you're working with the whole system because I get tired, especially around Christmas time when you're reading all the magazines.  It's like two cookies means you have to walk for 30 minutes on the treadmill.  It doesn't it doesn't correlate like that at all.  So that's why I was like, I hate the calorie conversation because it's just not applicable.  Right and it has its own kind of elements of being laced with neuroticism about calorie counting and then that can drift easily into the realm of eating disorders.  I did an episode about eating disorders some years ago and as I was researching that episode, I learned that people with eating disorders.  Women and men, especially inorexia, become like calorie calculators.  Their eyes and their brain just are constantly evaluating the caloric load of food and it can be obviously very intrusive.  It's also the most deadly of all the psychiatric conditions.  So it's a long way from hopefully what we're talking about here, but there's the opportunity for drift whenever talking about calorie counting in and out.  We of course believe in the laws of thermodynamics and calories in calories out, but I love what you're describing here as getting the brain in a mode that the brain and body are protected so that one can invest in that high intensity exercise and get the adaptations that one wants but not send everything down this pathway of.  And just becoming a computer of, you know, how much of my exercising, what did I burn, what did I earn?  It's crazy. It's crazy.",
        "number": 6
      },
      {
        "title": "Post-Training Meal & Recovery Window",
        "start_time": 1605.0,
        "end_time": 1799.0,
        "text": " As long as we're talking about food and food intake relative to training, what is the suggested post-training window in which one should either avoid or make sure they get nutrition.  Meaning how long does one have after let's say a resistance training session of about an hour seems to me that's what most people are doing if they're investing in resistance training.  Maybe plus or minus of what 20 minutes.  Yeah.  And they're hitting those high intensity sets where they have maybe just one or two repetitions in reserve, maybe going to failure on a few of those sets.  What do you recommend women eat after they train?  So we know that women who are in the reproductive years need around 35 grams of good protein, high quality elicine oriented protein within 45 minutes.  And we see that women who are perimenopausal onwards are 40 to 60 grams because we become more anabolicly resistant to food and exercise as we get older.  When we look at like the recovery window for food, there are definitely sex differences because we hear all the conversation of there's no recovery window, it's you know it's old science.  But we look at the research of when women's metabolism's come back down to baseline meaning that they have constant straight blood sugar level versus men women it's within 60 minutes and for men it's up to three hours.  So when we're looking at the data that says there's no window per se for getting food and it's based on male data.  So when we're looking at women we have this tighter window to stop that breakdown effect and start the reparation.  So yeah it's like when we're talking about the protein intake it's really important not only to get that losing content up in the muscle to start the reparation or repair.  But also again to signal that yeah we're in a building state we're not holding that catabolic state and increasing all the repercussions that come with it.  So women should try and get 30 or as much as 40 maybe 50 grams of protein depending on their age post training within an hour of training.  Yep.  Men seem to have a longer window that can wait an hour two hours maybe even three hours before ingesting protein what about carbohydrate.  Look at mixed but for men it's more important because they go through their liver muscle glycogen so much faster than women.  So when we look at women we want to get around point three grams per kilo of carbohydrate within two hours of finishing.  So we look at protein people like well that's a big dose of protein how do I get it all in it's like yeah well you can look at how we mix all these things you're also getting carbohydrate in with that.  So that's why I say you could have your next meal after your training session and yeah there's a time and a place for protein supplementation but if you're getting that real food and then you're also getting.",
        "number": 7
      },
      {
        "title": "Sponsor: AG1",
        "start_time": 1799.0,
        "end_time": 1908.0,
        "text": " As many of you know I've been taking AG1 for more than 10 years now so I'm delighted that they're sponsoring this podcast.  To be clear I don't take AG1 because they're a sponsor rather they are a sponsor because I take AG1.  In fact I take AG1 once and often twice every single day and I've done that since starting way back in 2012.  There is so much conflicting information out there nowadays about what proper nutrition is but here's what there seems to be a general consensus on.  Whether you're an omnivore, a carnivore, a vegetarian or a vegan I think it's generally great that you should get most of your food from unprocessed or minimally processed sources which allows you to eat enough but not overeat.  Get plenty of vitamins and minerals probiotics and micronutrients that we all need for physical and mental health.  Now I personally am an omnivore and I strive to get most of my food from unprocessed or minimally processed sources but the reason I still take AG1 once and often twice every day.  Is that in ensures I get all of those vitamins, minerals, probiotics, etc.  But it also has adaptogens to help me cope with stress.  It's basically a nutritional insurance policy meant to augment not replace quality food.  So by drinking a serving of AG1 in the morning and again in the afternoon or evening I cover all of my foundational nutritional needs.  And I like so many other people that take AG1 report feeling much better in a number of important ways such as energy levels, digestion, sleep and more.  So while many supplements out there are really directed towards obtaining one specific outcome,  AG1 is foundational nutrition designed to support all aspects of well-being related to mental health and physical health.  If you'd like to try AG1, you can go to drinkag1.com slashhumanin to claim a special offer.  They'll give you five free travel packs with your order plus a year supply of vitamin D3K2.",
        "number": 8
      },
      {
        "title": "Hormones, Calories & Women",
        "start_time": 1908.0,
        "end_time": 2067.0,
        "text": " At some point there was a lot of discussion about training-fasted burns more body fat.  I think now most people accept that that's not the case that perhaps the percentage of fat as fuel is increased when one trains fasted.  But that overall in terms of loss of body fat, it doesn't matter if you train fasted or you train fed.  Correct.  Okay, I think that can't be stated enough by experts like you.  That doesn't mean that if one prefers to train fasted or with a minimum of food in there got that they can't do that.  I like to train fasted, but what I'm hearing is that women should probably ingest at least some protein, high quality protein,  and maybe drink the protein in a protein shake.  Form if they don't want ingest solid food.  Yeah, I think the easiest way for people to understand the basic idea of what low energy is and how this affects men and women is when we are looking at a tipping point for indecrindis function.  For men we're seeing that tipping point at 15 calories per kilogram of fat free mass for women's 30.  So when we're looking at baseline calorie needs before you really get into that indecrindis function.  When you're looking at those parameters, you can see why men do better in a fasted state or low calorie state.  But for women, our intake, and especially our carbohydrate needs are so much higher because we have so many other functions that are reliant on that kiss peptin, abrelation or downrelation preferably abrelation.  So when we're just talking the basic calorie needs and what we're seeing, it's that dichotomy right there of 15 to 30.  And when you start telling people that they're like, oh, okay, I get it.  Is that a biological aspect?  It's like, well, you could trace it all the way back where men went out to get the calories and most tribes and the women were home and it wasn't advantageous to be pregnant under low calorie intake.  That's why you have dysfunction when the calories are too low.  But, you know, you can also feed forward to modern day now and you're seeing that all this deterrence of hormone and the way we regulate hormone across the circadian rhythm requires more calories for women than it does for men.  I know some men that basically don't eat all day and then eat one meal in the evening and they'll train in the morning.  That's inconceivable to me, just within an hour or so of training, I'm hungry.",
        "number": 9
      },
      {
        "title": "Women, Strength Improvements & Resistance Training",
        "start_time": 2067.0,
        "end_time": 2350.0,
        "text": " I'm a big believer in people, everybody getting ideally two or three resistance training sessions in per week and two maybe three cardiovascular training sessions per week.  That would be ideal.  One could potentially do more probably not a whole lot less before you run into long-term health issues that you could offset.  But I think most people can fit those in and I'm very likely delighted that nowadays there's such a push for women and men to resistance training.  That wasn't the case when I was growing up.  I recall taking my sister the gym for the first time and I think she was the only woman in the gym.  When we were in high school, except for a few female bodybuilders and she said,  well, I don't want to look like that and I said, well, don't worry, you're not going to look like that.  But now you go to a gym and women are lifting weights, men are lifting weights.  It's terrific.  I've seen the evolution.  When I was 16, one of my friends, brothers was a bodybuilder and he took us to the gym kind of like what you did with your sister.  And so both of us were like, well, we want to beat those guys.  So we got into weight training with him not to be a bodybuilder, but it's been like the paramount throughout all of my athletic career.  You see, I'd be the only woman on the lifting platform.  And now it's like, you have to wait because there's so many women on the lifting platforms.  I love it. It's great.  Yeah, it's awesome.  As I mentioned before, I've had female training partners and they kill it.  Yeah.  It's a lot of fun to have a female training partner also because not only is it cool to see the progress they can make really quickly,  which surprises them often.  You know, I think a lot of women think that, okay, it's going to require external injuries or it's going to, you know,  and what you pointed out that there are some barriers to women putting on mass quickly.  I think I've noticed that strength increases can come really quickly.  Yeah.  Why is that?  It's essential nervous system aspect.  There's a lot of, like, if we look at the culture of how a lot of us grew up and I'm saying us like 45 plus, right?  The women were all the 90 supermodels don't show muscle that kind of stuff.  So always been gravitated to cardio.  Even now, if you go to a gym and you're a new member, you're signing up for a new member.  And your woman, they'll say, hey, great.  Here's all of our spin classes and our box fit classes.  They're still doing that.  Yeah.  And there's a cardio vascular machines.  A guy comes in like, all right, how much do you want to put on?  Here's the lifting platforms.  All those, you know, the weight trainings at the back.  Starting to see a shift with boutique type gyms, but that's still the commonality there.  So it's still that little bit of taboo.  So when women start strength training, they haven't been exposed to that kind of central nervous system stress before.  And the whole aspect of getting the nerve and the seat of colon, which are a little vesicles that, you know, hold the ability for the nerve to actually stimulate the muscle fiber,  all that gets trained really quickly.  So the more that you train it and the more muscle fibers that are recruited for contraction, you see an increase in strength really rapidly.  And slowly building on that for increased muscle bulk, because it takes a long time for women to put bulk on.  Because the driver for strength training is that central nervous system.  So it's great when we see higher doses, more volume, we aren't seeing huge hypertrophy.  We're just seeing really good increases in strength.  Whenever somebody male or female is concerned about growing too big too fast, I always remind them that resistance training is unique among different types of exercise in that because of the blood flow to the muscle during the exercise session.  You get a window, a transient window, but a window nonetheless of what the hypertrophy could look like if you do everything else correctly in terms of recovery.  So provided that the size of the muscle during the training session is not a verse of to you.  You're okay.  You're good.  Which is unique among training.  It's not like when you go running, you get a sense of being much faster.  You actually did the opposite effect. You feel the burn in your lungs and the pain of hitting the wall of your limits.  And then hopefully if the adaptation takes place, then you can push past that next time.  But with resistance training, you get a literally a physical picture in a somatic feeling for what that hypertrophy could look like.",
        "number": 10
      },
      {
        "title": "Tool: Women & Training Goals by Age Range",
        "start_time": 2350.0,
        "end_time": 2656.0,
        "text": " So we've been talking about training, but we haven't really spelled out what you would suggest a novice.  Perhaps an intermediate resistance training cardiovascular training program would look like in broad terms.  I realize we don't have time here to get into all of the nitty grids you've written about the elsewhere and we refer people to those terrific resources and the show note captions.  What would you like to see women doing?  And maybe we can break up the age brackets because it sounds like this is something that is resurfacing again and again here.  Women let's say 30 in younger, women 31 to let's say 40.  And then let's say 41 to 60 and then maybe 61 in terms of how many sessions of resistance training per week is it whole body training, how many sessions of cardiovascular training.  And what sort of examples could it could you give?  Yeah, so if we're looking at that 20, 20 to 30 year old a lot of times I really try to get them to focus on the whole movement aspect first.  So we phase them in same with older women phase them in learn how to move learn complex movements so that when you are going in to do resistance training preferably three to four times a week.  You can look at moving well and it doesn't have to be a long period of time if you're doing to failure which works really well when you're younger to increase strength and a little bit of hypertrophy.  You're going to have to spend a little bit more time in the gym so it might be 45 to 60 minutes.  When we're looking at doing that four times a week you can add in a sprint interval training at the end of one of those to get that super high intensity.  You can look at putting in at the most two hit sessions from on separate days if you're training specifically for something.  So if I work with a lot of endurance athletes still and they're like well how do I fit it in it's like okay well we look at the quality and how that fits into your training.  So if you're training for a marathon you're training for a triathlon or other endurance stuff you can take that high intensity work and put it into your training program.  So ideally we look at three to four resistance training with really good movement when we're in the younger set with two high intensities.  When we start getting into our 30s we start having an eye to how are we actually doing that resistance training instead of just going and doing a circuit.  We're really focusing on let's do some compound movements let's look at doing some heavier work.  Let's look at how we are periodizing so we're having six week blocks and we're building on those blocks.  Because we want that base foundation so when we get to be 40 plus we can actually go and do our power base training.  If you're in your 40s you've never done resistance training at all then we take between.  Two weeks to four months to really learn how to move well because there's a higher incidence of soft tissue injury and overall injury as we get into our 40s because of perturbations of estrogen.  Ideally when we get there we're looking at that around three minimum three resistance training with compound movements.  And either one sprint interval or two sprint intervals and one hit and a week.  And just to remind people compound movements multi joint movements squads dead lifts chin ups rose overhead presses bench presses etc as opposed to isolation movements were only one joint this is moving.  Yeah and for everybody and all those age ranges that you describe.  Are you suggesting they train the same muscle groups three or four times per week or they do some sort of split where it's upper body lower body take a day off or upper body take a day off  Lower body take a day off whatever that might work for them.  Yeah what works for them if you're looking for short amount of time in the gym because of busy lives and you can split it.  If you're looking at okay well I can allocate an hour to an hour and a half in the gym then you can do total body with adequate rest.  The key when you're younger is working to failure.  The key when you're older is working heavy.  Yeah so when we're looking at working to failure we're trying to get more of that lean mass growth with strength.  When we get older because it's so difficult to put on lean mass we really want to focus on the strength component because that becomes more important when we're talking about longevity.  Because if you're looking at the strength component from a central nervous system standpoint we see it feeds forward into better proprioception.  Tenuation of cognitive decline and this is the other thing that you in neuroscience would understand the sex differences and things like dimension Alzheimer's.",
        "number": 11
      },
      {
        "title": "Women, Perimenopause, Training & Longevity",
        "start_time": 2656.0,
        "end_time": 2834.0,
        "text": " Even some interesting literature about emphasizing some unilateral movements as people get older not just dual limb movements or dual limb simultaneous movements you always want to train both side to body folks.  But so if I understand correctly younger women should train to failure try and generate strength and hypertrophy as women get older they should emphasize more strength training leave some repetitions and reserve a train heavier.  It makes so much sense what you're saying.  Because what we know about the nervous system as we age is that there's some atrophy or at least some weakening of neuromuscular connections and the upper motor neurons in the brain that control the neuromuscular connections in the spinal cord out to the muscle.  There's something really sticky about this idea in terms of longevity that I don't think anyone else has ever said no the thing about it is men age more in a linear fashion.  Whereas women we have a definitive point in our late 40s early 50s where all of a sudden things go to shit.  Where it's that perimenopausal state and I can't tell you how many emails and DMs I get in a day from women who are like I'm 46 or 47.  I'm putting on body fat I don't know what's going on I can't sleep and then we say it's perimenopausal like what is that and so when we're looking at perimenopaus it is a huge.  Change in the body because you're having less and less of your sex hormone circulating more and more and ovulatory cycles means no progesterone or very low progesterone.  You're having a difference in the pulse of your estradiol to those flatline aspects and because every system in the bodies affected by this is why you see more soft tissue injuries like.  You have the biggest things that women who are in their 40s are going to PT's about a frozen shoulder and planar fascia.  Is there two really indicative issues that are happening in perimenopaus?  So that whole section of mid to mid 40s to early 50s is a definitive aging point where I really try to get women to get into the heavy lifting and get into the patterns of polarizing in their training.  Not putting in emphasis on zone two just really looking at how my polarizing how my affecting my central nervous system so that when they get into that one point in time of that perimenopaus their bodies are already conditioned for the stress that's coming.  Whereas men we see that kind of stuff happens in their late 50s early 60s so the soft tissue injuries the change in body comp comes at a later time so yes looking at how we're scoping our strength training.",
        "number": 12
      },
      {
        "title": "Women & Training for Longevity, Cardio, Zone 2",
        "start_time": 2834.0,
        "end_time": 3103.0,
        "text": " For women who are not on hormone replacement therapy and we did a previous episode about perimenopaus menopaus and hormone replacement therapy but if it comes up again and again today that would be wonderful because these are important under discussed topics for women that are not on hormone replacement therapy.  Who decide to train heavier maybe do a bit more training volume not trained to failure they're making sure to not let their court is all spike too much by making sure they have some pre workout nutrition some post workout nutrition.  Would they be wise to be very careful in how much cardiovascular exercise they add to that meaning.  There seems to always be this risk of overtraining and as you pointed out for various reasons cultural reasons historical reasons around exercise.  I my observation is that most women sort of unless they know better default to cardiovascular exercise as opposed to resistance training.  So if a woman in her 40s late 30s to let's say 50 is doing two to four sessions of resistance training workouts per week and they also really like cardio or they feel they want to or should do cardio.  Should they be careful about how much cardio they're doing and is there a best form of cardio should they really emphasize the high intensity interval training should they avoid zone two we should probably also divine for people what zone two is if they don't already know.  So I am notorious for slamming things like orange theory and F 45 because they market specifically to that age group of women and it's not appropriate because it's not true high intensity work.  When we're looking at women who are really trying to maximize body composition change in longevity.  And unfortunately default to cardio because I think oh that's going to help change my body composition is going to help me lose body fat.  It doesn't.  Is this things like soul cycle as well?  Yeah.  I've never done any of these but I imagine there's a lot of spinning a lot of moving a lot of sweating and a lot of.  A lot of quote unquote calories burned emphasis yes there is but it's it puts women squarely and moderate intensity where they're so sticky leaving one of those classes feeling absolutely smashed.  That when you tell them actually that training doesn't work for you because it's putting you in a state of intensity that drives cortisol but it's not a strong enough stress to invoke the post exercise growth hormone and testosterone responses that we want.  To dampen that cortisol so this is why we have that hypervaly of women who are in their 40's plus shouldn't do high intensity work.  It's like well actually they shouldn't do moderate intensity they need to avoid that polarizing absolutely that's what we want we want true high intensity work which is.  One to four minutes of 80% or more or if you're doing sprint interval it's full gas for 30 seconds or less and you're doing that a couple of times a week you're not doing it every day because you need to have enough recovery to hit those intensities truly because those are the intensities that are going to give you those post exercise hormonal responses to drop cortisol.  When we're looking at women who are like oh well I love going out for hours and hours on my bike and I love you know doing my spend classes it's like okay but we need to look at the big rock here.  If you are looking for longevity and body composition change and cognition and all those things you have to polarize your training and that has to be the focus.  It's so food like I come up along background of endurance I now love riding my gravel bike on the weekends for long periods of time which is not optimal for me my age that kind of stuff for all the things that I want to see improvements in.  Mentally it's great so we talk about going out for that long stuff zone two is at low conversation in that's fine for mental health and being out nature.  But for optimal health and well being we don't want to do that we want to look at resistance training is a bedrock and true high intensity work.",
        "number": 13
      },
      {
        "title": "Tools: How to Start Resistance Training, Machines; Polarized Training",
        "start_time": 3103.0,
        "end_time": 3503.0,
        "text": " I have family members who are women who are thin because they love to walk and they just walk a ton and they well and enough.  They are resistant to resistance training and if they do pick up a weight it's usually some very light dumbbells do a few curls a couple tricep extensions and aren't really leaning into the higher intensity work.  I think this is pretty common and my observation is that it's common not because they couldn't be incentivized to do the higher intensity work but that.  Learning the complex compound movements like had a squat properly or even leg press properly deadlift properly can be a bit overwhelming especially when one walks into a gym.  This is true for men too like all this stuff all this equipment all these bodies and these people look like they know what they're doing it's like if I were to go into an advanced like kitchen or symphony and you know all these instruments I don't know how to play.  So what's the best line of attack for somebody who really wants to overcome this longevity barrier because clearly resistance training proper nutrition work and the cardiovascular exercise piece is a little bit more intuitive walking you do it faster your jogging you do it faster you're running.  The bike the soul cycle class etc it's just it's easier in terms of the mechanics one can still get hurt but it's just more straightforward.  Is there a way that in the absence of a budget for a personal trainer that somebody can learn how to do these movements and as you said ease into them over the course of even up to four months in a way that they can be confident that they're unlikely to get hurt and really build up their capacity to do real work like a benefit them.  So this is where I love technology for one thing but if we're staying really basic I look at some of my family members and I've gotten them started with just body weight stuff or loading a backpack with cans to add a little bit of resistance so they feel comfortable in their own house and they might be doing lunges or squats.  King them up of like where foot placement and knee and that kind of stuff so they're getting used to that kind of movement.  I love Kelly Staret's stuff with mobility so show them like here's how we do some of the mobility find where the sticking points are and then you can either direct them to some of the programs that are out there that.  Kelly happens has some really good ones for women or 40 plus so it is.  Bree and then sunny Webster down in Australia.  You can send in a video of what you're doing and he can critique you and tell you things to do there are other programs like that too.  So there's lots of ways of getting help if you seek it.  The personal trainer is very much a stumbling block for a lot of people.  And as much as I am not a fan of planet fitness I am a fan of the fact that they've made it really easy for someone to walk in who's interested in resistance training.  And they can go to a circuit one of the circuit things that they have the back and they can start resistance training on machines which is another level up to learning compound movements.  There's lots of ways of breaking that barrier to entry you just have to find the motivation factor of what's going to incentivize the person to give up their time walking every day and taking time to go to the gym or taking time to do garage based stuff that's going to improve their lean mass.  I'm a big fan of machines especially plate loaded machines but machines just.  Trade the close to correct or correct arc of movement.  Yeah.  So for your size.  Yeah.  Yeah, exactly.  And to really spend the time adjusting the seat height adjusting the various pins on the machine not just the weight in order to make sure that one gets the best range of motion.  I think this is something small but that is significant in terms of its impact people just plop down in a machine especially if you're working in with somebody.  And feel especially beginners will feel pressured to move quickly and they won't adjust the seat height and so it's just all wrong for them and all it takes is a little bit of time to you know and ask people you know how to adjust the machines.  I'm also a fan of kettlebells in the garage or like lighter dumbbells that you can do like thrusters or hand cleans or something like that to get them the momentum and movement feeling because that's another good learning curve for people.  So like I said, there's lots of ways that you can implement things based on someone's intuitive like or dislike of resistance training.  So you've mentioned polarized training. If I understand correctly this would be a woman doing three or four days of high intensity resistance training for 45 to 60 or 45 to 75 minutes per session and then at the opposite extreme.  Just walking a lot or jogging a lot. So that's that way you're talking about polarized training as opposed to these other forms of training where it's designed to get people sweating like crazy breathing hard for long periods of time but either putting them at the in the landscape of inducing muscle strength adaptations and hypertrophy adaptations nor really taxing the cardiovascular system enough to create you know an increase in longevity for instance.  When I talk about polarizing I look at the high intensity strength like that's really hard on the central nervous system and then we look from a cardiovascular standpoint of doing true high intensity work.  So the walking is more of the recovery. So if you're going to go out and do something long it has to be very, very easy.  If you are looking at cardiovascular and you want that big sweat then we are talking true sprint interval training. So what I have a lot of women do is a 20 minute lower body heavy set and then they'll go on the assault bike and do as hard as they can for 30 seconds.",
        "number": 14
      },
      {
        "title": "Perform with Dr. Andy Galpin Podcast",
        "start_time": 3503.0,
        "end_time": 3550.0,
        "text": " I'd like to take a quick break to let you know that the human lab team has launched a new podcast with host Dr. Andy Galpin.  Andy is an expert in exercise science and human performance and has long been a fan favorite on the human lab podcast. This new podcast is called Perform with Dr. Andy Galpin and it dives into topics such as how to build muscle and strength how to improve your cardiovascular health and how to optimize recovery and sleep for performance and much more.  Andy is an absolutely fantastic educator and true expert on all things human performance. I know you'll thoroughly enjoy his new podcast and learn a ton of useful knowledge from it.",
        "number": 15
      },
      {
        "title": "Menstrual Cycle & Training, Tool: Tracking & Individual Variability",
        "start_time": 3550.0,
        "end_time": 3881.0,
        "text": " Let's talk about the menstrual cycle and how that impacts training at the level of psychology and physiology meaning and of course the two are linked.  They're inextricably linked. For instance, is there a particular phase of the menstrual cycle where a woman should expect that motivation and or recovery would be more challenging?  So this is the sticky point of recent science because we see all these research studies and meta-analysis that are coming out of the sports science literature saying that there is no effect of the menstrual cycle on anything.  When you look at that population, it is specifically humaneric women might have a subject pool of 10 if you're lucky 12.  So this is women who have quote-unquote normal menstrual cycles humaneric supposedly ovulating. So they have a definitive low hormone and high hormone phase.  And this is probably because these studies are being done on university campuses with college undergraduate women.  Yes, exactly.  Which is a typically is in a given age range.  And they look at performance meaning that one point in time.  And we know that psychologically you can perform at any point in the menstrual cycle unless you have something like heavy menstrual bleeding.  When we're looking at a higher touch and looking not only from a molecular aspect but also pulling in mixed methods and looking at the qualitative,  we need women to track their own cycle and find their own patterns because we know that there are times where you feel like crap and you can't push intensity.  But that might be on day eight for one woman and might be day 18 for another.  From a molecular standpoint, we know that the low hormone phase being day one is the first day of bleeding up through ovulation, which is midway through your cycle.  You have a greater capacity for pulling in and accommodating stress physical mental stress.  So if we're looking at doing heavier loads, we're looking at doing high intensity work, we're looking at motivation.  Then that low hormone phase is really optimal for trying to hit a PR or trying to hit a new speed because you can take on that stress and your immune system handles it, your muscles handle it, your core temperature, everything handles it.  So for most women in the weeks before their period, they're going to feel more robust except right up until the point of menstruation or the inverse.  It is day one of bleeding up through mid cycle.  This sticky point comes not every woman ovulates and this is a thing when we're looking at general pop.  We have lifestyle stress, we have nutrition stress.  We know that women for the most part have four to five and ovulatory cycles a year.  So this is where when you're looking at that high hormone phase, we can't say you're definitively in the high hormone phase.  So this is where we need women to track their own cycles and understand their own patterns.  Because in an ideal world, we know that in the Ludio phase, this is where we have the most change where we have a prone flammatory response from the immune system.  We have inability to access carbohydrate as well.  We have a higher sympathetic drive, so there's lots of things in there that aren't so fantastic for accommodating stress.  So broadly speaking, the Ludio phase is associated with more cortisol, more kind of baseline levels of stress.  Would it make sense for a woman to try and offset some of that with a bit more nutrition during that phase?  A bit more perhaps complex carbohydrate, we know that some complex carbohydrate can blunt some of the cortisol response.  Maybe just even a little bit more attention to eating.  Absolutely.  I mean, core temperature goes up, but the whole goal of the Ludio phase is to build tissue.  So this is where we're seeing a lot of shuddling of carbohydrate and amino acids to go to build that endometrial lining.  And that's the whole goal.  So yes, you need to eat more protein, you need to eat more carbohydrate.  But again, the sticking point is, did you ovulate or not?  So if you aren't aware of if you ovulated or not, you're tracking your own patterns, then just be cutely aware that in about the week before your next period comes.  You really need to be amping up carbohydrate and protein.  Because that's going to help you hit intensities.  It's going to kind of level that playing field, especially on days where you feel like you can really hit those intensities.  You feel great.  But then you go to do something in your heart rates higher than it should be.  You don't feel that that you can hit those.  If you're offsetting it with some increased carbohydrate beforehand, you're going to hit it.  So it's again, it's really dialing it back down to the individual now because we don't have enough robust research.  To make generalized ideas because of the nuance of, have you ovulated or not?  What are your ratios of estrogen and progesterone in that Ludio phase?  So when we bring it back down to the general pop, it's like the best thing to do is to track your menstrual cycle over sleep over how you're feeling.  Find your own patterns and dial in your training in your days according to what your pattern is.",
        "number": 16
      },
      {
        "title": "Tool: 10-Minute Rule; High-Intensity Training & Menstrual Cycle",
        "start_time": 3881.0,
        "end_time": 4118.0,
        "text": " It depends on how she feels.  What we can't rely on are things like heart rate variability because we know that changes with the autonomic nervous system change of progesterone.  It's good indication that you've ovulated because you're heart rate variability tanks, but it's not a good indication of what your body can do.  If you wake up, I always say it's the 10 minute rule. You wake up and you feel awful and like I really want to do this workout, but I don't know how it's going to go.  Give yourself 10 minutes.  If after 10 minutes you can't hit those intensities or you just feel horrible, change it, drop it down, do something that's more recovery, do something that's not going to be so taxing because we do have a limited amount of that stress acumen of how much stress we can handle.  If you're going to try to exert it all in a high intensity workout, what do you have left over for the rest of the day?  And then that compounds because if you're always fighting it, then you're going to increase this baseline sympathetic drive because you're fighting the training your fighting life.  So give yourself that 10 minute rule.  If it happens three days in a row, that's okay because it's a very short period of time. It's not going to last forever.  So a lot of women have this internal conversation of, I have to do this and it's really based on some kind of external, they think everyone's watching them.  But internally, you don't have to.  If you give yourself permission, you end up training better, recovering better and getting better gains.  On the flip side, if a woman is feeling spectacularly good, should she just really push it as hard as she can?  Or is there anything about the relationship between the hormone fluctuations of the menstrual cycle and feeling really, really great that training hard can somehow disrupt the cycle?  And this is actually kind of the the old lower probably myth I would imagine that high intensity resistance training is somehow detrimental to female hormone cycles.  I don't think there's any evidence for that, but I hear that from time to time.  Why do you think that myth came to be? Why do you think it propagates and what can we do to extinguish it if in fact it's not true?  It's not true. We see it comes from a misstep and food intake.  And we also see that it's a cultural influence because we think about how sports started.  It started as a way for men to demonstrate how powerful and aggressive they are.  And this is the original Olympics, right? There were no women allowed. And as we feed forward into sport and how it became okay for women to be involved.  At the high performance level of women walks in and shows any fallibility, then she's immediately put on a lower stool, right?  You can't you can't play with the boys because you have a menstrual cycle, you're bleeding, you're a woman, you're a delicate flower.  So women would walk into that professional sport space and be excited if they were a men or a racer didn't have periods.  Or they trained hard enough in their period went away because then they were more like men and they could play with the boys.  If you start bringing up menstrual cycle in professional sport, now as of the past about four or five years, it's okay to talk about, which is you know what 2020.  So that myth of high intensity resistance training, causing issues with the menstrual cycle.  One, it's a cultural nuance for pushback against women being in that space.  But then the reality is women were eating enough to accommodate for that stress, which then feeds forward to low energy availability,  maybe relative energy deficiency in sport, perturbations in all of our menstrual cycle hormones.  So it's not the act of the high intensity resistance training.  It's the act of not fueling appropriately for it.  And then getting the okay to not have your period because, yeah, now you're in with your training hard enough, you've lost it, you're more like a man.  Wow.",
        "number": 17
      },
      {
        "title": "“Train Hard & Eat Well”; Appetite, Nutrition & Menstrual Cycle",
        "start_time": 4118.0,
        "end_time": 4349.0,
        "text": " Is it true then that if a woman maintains either caloric balance with her, basically eating enough to support her energy output,  or even a slight caloric surplus that it's unlikely that her periods will cease even if she's training very hard and very often.  Correct.  So it basically boils down to calories and calories out.  Fuel for the task at hand because some people want to have a slight caloric deficit even in high training.  And if that deficit is at night away from training, maybe 150 to 200 calories, then it's going to help perpetuate body fat loss, not lean mass loss, and it's not going to interfere with recovery.  It's the fueling in around the stress, meaning they exercise stress.  It's really important, but women have been so conditioned to not eat and not take up space to be small, you know, all of these socio-cultural things that women are afraid to admit the fact that they want to eat and they should be eating.  So this is a nuance within the fitness community that we're really trying to change and get the mindset around, you train hard, you eat well.  And your body response and kind.  Appetite body temperature and hormones are very tightly linked.  Yes, they are.  Far too tightly for us to disentangle all of those in a single conversation here.  But as you're describing the urgent need for women to fuel enough with the proper fuels, to train hard enough to stimulate the correct adaptations that they need.  I imagine that the shift in appetite and body temperature that occurs across the menstrual cycle is also going to play into this, meaning there will be phases of the menstrual cycle where women will be just naturally less motivated to eat.  Enough carbohydrate enough protein in order to get the most out of their training.  What phases of the menstrual cycle are those, so that women can pay particular attention to make sure that they're fueling enough.  As estrogen starts to come up right before ovulation that estrogen surgery really dampens appetite.  It also has an interplay with our appetite hormones, which is part of the reason why we don't have that great of an appetite.  It holds after ovulation estrogen dips eat hungry.  It comes up and people are like, I have some cravings which are driven by progesterone because your body needs more calories.  The same time with the elevation of estrogen, you're not hungry. You have cravings, but you're not hungry.  Interesting.  Yeah. So it's trying to disconnect those. It's like your appetite is something that will come back, of course, once you eat.  But cravings are more of a psychological capacity of, yeah, my body needs more, but I'm not quite sure what.  So to get women to understand what's happening across the board, it's always coming back to let's fuel appropriately for the exercise.  And even if you're not hungry, if you are fueling appropriately at that point in time, if you end up with less, at least you've stopped that breakdown state that catabolic state.  So we don't get those perturbations in the hypothalamus. That's my biggest concern for women is really taking care of that signaling from the brain to the rest of the body.  And if we have fuel on board, even though we have appetite perturbations, and if you go to a really hard workout in the heat, you're not going to be hungry either.  But if you're having a cold protein drink after that hot workout, you're taking care of that immediate need to shut down the signals that we need to break down things.",
        "number": 18
      },
      {
        "title": "Oral Contraception, Hormones, Athletic Performance; IUD",
        "start_time": 4349.0,
        "end_time": 4857.0,
        "text": " Yeah. And we need to define exactly what type of birth control we're talking about because there are so many different forms.  Yes.  There are IUDs, there are the copper IUDs, there's the ring, there's the, you know, let's talk about oral contraceptives that are designed to prevent ovulation.  So this is, quote unquote, the pill. So we're being, let's for now limit the conversation to that so that there is in confusion.  Share with us, if you will, your thoughts on these, how they impact any of the things that we're talking about or anything else from that for that matter.  Do we have another history lesson?  Please.  All right.  I just gave a talk at home to some young athletes on contraception because someone might be on the depot.  And if they're on it for more than two years, they get bone mineral density loss.  So then the question of, okay, well, how does the oral contraceptive pill come up? How does that affect things?  So like, well, let's look at the history of it.  Initially came from Sanford.  It was funded by Catherine McCormick from McCormick family and a feminist activist, Margaret Singer, but because they're women they couldn't get in the lab.  So they got a guy from Stanford to develop the pill.  And he's like, you know what?  We need to put in a placebo week so that women feel like they're having a bleed.  So if we're looking at the three active pills and then the one sugar pill week, it was by design to make women feel like they are having control over their menstrual cycle.  And they would still have a bleed.  But it's not a true bleed as a withdrawal bleed.  So this becomes the confusing point for people who are on an oral contraceptive pill that I give my period.  It's like, no, you don't.  Because the idea of the hormones that are in an oral contraceptive pill is to down-railate your ovarian function so that you don't oblate.  So you have a whole different hormone profile from someone who naturally cycles.  So this depends on the type of oral contraceptive pill you're using.  For the most part monophasic is the one that's most prescribed.  So that means the three weeks of the active pill is the same dose of estrogen, progesterone.  And then you have your sugar pill week or your withdrawal week and then you start again.  When we look at the repercussions of using oral contraceptive pill in active women, there's a higher amount of inflammatory responses and oxidative responses.  So from a training standpoint, no one's done the study yet, but I would be interested in doing this.  Of looking at how that impacts adaptation.  You do end up with a new baseline of this when you start taking the pill, but we're not really sure how that impacts adaptation.  We also look at the progestin component of the oral contraceptive pill because we have four generations of progesterone.  First generation was really high dose and has a lot of risk factors, not really prescribed that much.  Second generation is the most prescribed.  And this is the one that people just take.  It's in your IUD, it's in your O.C. has at least a amount of side effects.  And then we have a third and a fourth generation.  The fourth generation is primarily used for women who have really bad PMS or PMDD, which is your pre menstrual dysphoria disorder.  So significant mood issues because that progestin has a direct effect on a lot of the dopamine receptors in the brain.  As well.  The third generation is very androgenic.  So we see that in in some preliminary research that improves speed and power by the second week of intake because it's accumulated.  So we're looking directly at an oral contraceptive pill.  We can't make generalizations because you have low dose high dose estrogen.  We see that a 30 microgram dose increases hypertrophy but not strength because estrogen increases.  Increases the satellite cell aspect.  So for my power and Olympic athletes Olympic lifting athletes, that's a detriment because they'll put on muscle mass but no strength.  So we've had to look at changing their O.C. are getting them off for women who have breakthrough bleeding that higher incidence of or that higher intake of estrogen is is really beneficial.  So we look overall at how it impacts women from an athletic standpoint.  It's so variable in the hormone profile that we can't make generalizations.  We only look at the very high performance athletes and what's happening up there because that can make a break and athlete.  So from the general touch point, we don't know enough.  Like the beginning of this year, 2024, there was a study that came out looking at changes in the amygdala that happens with or a contraceptive use.  It's reversible in adults but for young girls, we don't know because the brain is developing.  And unfortunately, physicians will pass out O.C. as if it's candy.  O.C.s.  We're a contraceptive.  And do you recall what the direction of the effect was on the amygdala?  For those that don't recall the amygdala bilateral brain structure, meaning one on each side of your brain.  Literally means almond and laden.  It's almond shaped and it's part of a larger network associated with threat detection.  Sometimes it's described the locus of fear in the brain but it's involved in a lot of other things too.  The positive valence and negative valence, but nonetheless is part of the threat detection system elevated levels of arousal, which is why it's often discussed in the context of fear, anxiety, et cetera.  It increased fear in women who are on the O.C. or a contraceptive pill made them less willing to take chances.  And when they went off it, they're like, well, why couldn't I do that before?  So that's why they started looking at the amygdala.  And when I say we're looking at young girls, and again, we don't know what's happening.  Is it reversible in young girls that are put on it or not?  Because of the brain structure changes that are happening.  So when we talk about an oral contraceptive pill, I want people to understand that it has a significant effect on the body.  Not just reproductive. We don't know enough about all the other effects.  So I have parents who say, my daughter wants to go on the oral contraceptive pill. She's having irregular periods.  She's this athlete. We want to be able to control it.  And it's like, if there's a issue with your menstrual cycle now, it's going to be there when you get off it.  So we have to look and see what's going on here.  If you're looking to get on it to control your menstrual cycle, why?  Because we know that you can have an increase in your view to max.  And other anaerobic capacity when you are not on it.  So you have a better top incapacity when you're not being blunted by these hormones.  And then the other conversations, oh, my skin.  It's like, well, they have really good dermatologists that can help you with that.  You don't have to go on a normal contraceptive pill.  But unfortunately, GPs don't understand all of that.  And if a girl comes in and says, I'm having irregular cycles, heavy menstrual bleeding.  I want to go on the O.C.  There you go.  So it is a huge conversation still we had.  I put it in the same category as menopause hormone therapy.  Because there isn't enough research to address all the population needs.  And we see these big pendulum switches.  So before it was like, everyone beyond the O.C.  And now it's like, maybe not.  And then it was no one beyond menopause hormone therapy.  Everyone should be on it.  But we need to land in the middle and understand more of what's happening with these exogenous hormones.  Is there any evidence that other forms of female contraception can be,  let's just say, problematic for the types of things we're discussing today?  Like the implant in the depot?  Or IUD.  Copper IUD.  Copper IUD and the marina, or, you know, your projection-laced IUD.  Those are what a lot of my tactical athletes will use.  Because it doesn't have a systemic effect on adaptation or inflammation mood  any of those things.  And it's a fit and forget.  So you can put it in for up to three to five years.  If you have a really heavy bleeding, it really dissipates because the whole idea of an IUD  is that then the endometrial lining.  And so then you have a topology that takes care of the endometrial lining.  So you don't necessarily have a bleed.  The copper IUD is different because you do have really heavy bleeding for the first three",
        "number": 19
      },
      {
        "title": "Evaluating Menstrual Blood, PCOS; Hormones & Female Athletes",
        "start_time": 4857.0,
        "end_time": 5191.0,
        "text": " Before we got started today, you mentioned some very interesting pioneering studies on  evaluating menstrual blood itself as a window into some larger themes about what's going on  physiologically, even psychologically.  Now might be a good segue.  Just touching to that, we can always return to it again later.  But let me just ask it more directly.  What are some things that can be measured directly from menstrual blood that are informative  for women.  And it sounds like there's a new generation of at home.  Tests that might be interesting and informative for them to think about.  Yeah.  Well, if you think about menstrual fluid, everyone thinks about it as a discard product.  But it's a very good indicator of what's happening from an endocrine standpoint.  It gives a really good indication of what's happening from an endometrial standpoint.  So if you're looking at all of the cytokines and the proteins and the tissue that comes from it,  it's a huge indicator that's naturally discharged that we're now looking at for determining HPV.  Do you have it or not?  What about proteins for PCOS?  Can we really identify PCOS or endometriosis?  We talk about PCOS for a moment.  Most people have heard of it by now.  But polycystical variants and Germans associate with typically elevated endrogens.  It's becoming more and more common or perhaps detected more based on better detection methods.  I don't know which.  The prevalence of PCOS seems to be very, very high.  It does.  And I think it's a combination of both.  We also see some rebound PCOS that happens when someone gets off the normal contraceptive pill.  It's not necessarily true PCOS because what's happening now, your overrease are producing eggs.  That have been down regulated for so long.  So under ultrasound it might look like PCOS, but it's not necessarily true indication.  The other is more and more women are starting to eat more.  And so they're coming out of low energy availability.  We have more carbohydrate.  You end up with greater folliculose stimulation, which also shows up as PCOS.  So the true PCOS, yes, there is a high incidence from a reporting standpoint.  But is it that rebound where it's not having all the under genetic changes?  That's still kind of up in the air at the moment.  But it is a big concern for women because it is an indication that something's going on and they might have some fertility issues.  We see a really high incidence of PCOS in Olympic level athletes because of the higher end genetic aspect of PCOS.  So better recovery time, a little bit higher baseline testosterone.  So yeah, it's a population specificity as well.  In the 80s and 90s, there was a lot of excitement in the kind of neurobehavioral endocrinology field.  Largely based on animal literature.  But then expanding into human literature that certain forms of activities could change hormone patterns and maybe even psychology.  And that makes sense on the surface of it.  But is there evidence that if somebody engages in say high intensity training or competitive scenarios?  This has been explored a lot in men, but I'm wondering if it's also been explored now in women.  That endrogens go up.  I mean, there's been these studies.  I don't know how good they are of people on the stock exchange watching their stress fluctuations measuring testosterone.  I think most of those studies were done in men.  But other competitive scenarios, even showing, for instance, that exogenous testosterone can increase altruism in men if men are competing for who's like donating the most money at a philanthropic event.  But you put them in a different scenario where it's far less benevolent and in goal.  And then they'll exogenous testosterone drives competitiveness towards things that are more traditionally thought of as male, male competition.  In other words, it's all context dependent.  Is there anything that has springs to mind of interesting studies as it relates to endrogens or estrogens in women athletes and as it relates to exercise?  They haven't done any specific studies like that in women.  We do see that under stress, the cortisol increases.  And if you have an adequate response to it and your body can overcome it, then yes, you get a boost in testosterone for women.  We see this in a lot of the night mission shift changes in tactical athletes.  There is also a, I guess, a lessening of circulating estrogens.  So the pulse changes when we start getting to the end of a really strong training block.  Because we're starting to have a little bit of a downregulation of our loopenizing hormone pulse and estrogen.  But it shouldn't be severe enough to cause menstrual cycle dysfunction.  What we want people to do is look at the ratio of their estrogen, progesterone,  and keeping track of loopenizing hormone.  If they're at that point where they are going to have a really big training block.  So we like it preseason during season end of season.  And people who might be at a higher risk factor for becoming a minority act, then we keep track that way.",
        "number": 20
      },
      {
        "title": "Iron, Fatigue; Blood Testing & Menstrual Cycle",
        "start_time": 5191.0,
        "end_time": 5373.0,
        "text": " As we talk about menstruation, we should probably talk about iron stores and iron.  Yeah.  Do women need to supplement iron, given that they lose iron during menstruation?  It's interesting because we have a change in hip-seat and hip-sit in, depending on which part of the world you come from.  Because it is increased under times of inflammation and decreased under times of iron loss.  So we see a significant change across the menstrual cycle.  So I tell women if you are concerned with low-fairton, then we want you to take an iron supplement every other day,  starting at the first day of your bleed for 10 days.  Because that's going to really allow your body to absorb it and stay on top of it.  After that, every other day, yeah, but you're not going to be absorbing as much of it.  Because hip-sit-in starts to come up after ovulation again.  You have a pro-inflammatory response.  So you have greater inflammation.  Do women blanket need to supplement?  No.  Because we see fatigue isn't necessarily just iron-related.  There are so many other reasons why women are fatigued.  The one problem is the baseline levels for, like, fairytale.  For active women, if you go in and you have a fairytale level of 20 to 25, they're going to say it's normal.  But we'd rather see you up around 50.  So if you are in that low end of normal, then supplementing will help you get up into that 50 and see if it makes a difference.  If a woman is going to get a blood test to evaluate testosterone, estrogen, lipids, metabolic factors, et cetera,  and she can only afford to do that at one point during her cycle.  And compare at various times, maybe every six months or once a year, even at that specific time of her cycle,  is there a best time in cycle to do that blood test?  If I'm limited to say that, then I would say five to seven days before her next period starts.  So mid-Ludial.  Because then you get a good indication of estrogen-progesterone peak.  Testosterone doesn't fluctuate as much as those two.  So you're going to get a good idea of what baseline testosterone is.  And we know that there's a greater inflammatory response.  So anything that's outside of the norm of that upper elevation of inflammation, you're going to be able to pick out.  So yeah, I would say if you could only do it at one point in time, that would be the time to do it.  And if she can add a second blood test at a different phase of the menstrual cycle, where would you place that second test?  Day two of the menstrual cycle, second day of bleeding, to get a really good indication of what your true estrogen level is at baseline.  And if she measures her hormones at those two times within the cycle, do you think that's sufficient to get 75% plus of the relevant data?  Yeah, definitely.",
        "number": 21
      },
      {
        "title": "Caffeine & Perimenopause; Nicotine, Schisandra",
        "start_time": 5373.0,
        "end_time": 5664.0,
        "text": " Caffeine.  Yes.  In the old days, meaning when I was a kid and not long ago,  three weeks ago, we would hear that he's crazy statements about caffeine.  It pulls calcium out of the bones.  You know, you'd hear this stuff.  I did a whole episode on caffeine.  I'm a big fan of caffeine, but I do warn people that if they suffer from anxiety or they're going through a particularly stressful life, then it can raise the activity of the sympathetic arm of the autonomic nervous system.  You'll feel more nervous.  You're more prone to panic when you're drinking caffeine.  But many people love caffeine.  I think 90% of the adult population of the world in just some form of caffeine every single day.  I'm in that 90% now.  Likewise, making it the most consumed drug worldwide is caffeine safe for women.  I suspect, based on what you just said, that the answer will be yes.  But are there case conditions where women should be cautious about their intake of caffeine independent of this anxiety thing?  I mean, people probably shouldn't drink more caffeine than they can tolerate psychologically.  No one, male, female, the younger old.  Yeah.  It's more of a genetic factor than it is a sex factor.  So, I mean, both men and women will be fast metabolizers, slow metabolizers, or not having effect.  That becomes the bigger rock of them.  What we do find is in that perimenopausal state, women will become more sensitive to the blood sugar fluctuation.  The blood sugar fluctuations that happen with caffeine.  So, they're used to having coffee in the morning, and with something, then halfway through their workout, they become a little bit hyper glycemic.  Because there's changes in insulin sensitivity, insulin responses.  So, there's changes also in blood sugar control, and caffeine can exacerbate that.  So, if you are someone who's like, oh, I always have a double espresso before I go work out.  And then halfway through, I'm really hyper glycemic.  I'm really dizzy and lightheaded.  I don't know what to do.  Feel sick or nauseous.  Yeah.  Eat some food.  Eat some food with it.  What about sipping caffeine through the workout?  You know, taking that coffee in and just having a sip between sets.  Can that offset some of that?  I don't think so.  Okay.  I hear a lot that people who drink caffeine before work out midway through, like, I don't feel good.  Yeah.  For me, that just stimulates the desire for more caffeine.  But we're even, dare I say, a half piece of nicotine gum, which I experimented with.  But I was told, and this is why I'm not going to continue to do it.  Not only is it very habit forming, it actually is such a vasoconstrictor that I was told by a dermatologist that it's terrible for skin.  Even if you're not getting your nicotine by smoking vaping, dipping or snuffing.  So this big trend now toward ingesting nicotine as a stimulant and cognitive enhancer and performance enhancer.  I think people should at least be aware of the negative effects on skin.  Never would have known because I'm not a nicotine person.  I'll tell you that half piece of nicotine gum is the first time you do it.  It's an unbelievable experience.  It's like your first real cup of coffee.  Oh, really wakes you up.  And dials you in, I recommend nobody do it because it feels that pleasant if you like caffeine.  I like Shashandra for that reason.  Shashandra.  Yeah.  What's Shashandra?  It's an adaptogen.  You should know what this is.  You should know what this is.  No, well, I'm here to learn.  Okay.  Shashandra.  Shashandra.  Yeah.  So it is an adaptogenic plant.  So, you know, like ginseng.  So I be arranging macca.  Ashaganda.  All those buzzwords out there.  Shashandra is another really well-studied adaptogen.  And I have friends who say it's like Adderall.  Or you take it and it's immediate focus and function.  Because it's main goal is to regulate dopamine, serotonin and cortisol.  So it gives you women and men out of that brain fog.  It gives them incredible focus.  Do you use it?  Yep.  Are you on it now?  Okay.  You just sent people down the rabbit hole.  The rabbit hole.  Yeah, yeah.  You heard it here first.  Doctor Stacey Sims.  I'm going to give it a try.  Because the nicotine thing is an interesting one.  And there are some cognitive enhancing effects of nicotine that perhaps in people 65  and older might actually be beneficial for offsetting some forms of neurodegeneration.  But that needs to still be explored and researched.  Don't cut that and clip it and point it out there like so.  That's happened already.  Very interesting.  All right, caffeine we both agree is great.  Shashandra.  You got a try.  Check it out.  Let me know.",
        "number": 22
      },
      {
        "title": "Deliberate Cold Exposure & Women, Endometriosis; Tool: Sauna & Hot Flashes",
        "start_time": 5664.0,
        "end_time": 6139.0,
        "text": " We'll do.  Cold.  Yeah.  For reasons I still don't understand.  People have associated me or this podcast with deliberate cold exposure.  I like deliberate cold exposure in the form of a cold shower or a cold plunge or  an ice bath.  Mostly for the effects that occur afterwards.  I mean, more alertness, kind of semi euphoric buzz that goes on a long, long time.  No, I don't think it increases metabolism significantly enough to have a meaningful difference.  But the long lasting increases in the so-called catacolamines, dopamine or up in  effort and an effort and an effort to me are pretty impressive.  And I just like the way it makes me feel.  So that's the main reason I believe why people do deliberate cold exposure.  And every time I do a post about deliberate cold exposure, I get asked, understandably so.  How does it affect women differently than men?  And then I usually get questions about renotes syndrome.  Oh, yeah.  Yeah.  So is there a difference in terms of how deliberate cold exposure impacts women?  I have to imagine the answer is yes, given what you said earlier about phase of  constriction versus phase of dilation.  But deliberate cold exposure.  Like it, hate it.  What do you think?  Do you recommend it for women?  I recommend it for open water swimmers who might experience a vagal response when they first dive into the cold.  I prefer heat for women.  Everyone's a responder to the heat.  You better adaptations.  It's a sauna.  Yep, sauna.  Hot tub.  Yeah, preferably a true Finnish sauna.  And for red doesn't, it warms the skin but not the core.  Well, thank you for saying that.  I'm not a big fan of infrared sauna.  Doesn't get hot enough.  No.  Yeah, you can bring an infrared light into a traditional sauna if it can tolerate the heat.  Yeah.  But Finnish sauna would be what?  Something between a hundred and eighty five degrees Fahrenheit and maybe  two ten if you're really heat adapted.  Yeah, I'm still working on metric.  Let me do the conversion.  Oh, sorry.  Yeah, you're living down in New Zealand.  Yeah, so 60 to 80 degrees.  I need to look.  Every time I've tried to do math on the fly on this podcast.  I know.  It's like, okay.  Time's nine divided by five plus three two.  Yeah.  So people can look it up.  Yeah.  Okay.  Look it up.  So the thing with cold water exposure is the whole conversation about ice cold ice baths  and how cold it is.  It's too cold for women.  Because we're looking at that severe immediate jump into that icy cold.  It causes such a severe constriction and shut down.  So women do really well and get that whole dopamine response and everything.  If the water is around 16 degrees C, which is 55 to 56 degrees Fahrenheit.  Which is chilly.  It's chilly.  It's not warm.  No.  This go dive in.  San Francisco Bay.  Right.  And that is enough to offset that severe constriction survival.  But it is cold enough to invoke all of the changes that we want with cold water exposure.  So it's a temperature nuance.  That's that's a difference.  And like I said, when I have open water swimmers who are going to do a long swim or they're  going to do a triathlon and the water is colder.  I have them do cold water exposure, especially face exposure into the cold water.  To get them habituated to that initial severe constriction and sympathetic activity that we don't want to  happen before a race.  With heat being the truth like true heat that we're talking about with sauna.  We see a lot of metabolic changes for women.  So we're having better insulin and glucose control.  We're seeing a better expression of our heat shock proteins and the uncoupling and the  rebuilding of those proteins that are cardiovascular responses.  And for women as we get older and have the offshoot of hot flashes, night sweats.  That kind of stuff.  If you're doing heat exposure, you're sending a stronger stimulus to the hypothalamus.  And you're also getting a better serotonin production from the gut.  Because we have 95% of our serotonin produced from the gut.  Which leads to better temperature control and shuts down hot flashes.  Like some people might be confused by the idea of using sauna in order to reduce the hot flashes.  So I'll just remind people that your brain has a set of neurons in the medial pre-optic area that sort of a thermostat.  If you will controlling core body temperature and if you heat the surface of your body,  your medial pre-optic neuron say, oh, let's cool down the core of the body.  Now if you stay in that heat too long, you'll tuck your body to core body temperature.  We'll go up.  But conversely, if the surface of your body is made cold, the internal milieu of your body will heat up,  because those medial pre-optic neurons will say, oh, you know, this is like putting an ice pack on the thermostat,  which is what graduate students and postdocs used to do in the lab side,  working because it was a battle over the heater, right?  Some people were in hot, some people were in cold, so it was always this visit in any event.  So it's not that you disapprove of using deliberate cold exposure.  You just recommend that women do deliberate cold exposure with temperatures that are maybe in the low-50 degree  Fahrenheit range as opposed to the really, frankly, just painfully cold for anybody, you know,  38 to, you know, 50 degree temperatures.  Yeah.  We did a pilot study looking, because Wim Hof has been down to New Zealand quite a bit,  and so, you know, his breathing and ice bath stuff has been making the rounds,  and working in the high performance, people wanted to do that.  But we have few athletes that have a really severe endometriosis.  It's like, well, we could look at using cold exposure to help control that.  And what we found over the course of this study was that if we were to do deliberate cold exposure around  ovulation and then hold it for 10 days, over the course of three menstrual cycles,  it attenuated the endometriosis.  Because endometriosis is an inflammatory disease, right?  So we're looking at inflammation process and growing the tissue.  If we can dampen that inflammation and create a response that learns that information and dampens it,  then it helps with endometriosis.  So that's another avenue that we really want to take when we're looking at cold,  deliberate cold exposure.  Wow, fascinating.  As a cautionary note, if anyone is going to explore Wim Hof type methods,  please, please, please do not combine cyclic hyperventilation,  or hyperventilation of any kind with breath holds and water exposure,  not even in the depth of a puddle.  There have been drowning associated with people doing cyclic hyperventilation in various contexts,  not just related to Hof breathing, but basically people who are not skilled,  and even some who are skilled, combining cyclic hyperventilation breath holds and water in any form cold or warm water.  Just don't.  If you're going to do any kind of cyclic hyperventilation breathing in my labs,  actually published on this in a clinical trial, do it on dry land or don't do it at all.  And if you're going to do deliberate cold exposure, limit your breathing to slow, deep breaths,  make sure that you're well supervised and just stay alive, please.  Yeah.  We didn't incorporate any of the Wim Hof breathing.  We just incorporated the deliberate water cold water exposures.  Cold and temperature generally is such a potent stimulus,  and it's exciting that people are trying to explore this,",
        "number": 23
      },
      {
        "title": "Tools: “Sims’ Protocol”: Post-Training Sauna & Performance; “Track Stack”",
        "start_time": 6139.0,
        "end_time": 6577.0,
        "text": " One thing I suppose that we should discuss very briefly before we move on,  since we've been talking about resistance training.  We've been talking about deliberate cold exposure.  There is evidence that doing deliberate cold exposure,  not so much in the form of a cold shower,  but in the form of a someversion up to the neck.  Post strength or resistance training, say in the four,  but probably the eight hours after resistance training,  because of the attenuation of the inflammatory response,  which sounds like a great thing,  and it actually can inhibit some of the strength and hypertrophy gains  that one would otherwise experience.  So if you're going to do the deliberate cold exposure,  that's to not do it in the eight hours or even on the same day,  after resistance training geared towards developing  strength and hypertrophy increases.  No problem to do it first.  In fact, maybe even some performance enhancing effects of doing it first.  There's some athletes that stand for doing that,  but just want to throw that out there.  So anything else you want to add to that?  Which is different from heat exposure,  because heat exposure you want to do afterwards.  Because of isolation.  Yeah, because it extends that training stimulus,  and also the passive dehydration from training  will stimulate greater blood volume improvements.  Oh, interesting.  So after a good weight training session,  if one has the luxury of doing it,  get into the sauna for up to 30 minutes.  Make sure you're hydrating.  You want slow rehydration, because part of it is that dehydration  and the decrease of oxygen at the level  that kidney stimulate more EPO.  So with more red cell production,  you have natural increase in plasma volume,  so it's a blood volume expander.  Oh, so now we're getting into real performance enhancement.  Is this true for men and for women?  Yeah.  Let's walk through this protocol,  like this is not been discussed on this podcast.  So somebody does their resistance training,  finishes up drinks eight or 16 ounces of water  with a little salt in it maybe,  and then hops in the sauna.  Yep.  For how long?  Up to 30 minutes.  Okay.  No longer.  No longer.  No longer.  They'll probably be a little bit thirsty in there.  You're looking for a low level dehydration.  Is that right?  Yep.  Okay.  The ranges that I've seen published in the finished studies  are, as I recall, and I'll double check these numbers,  186 degrees Fahrenheit up to about 210 Fahrenheit,  and the higher end only being for those that are heated-apted.  Yeah.  One can cover their head with a towel and actually feel more comfortable  because the brain is insulated.  The surprises people, they think putting something on their head  would make it excessively warm,  but you actually are protecting your brain  from some of the heat.  And people will put a towel over so that they,  when they breathe, it doesn't burn  the inside of their nose and their mouth either.  I'm always like, if you're going to be in  and it's that hot, just move down a level.  Yeah.  And this stimulates the production of more red blood cells.  Okay.  Which then translates to what in terms of athletic performance.  You have an increase in your cardiovascular effort  and because you have a greater amount of blood volumes,  you have a greater amount of pretty much blood circulating.  So you have more available for muscle metabolism, heat loss.  So it's akin to going to altitude.  So people will go to altitude to get that blood volume boost,  but not everyone responds to altitude,  because you have responders, non-responders,  responders.  Okay.  This is why when I go to Colorado, I'm gasping for air while I do a walk,  and then I come back to sea level, and I feel better.  My endurance is better, but some people might not experience that effect.  True.  This is telling the guys before we started that I've been in our sauna at home,  in preparation for going to Park City,  because I live at a beach town,  and going to Park City, I am a significant responder to altitude,  and I won't be able to have coherent meetings at altitude,  if I am not adapted.  Okay.  Yeah.  So this explains why when I've gone to meetings in Colorado  at altitude, some people can have a drink that first night,  and they're perfectly fine,  even though they normally live at sea level,  and I'm trying to try to see the stairs correctly,  even though I don't drink.  Yeah.  That would be it.  Very interesting.  So you can use post-resistance training,  sauna exposure to improve performance.  Yeah.  You can use it post-cardio as well.  So anything that is giving you that passive dehydration from training,  because you will become passively dehydrated when you're training,  right? You can't keep in as much fluid.  So I'm saying passive as in,  you're not able to stop that dehydration.  And then you go in to the sauna,  and you are extending that training stimulus,  because your heart rate is elevated,  you're putting your body under stress from dehydration,  and the body responds in kind of,  we need more blood volume.  So let's jump start that.  I love it, logically, watertight,  and I'm going to give it a try.  Yeah.  What other training tricks tips do you have up your sleeve,  Dr. Sims?  What you want to talk about?  Do you have any favorites besides I delight in these,  and I know other people will as well.  Do any come to mind?  I mean, you've taught us about Shashandra,  about post-training sauna exposure,  to improve performance by increasing red blood cell count.  Is there anything else that can bring to mind?  No, no, no pressure.  I'm a fan of what I call the track stack.  That we used to use for track athletes,  but then for really significant high intensity work.  So track stack is kind of the idea  from the old body building set,  where you're taking 200 milligrams of caffeine,  low dose baby aspirin,  but then I add beta alanine.  You used to be a fedron.  I know.  So I'm old enough to remember when they would sell it,  as the triple stack with a fedron,  but some people dropped dead,  and they took it off the market.  Yeah.  It came back on the market in New Zealand last week.  Yeah.  It gets you going.  Yes, it does.  It's speedy.  Yeah.  It's dangerous.  Yeah.  But the track stack,  which has beta alanine,  and not effidrin,  is really good at encouraging an extra top end effect.  Because you're having the caffeine,  you're having a little bit of the blood thin  from the aspirin,  and the vasodilatory properties,  and the carnesine aspect  for muscle contraction from the beta alanine.  And so training for gravel races in the top end sprint,  you do a couple of sprint sessions with that,  and it's increasing your training stress during the training,  so your adaptation is to that higher stress.  Should anything be done in terms of recovery  to make sure that you offset that additional stress,  that's achieved with this track stack?  Yeah.  Just making sure that you're not stacking.  Two days in a row of high intensity work,  like really making sure that you're recovering well,",
        "number": 24
      },
      {
        "title": "Women, Hormones & Sleep, Perimenopause & Sleep Hygiene",
        "start_time": 6577.0,
        "end_time": 6774.0,
        "text": " About sleep.  We hear so much these days about the importance of sleep.  For mental health, physical health, performance.  I think this is a great thing, a great trend.  Are there female specific requirements for sleep?  That vary across the menstrual cycle,  and or by age or just generally?  Do men and women need to think about the need for sleep differently?  Yeah. Part of it is the obvious,  like when you're talking about sleep temperature,  women and men have variations in their sleep temperature  and what's optimal.  So looking at that,  you need to create an environment for you  that is cool, comfortable,  which is probably going to be different from your partner  who might be sharing your bed.  So that becomes a sticky point.  We talk about the menstrual cycle.  There are definitive changes in sleep architecture.  We're seeing that in around the mid-Ludio  to the pre-menstrual.  So you know that about 10 days before your period starts.  Significant change in your slow-wave sleep.  There's less of it.  Latency is increased,  so you have a longer time to get to sleep  and you have more light sleep.  So overall, you know, less of that deep recovery sleep.  And this is where women tend to have more of their mood issues too,  because of estrogen's play was serotonin in the brain.  So we really need to nail down our sleep hygiene in that time period.  So looking at things like elthianine and  apigenine and looking at your room temperature  and the screens and all the things that you've talked about  most part about sleep and sleep hygiene.  Super important.  And then of course, as you get older,  in both men and women it comes more difficult to sleep.  But we see a significant issue with insomnia  in women who have really bad hot flashes  and significant menopausal symptoms.  And again, this has to do with lots of the perturbations from temperatures.  A night sweats increase sympathetic load.  Not being able to get into a parasympathetic state.  So this is where working with a specific sleep specialist,  might come into play.  We can also look at using some adaptions,  the rodeola stacked with CNN.  And looking at the cold temperature,  getting people to use the non-sleep deep rest  or yoga needra or some other kind of  meditative property that they can then access  when they're in bed.  So there's a lot of different things that we have to be aware of.  And again, in that parasympathausal state,  we see that significant change in sleep and sleep architecture  and quality of the sleep,  but men don't have the same thing.  So women have to be a little bit more aligned  with what's happening from a hormonal profile standpoint  because it does definitively affect  serotonin melatonin and sleep architecture  because of the interplay that estrogen has  on the brain and the receptors.  It makes very good sense.  We'll put a link in the show on our captions  to some zero-cost non-sleep deep breast yoga needra  because we've put out a couple with my voice  if you prefer another voice.  I'm a big fan of the ones by Kelly Boys  who's contributed to the waking up app.  It also has terrific non-sleep deep breast yoga needra",
        "number": 25
      },
      {
        "title": "Supplements: Creatine, Water Weight, Hair Loss; Vitamin D3",
        "start_time": 6774.0,
        "end_time": 7041.0,
        "text": " You mentioned a few supplements,  the inine,  apigenin, which is chemo-minal extract.  Maybe let's just have a general conversation  about supplements.  What's your fought-on supplements?  How do you place them into the landscape  of nutrition?  They are after all supplements and replacements.  But the word supplements I believe  is a little bit misleading  because there are food-based supplements  like a protein powder.  There are supplements designed to achieve  a specific outcome and then there are supplements  that are designed to be a more  support for a bunch of things,  a kind of insurance policy.  What are some of your favorite supplements  in any of those categories,  specifically for women and perhaps  even specifically during certain phases of the menstrual cycle  and or perimenoposmenopos.  I just threw about nine questions of you.  Okay, the number one is creatine.  Creatine for women doesn't matter what age.  It's really important we're seeing a lot for brain mood  and actually gut health.  So five grams of creatine monohydrate per day  sort of to go through five?  Three to five?  Yep.  Preferably, of course, creature  because the way it's produced.  So if you're looking at creature,  it's the German company that produces it.  Use a water-based wash to produce the creatine.  Interesting.  Whereas others use an acid-based wash  and we see a lot of side effects with the acid-based wash.  Like gastric, just right?  Yeah.  So people are like, oh, I'm really bloated  and I have nausea and stuff  from taking creatine.  Am I like, is it creature?  Actually, no.  It's like, switched to creature.  And so they switch and they're like, oh my gosh,  I feel so much better.  No, dude.  Yeah.  And then vitamin D3,  really important.  Especially when we're looking at all  the information that's coming out  from cardiovascular muscle brain,  everything that goes with vitamin D.  Also with iron.  So vitamin D is really important  for absorbing and maintaining iron stores.  So those are the two big ones.  And then...  Sorry, I just want to stop you from moment  as it relates to creatine.  I hear two general lines of concern.  One, I hear more often from women.  Minor standing is that because creatine  rings water into the muscle,  as well as supporting the phosphoric creatine  system of the brain.  The water into the muscle component means, yes,  people who take creatine three to five grams per day  will gain a few pounds of body weight.  That's solid body weight in the form of water  within the muscle.  So solid and air quotes.  It's water, but it's within the muscle.  So they should know that.  It's not a given though.  Interesting.  It's not a given.  There are some women on the lower dose of three  that don't experience the water gain.  Okay.  And this is not bloat like water,  subcutaneous water.  This is water within the muscle.  So it will be stored within lean tissue.  Okay.  And then I do hear concerns about creatine  causing hair loss.  My understanding is there is zero evidence for that.  There is a smidgen of evidence that it might increase  to hydrogestosterone levels.  But it's like one study marginal increase.  And then people linked to hydrogestosterone to hair loss.  And so then the conclusion people drew was that somehow  creatine increases hair loss.  But you're saying zero evidence.  No evidence.  We see that women who start taking it midlife  are complaining about it.  But it's actually a projection driven thing.  We see progesterone and fluctuation progesterone  can exacerbate any hair loss.  So if women are experiencing that and they're saying,  oh, it's creatine.  I've read all this stuff on creatine.  No.  It's not.  Okay. So we've got creatine D3.  A thousand I use per day.  Five thousand I use.  I guess it depends a little bit.  Yeah.  Being very close to Antarctica and the southern hemisphere  in the winter.  Very low sunlight exposure.  Looking around the 5,000.  Same with upper northern hemisphere, UK.  That kind of stuff.  Plus you get to the equator the less you need.  The one concern is like a day here,  where it's foggy and it's supposed to be sunny.  And people are like, great.  I don't, you know, don't have to worry about going out  in sun exposure.  But then the next day it's bright and sunny.  And they're like, oh, sunscreen.  So they put sunscreen on and not getting the right  sun exposure.  So then again, it is a lifestyle thing.",
        "number": 26
      },
      {
        "title": "Protein Powder; Adaptogens & Timing",
        "start_time": 7041.0,
        "end_time": 7211.0,
        "text": " Great.  Okay.  So we've got creatine vitamin D3.  What are some of the other supplements that you,  um, that you take or that you,  I don't know if we say suggest, but that you,  um, perhaps suggest women consider.  Yeah.  So protein powder really good high quality.  Because the amount of protein that women should be getting  is often difficult to eat.  Um, so again, supplementing, not using it as the main  stay.  Uh, that's one to consider.  And then again, I'm about adaptogens.  So looking at the different adaptogens.  Ashaganda is a good one.  Holy basil or Tulsi is another one.  Shashandra.  And then getting into some of your medicinal mushrooms.  Lines, Maine.  Rishi.  Those are the two big ones that I look to and often have women  use.  If these adaptogens.  Blunt court is all because certain ones do like Ashwaganda.  Which by the way, I do think people should cycle if they're going to  take it high doses.  Because there are some issues with liver.  And thyroid problems.  If people take Ashwaganda high doses for too long.  So that's important to note.  But assuming that the adaptogens are reducing cortisol levels.  Um, in addition to doing other things.  Is there a particular time of day or night that people should  consider taking them?  Should they avoid taking it early in the day?  My understanding was that you, you want a bit of that cortisol.  Or does all bump early in the day.  But you certainly want cortisol lower later in the day.  Yep.  And I think the problem is people think that they don't want any cortisol.  And they think that would be bad.  That would be bad.  They don't understand that the body has fluctuations of cortisol throughout  the day.  And that's normal.  If we're looking at having issues with sleeping and that anxiety  provoked from that sympathetic drive and elevation of cortisol.  Let it peak in the morning after you're waking up.  And look late afternoon.  Like four o'clock when it starts to dip to take your adaptogens then.  Because then it feeds forward to being able to relax more,  which feeds forward to better sleep.  For something like Shashanja where you're looking for that brain focus.  You can have it in the morning.  It doesn't necessarily have this big impact on cortisol that you see  with something like Tulsi or Ashaganda.  Because Shashanja is more stimulatory.  The other two are more calming.  I put some in my morning coffee and then the afternoon.  When I need to pick me up instead of more caffeine,  I'll use Shashanja.  Because it gives you that boost without the effects of caffeine  and it doesn't interfere with sleep.  So there's a time in a place to take them.  And yes, some need to be cycled on.  Some need to be cycled off.  But I tell women what are your main symptoms.  What are the things you're looking to control.  And we can look and see what kind of adaptogens we can use",
        "number": 27
      },
      {
        "title": "Pregnancy & Training; Cold & Hot Exposure",
        "start_time": 7211.0,
        "end_time": 7586.0,
        "text": " What's the story with pregnancy and training?  Yeah.  Is there an official word on this?  Assuming a woman knows that she's pregnant from the very beginning  of missing a period where she's in a position to make decisions  about training or not training, training at a given intensity  or not.  What are your recommendations?  The human body is really interesting.  And when you get pregnant, your body tells you what you can do.  So we see that you have a reduction in your anaerobic capacity  on purpose.  Your body's trying to be protective.  You do have an expansion of your blood volume.  So endurance is really good, but you can't do high intensity.  When we're looking at the general guidelines that are out there,  they've gotten rid of the heart rate rule.  They are now telling women to be as active as they can be  without creating injury and without trying to make gains.  So that means if you're in the weight room, you're not looking to improve.  You're looking to maintain.  If you're doing cardiovascular work and you have a specific class  that you'd love to go to.  Yeah, but don't beat yourself up that you can't hit that high intensity.  You're going for the social aspect.  You're not trying to gain fitness.  You're trying to maintain.  I think the very worst possible scenario is someone is super active  and stops doing everything.  Because they're afraid.  Because then they get deconditioned and then they end up in a worst state  than someone who was sedentary who's now encouraged to walk during exercise.  It hasn't been well researched because you can't get ethics to study pregnant women very well.  So we go on a lot on case studies and case study notes.  And the bottom line of it all is you stay active.  And you can do resistance training.  You can do all the cardiovascular work and your body will tell you what you can  and can't do.  I've been asked whether or not pregnant women can do deliberate cold exposure.  Probably no fewer than 2,500 times on social media.  And I never have an answer.  But I always default to the cautious answer which is,  please don't until you talk to somebody who actually has an answer.  Yeah.  Just because it sounds like a very precarious situation.  But in all honesty, I don't know.  I'm just biting time there.  And just saying, please go ask somebody who can give you a definitive answer.  Yeah.  So we see women who have a high risk for miscarriage.  That anything that they do that's incredibly stressful for the first 12 to 20 weeks  will put them at a higher risk for it.  So being very cautious, especially with cold,  because we know that there are so many different nuances.  Doing something like hot yoga when you're pregnant is not.  There is a research so it's not detrimental.  Yeah.  Because when we're looking at blood flow diversion that way,  when you have slight hypoxia to the placenta and to the baby,  there is a rebound effect that increases the vascularization,  so that the baby has better nutrients.  We see this also with exercise and exercise intensities.  This is why people are now saying you need to have some kind of blood flow change  and increase in core temperature to create these vascular effects  within the placenta to improve nutrient and nutrient delivery  to the developing fetus.  So heat's good.  Cold.  I'm not so sure of.  But probably not extreme heat.  Not extremely.  So that's why I mean like hot yoga is not going to the sauna.  Hot yoga sits around 40 degrees Celsius.  So what is that?  Just around 100 degrees Fahrenheit.  And in that situation, if you're feeling too hot, you leave.  You lie down on the floor.  Don't try to stay for the whole class.  But it's not going to be detrimental unless you're pushing yourself too much.  Again, everything in moderation, especially when you're pregnant.  It's almost the inverse of what we know for males,  which is if men want to conceive they should have weighed the sauna  because we know that heat is detrimental to the sperm viability  in a real way.  So much so that I tell guys if they are trying to get there,  partner pregnant, that they should bring an ice pack into the sauna.  They should insulate that ice pack.  Don't put it directly on the scroto for other reasons.  But that it's a, you know, that the effects of heat,  the negative effects of heat on sperm are real.  But there's also an interesting, it's not just a trend.  There's actually some research showing that  cooling the testicles leads to increases in testosterone.  Which is on the face of it kind of counterintuitive  because it turns out that it's about the vasoconstriction  causing the subsequent increase in blood flow  increased vasodilation.  So the inverse of what you just said,  which is that during the heating process,  the hypoxia induces more vascularization of the placenta.  So when talking about temperature,  one always has to think about the surface of the body  versus the brain response.  As we talked about earlier,  and then what's happening during the deliberate heat  or deliberate cold versus what's happening  after the deliberate heat or deliberate cold.  Everything biology is a process not an event.  And I should make full disclosure.  I started as an environmental exercise physiologist.  And my PhD was all in heat and heat research.  So I'm a little bit biased towards heat,  but I've done a significant amount of research in the hot and cold.  Thank you for the disclosure.  I see it more as an indication of real knowledge.  So thank you.  This is an aspect of your training.  I knew a little bit about based on your publications,  but I didn't realize the depth of knowledge.  So we're all benefiting here,  including this earlier protocol of sonopus training.  You can bet a lot of people are going to start incorporating that.  I think we might need to name that.  I've done this from time to time, name protocols  because people are reluctant to name them after themselves.  Maybe we call that the Sims protocol or something like that.  Anyway, your discomfort will be other people's benefit.",
        "number": 28
      },
      {
        "title": "Tool: Women in 50s & Older, Training & Nutrition for Longevity",
        "start_time": 7586.0,
        "end_time": 7778.0,
        "text": " that you mentioned earlier.  In anticipation of sitting down with you today,  I asked some different women that I know.  You know, if you could ask the world expert in exercise physiology,  hormones and nutrition, et cetera, as it relates to women,  one question, what would it be?  And one of the most common questions I got in the 50 and up category was,  what is the most efficient way for a woman older than 50 to train  for the maximum health span and lifespan benefits?  I love this question because I get it all the time.  We have to turn our brains away from everything  that's been predicated before to this point.  So for looking for longevity and we're looking at what we want to do  when we're 80 or 90, we want to be independently living.  We want to have good proprioception, balance,  we want to have good bones.  And we want to be strong.  So this is where we look at 10 minutes, three times a week, jump training.  So this isn't your landing softly in our knees.  This is like impact in the skeletal system.  A colleague in front of my entry seat,  and Tracy Klassel did PhD and post, not postdoc,  but post research on this and is developing an app on it  to show women how to jump to improve bone marrow density.  Over the course of four months of this type of training,  people have gone from being osteopenic to normal bone density.  So it's a different type of stress.  So if your concern is that which a lot of women do have a concern  because they lose about one third of their bone mass  at the onset of menopause.  Yeah, significant number.  Good news, Tracy.  She doesn't do something as an intervention.  So we see a lot of women are like, oh, I'm going to go on menopause  hormone therapy to stop bone loss.  Yeah, it can be a treatment, but I always look at an external stress  that we can put on the body that's going to invoke a change  without pharmaceuticals.  So jump training, heavy resistance training, and spray animal training.  Those are the three key things.  And from a training standpoint, and then from a nutrition standpoint,  getting protein is so important.  When you start telling women, they need to look at around one to one point.  One grams per pound, which is around that two to two point three grams per kilo per day.  They're like, whoa, that's a lot of protein.  It is because we haven't been conditioned to eat it.  But these scrambled eggs.  So chicken rest at lunch is a small steak at dinner.  Plus other things.  Right, exactly.  It doesn't all have to be animal products.  I mean, you're looking at all the different beans and things that you can put together.  That's the other big thing that in order to build the muscle and to keep the body  composition and state that we wanted to keep going for longevity.  Those are the big rocks.  The sprint interval training, the heavy resistance training, the jump training and the protein.  I'm thinking about this, and I'm thinking about my mother who's 79 years old.  She'll be 80 at the end of June and is in good health.  Walks a lot gardens, does some yoga, but does none of the things that you're describing.  So mom, please.",
        "number": 29
      },
      {
        "title": "Tool: Women in 20s-40s & Training, Lactate",
        "start_time": 7778.0,
        "end_time": 7938.0,
        "text": " In the same vein, what about the women out there age 20 to maybe make it the 20 to 40 bracket?  And if we need to divide that more finally, we can.  What is the most efficient way for them to train for health, bigger and longevity?  Making things fun for the most part.  I don't want people to think that it's a chore.  So if you're someone who's been told you need to run and you hate running, then don't run.  Right.  That's common sense.  And I say that because I see little kids in non-US countries that have to run across country.  And you see these kids when they're six years old and all running around the field.  And they're the kids that hate running that aren't natural runners.  And then they hate physical activity for the rest of their life.  So I put that in like when you are exercising, you want to find something that you find fun.  When you're in your 20s to 40s, you have more room to get away with things that might not be optimal for you when you start to get older.  Big rock again is resistance training.  It doesn't have to be heavy resistance training.  Like I said earlier to failure, you're periodizing.  If you want to do a block of Olympic lifting, go for it.  If you're like, and that comfortable doing that kind of lifting, I want to do more machine stuff.  Great.  But we want to make sure that you're changing it up all the time to keep things moving and shaking with regards to strengthen hypertrophy.  And then it becomes more of, are you training for something that's endurance?  Are you looking for just longevity for brain health?  We need to have some lactate production.  Because women, as I said at the beginning of the podcast are more oxidative,  we don't have as many of those glycolic fibers.  So what we're finding in older research is that there's a misstep in brain lactate metabolism.  Because the brain hasn't been exposed to it, especially for looking at women who are being studied now.  It hasn't been in a societal context to do that kind of work.  The younger we are and the more that we can keep our glycolic fibers going.  By doing high intensity work, the more we're exposing our brain to lactate,  the better we see fast forward to attenuating cognitive decline and reducing the plaque development of Alzheimer's.  This is why women who are in their 40s plus, I want them to do the sprint and the high intensity work for that lactate production.  Start early because then you can take some of those type 2B fibers that could either go more aerobic or anaerobic and make them more anaerobic.  So those are the two big things for women who are younger.  And then you can play around with the other things.  If you want to be an older endurance athlete, yeah, not really ideal, but yeah, you can do that.",
        "number": 30
      },
      {
        "title": "Tool: What is High-Intensity Training?, Cardiovascular Sets & Recovery",
        "start_time": 7938.0,
        "end_time": 8242.0,
        "text": " Forgive me because you've said it several times throughout today's discussion,  but I really want to drive home at the key point that I think for most people.  Men and women is not obvious, but is really important.  When you say high intensity, you don't mean a class or a run where your drenched in sweat and gasping for air at the end necessarily.  Let's disambiguate high intensity from what most people think of high intensity, which is a really hard workout.  A tough class where they had me moving the whole time doing a circuit, et cetera.  What is the appropriate high intensity workout look like?  Okay, so if I talk about true high intensity interval training.  If you're a runner, it's going to the track and doing sets of 400, 800.  Okay, so 400, a lap, 800, two of us, right?  So you're looking at between a minute and four minutes of hard work at 80% or more with variable recovery.  So that's why he's a track as an example.  So if you do one lap and you're like, oh, I'm going to walk half a lap and then do it again.  That's adequate recovery.  Yeah, it's hard.  But it's not like you're going to be there for 90 minutes doing as many 400s as you can.  Because you have that variable recovery, it might take half an hour to 40 minutes max.  And then your guest out, can't do it anymore.  If we're looking at a gym situation, I like to look at something like every minute on the minute,  where you might be doing 10 dead lifts at moderate intensity weight and it takes 50 seconds to complete that.  Then you have 10 seconds to move to the next exercise that might be thrusters.  So, you know, a squat, clean thrusters.  So it's a squat, pull the weight up overhead.  So you're doing maybe eight of those in that minute and you might have 10 second recovery.  You go to the next exercise that might be kettlebell swings.  And you're doing explosive kettlebell swings and you'll finish, you know, 10 seconds to go.  You go to the fourth exercise.  I don't know, toes to bar or some other kind of VIP, some other high intensity.  And then you have one minute completely off.  So you've had four minutes of really heavy work with maybe 10 seconds to move to the next exercise.  One minute completely off.  And then you repeat that three times.  And this is high intensity interval training.  This is not what you would consider resistance training for sake of building muscle.  Or strength.  Correct.  You're using these loads, these machines, the pike, you know, hanging from the bar and bringing  your knees up or else it or something as a tool to get the heart rate up continually.  Yep.  Very different than resistance training the way most people think about it.  Correct.  So this is the cardiovascular high intensity interval training.  And the subset of that is sprint interval training.  And this is something that's really, really hard and people don't get it.  I don't necessarily mean running.  It can be whatever mode of activity, but it's 30 seconds or less as hard as you can go.  So this is your 9 or 10 on your rating and perceived exertion.  110% it's max effort.  On the rower on the airdine bike.  Yeah.  Running if you like.  Yeah.  Any of those things.  The skier.  Yeah.  Battle ropes are big.  So 30 seconds all out then rest what 10 15 seconds repeat.  No.  Because now we're looking at that top end where we want a regeneration of your ATP, you know,  all of that system and central nervous system recovery.  So this is 30 seconds all out.  It can be two or three minutes of recovery.  Oh nice.  Because I'm not looking at Tabata where you 20 seconds on 20 seconds off because that's not the intensity we want.  We want you to go all out and recover well enough to be able to go all out again.  You're not leaving anything in the tank.  So those are what I mean by high intensity interval training or when you're looking at polarizing  your cardiovascular work.  That's the top end.  Those are the two examples of your top end.  And then your recovery is at long slow walking on another day where you're not going  and doing a tempo run.  You're not doing a 5k easy jog because that puts you in that modern intensity.  And if I heard you correctly earlier, you are suggesting most women do one or two days of high  intensity interval training plus three to four days of resistance training for sake of building  strength and muscle which looks very different.  It's more warm up.  Do a couple worksets, you know, two to four worksets of, you know, an overhead press, two  or four worksets of maybe a bar bell curl, two or four sets of some depth.  So whatever one's, you know, personal choices.  Yeah.  Okay.  Got it.  Very different far and away different than what most people men or women are doing out there,",
        "number": 31
      },
      {
        "title": "Training for Longevity, Cellular & Metabolic Changes",
        "start_time": 8242.0,
        "end_time": 8370.0,
        "text": " Because I look at the general consensus of what's out there in the fitness world is all based on aesthetics  and body composition.  And so people have this mentality of, I need to be hypertrophy to get swollen.  And I need to do long slow stuff on the cardio machine to lose body fat.  But that isn't what we're after.  We're after let's create really strong external stress to create adaptations not only from a neural  and a brain standpoint that's understanding it, but also feeding down to metabolic change.  Because if you have a really significant high stress, we see epigenetic changes within the muscle  that increase the amount of what we call the glute four gates.  So, you know, the proteins that open up that allow carbohydrate to come in without insulin.  So we're expanding that acute glucose uptake through an epigenetic change.  The other thing that it does is it causes an acute inflammatory response that your body learns to overcome.  And it's really important for women to do that.  Because as we start to lose estrogen, we lose a significant anti-inflammatory agent.  So this is why we see that increase in the visceral fat, especially when we're hitting your mid 40s onwards,  is because now you have this increase in free fatty acids and the inability for information to come down.  So the muscle cell is going, I don't know what to do with this.  So it's circulated to the liver and the liver stores it as visceral fat.  Whereas if you do that high intensity work, it creates a change within the muscle to understand.  Pull that in.  Let's use it.  Let's also bring more carbohydrate in and more glucose in use that, which helps use free fatty acids.  And it also creates a significant anti-inflammatory response at the level of the mitochondria and within the cell itself,  which is what estrogen used to do.  So if we look at those external stresses, it's not about body competence that it's per se.",
        "number": 32
      },
      {
        "title": "Nutrition, 80/20 Rule",
        "start_time": 8370.0,
        "end_time": 8611.0,
        "text": " And in terms of nutrition, you mentioned women should shoot for 1.1, 1.2 grams of quality protein per pound of body weight.  What other types of foods do you like to see women ingesting?  So are you a fan of fruit?  Yeah.  Great. Well, these days you sort of have to ask in these circles.  Vegetables.  Yep.  Fiber is important.  Yeah.  Absolutely.  And then in terms of starches to replace glycogen, especially people are doing these high-intensity interval training sessions and the resistance training.  What are your preferred sources?  What depends on who I'm working with?  I have some people who love cocoa pops and kids cereal.  Ooh, I cringe at that stuff.  But, you know, I prefer rice and oatmeal.  I like a really good sourdough bread with butter all of a while.  Yeah.  But there are some people who like the ultra-process stuff.  So I'm like, okay, if you really really need it, then you could put it on top of your yogurt after training as part of your carbohydrate up to only time.  Yeah.  Yeah.  Yeah.  But ideally, carbs are all the different colorful fruit and veg, and if we're looking at sweet potatoes or kumura.  If you're from other parts of the world.  Yams.  All those kinds of things.  Sprouted bread.  Fantastic.  Kinoa.  Amarith.  All of those different types of things.  It's just staying away from the ultra-processed.  And when we look at women, it's really important to have a very significant diversity in the gut microbiome.  So we see there's a definitive decrease when we start to have hormonal shifts because of the way the gut bugs help de-conjugate or unrap some of our hormones and shoot them back out in the circulation.  So as much fiber, colorful fruit and veg as you can.  But also it's the 80-20 rule.  80% of the time you're spot on 20% of life.  Because otherwise, where do we get our chocolate and our whiskey?  And there's some data that chocolate is good for us.  It is.  Especially the low sugar, dark chocolate.  But I look at it as how it makes you feel.  Makes you feel good.  Right.  Yeah.  Yeah.  One has to live.  Yeah.  And fats.  Where do you like to see women get their fats from?  Again, I'll do a full disclosure.  I've been vegan since I was in high school because of an incident of a field trip to a pixel water house and driving down the five.  But that's my own preference.  So when we're looking at fats, it can be from a lot of different sources.  I prefer women to have most their fats from plant-based stuff, not because I am plant-based, but because of the effect it has on the body.  But there is a time in a place where animal fats too.  The whole fear, mongering of saturated fatty acids from dairy has been this proven.  So for looking at what kinds of fats you want a conglomerate.  But you want most of them to come from whole food plant-based, not from ultra-processed.  And then, of course, you're reaching for some real butter.  You're reaching for some 4% fat yogurt or something like that.  To compliment your avocados, your nuts, your seeds, and your olive oils.  That all sounds very rational and delicious, in my opinion.  Yes, it's too common sense, people don't do it.  I think if people hear it from you, they'll do it.  I think people just need to hear it in the context of a non-diate context.  And you've done an amazing job today of explaining how nutrition fuels, training, training fuels, changes at the level of the muscle, the liver, et cetera.  A lot of what I'm hearing is that women should probably ingest more quality fuels in order to offset these cortisol spikes.  And feel better while training and to train more.",
        "number": 33
      },
      {
        "title": "Listening to Self",
        "start_time": 8611.0,
        "end_time": 8763.0,
        "text": " Kind of a fun, hopefully fun question for you.  If you had a magic wand, and you could get all the women on earth now and going forward to make a change.  You don't have to pick just one in terms of nutrition, how they think about their hormone cycle, exercise, health span, lifespan, what would it be?  I think I would have everyone understand their intrinsic selves because we have been inundated so much with sociocultural rhetoric and so much external noise that women have forgotten what it means to listen to themselves and their bodies.  I mean, that's the one thing that I have to re-teach women to do so often.  So if I could have a magic wand and have every woman understand what their bodies are saying and what their cycles are saying.  And Perry menopause is normal.  It's everyone's going to go through it if you have had a menstrual cycle, just intrinsically understand what their body is.  So then they have the tool to be able to implement external stressors that's going to be beneficial for them.  Well, Dr. Stacy Sims, this has been tremendously educational for me and I know for everybody listening and they're watching.  You've taken us on an amazing tour of the best ways to train with cardiovascular training and resistance training.  Those tailored specifically for women, as well as touching into some protocols for both men and women that are immensely powerful.  I talked a lot about the menstrual cycle. I get asked about the menstrual cycle and how it relates to training and vice versa.  So many times and thank you for providing clear actionable answers.  And you've also educated us on caffeine supplements, including revealing some supplements that I didn't know existed, which is not a common occurrence for me.  And many wins, many, many wins thanks to you and on and on. So just such a rich data set here, presented with such clarity and in an actionable way.  So I'll be half of myself and everyone listening and watching. I just want to say thank you.  And I know you've come a very long way from the other side of the equator, not just to see us, but given that your time is so precious, that you've come to visit us and share with us your knowledge.  I just want to say a really deep heartfelt. Thank you.  Yeah, thanks for having me. It's been fun.  And we'll have to have you back again. Maybe we'll come to New Zealand.  You should come down. Yeah, definitely.",
        "number": 34
      },
      {
        "title": "Zero-Cost Support, YouTube, Spotify & Apple Follow & Reviews, YouTube Feedback, Protocols Book, Social Media, Neural Network Newsletter",
        "start_time": 8763.0,
        "end_time": 8917.0,
        "text": " To learn more about her work, please see the links in our show note captions.  If you're learning from indoor enjoying this podcast, please subscribe to our YouTube channel.  Please also subscribe to the podcast on both Spotify and Apple. That's a terrific zero-cost way to support us.  And on both Spotify and Apple, you can leave us up to a five-star review.  Please also check out the sponsors that I mentioned at the beginning and throughout today's episode.  That's the best way to support this podcast.  If you have questions for me or comments about the podcast, or topics or guests you'd like me to consider for the human lab podcast,  please put those in the comment section on YouTube. I do read all the comments.  For those of you that haven't heard, I have a new book coming out. It's my very first book.  It's entitled Protocols, an operating manual for the human body.  This is a book that I've been working on for more than five years and that's based on more than 30 years of research and experience.  And it covers protocols where everything from sleep to exercise, to stress control protocols related to focus and motivation.  And of course, I provide the scientific substantiation for the protocols that are included.  The book is now available by presale at protocolsbook.com.  There you can find links to various vendors.  You can pick the one that you like best.  Again, the book is called Protocols, an operating manual for the human body.  If you're not already following me on social media,  I am a human lab on all social media channels.  So that's Instagram, X formerly known as Twitter, Threads, LinkedIn, and Facebook.  And on all those platforms, I discuss science and science related tools.  Some of which overlap with the contents of the human lab podcast,  but much of which is distinct from the contents of the human lab podcast.  And that's human and lab on all social media channels.  If you haven't already subscribed to our neural network newsletter,  our neural network newsletter is a zero-cost monthly newsletter that includes podcast summaries,  as well as protocols in the form of brief PDFs of one to three pages,  where I spell out the specific dues and in some cases do not,  but mostly dues related to things like how to optimize your sleep,  how to regulate your dopamine levels.  There's a protocol for neural plasticity and learning,  as well as protocols for fitness, which we call the foundational fitness protocol,  includes everything sets, reps, cardiovascular training.  Again, all available, completely zero-cost.  You simply go to hubermanlab.com, go to the menu tab, scroll down to newsletter,  and provide us your email.  But I should point out, we do not share your email with anybody.  Thank you once again for joining me for today's discussion with Dr. Stacey Sims.  And last, but certainly not least.  Thank you for your interest in science.  Thank you.",
        "number": 35
      }
    ]
  }
}